/*++

Copyright (c) 2016 Trent Nelson <trent@trent.me>

Module Name:

    Rtl.h

Abstract:

    This is the main header file for the Rtl (Run-time Library) component.
    It is named after the NT kernel's Rtl component.  It has two main roles:
    provide an interface to useful NT kernel primitives (such as bitmaps,
    prefix trees, hash tables, splay trees, AVL trees, etc) without the need
    to include ntddk.h (which can't be done if also including Windows.h) or
    link to ntdll.lib or ntoskrnl.lib (which requires the DDK to be installed).

    Type definitions for the data structures (e.g. RTL_BITMAP) are mirrored,
    and function type definitions and pointer types are provided for all NT
    functions.  They are made accessible as function pointers through a
    structure named RTL.

    In addition to NT functionality, this module also defines structures and
    functions for additional functionality we implement, such as convenience
    functions for string and path handling.

--*/

#pragma once

#ifdef __cplusplus
extern "C" {
#endif

#ifdef _RTL_INTERNAL_BUILD

//
// This is an internal build of the Rtl component.
//

#define RTL_API __declspec(dllexport)
#define RTL_DATA extern __declspec(dllexport)

#include "stdafx.h"

#elif _RTL_NO_API_EXPORT_IMPORT

//
// We're being included by someone who doesn't want dllexport or dllimport.
// This is useful for creating new .exe-based projects for things like unit
// testing or performance testing/profiling.
//


    if (!(Target)) {                                       \
        OutputDebugStringA("Failed to load " #Name ".\n"); \
        goto Error;                                        \
    }                                                      \
} while (0)

#define LOAD_LIBRARY_A(Target, Name) do {                  \
    (Target) = LoadLibraryA(#Name);                        \
    if (!(Target)) {                                       \
        OutputDebugStringA("Failed to load " #Name ".\n"); \
        goto Error;                                        \
    }                                                      \
} while (0)

#define RESOLVE_FUNCTION(Target, Module, Type, Name) do {                  \
    (Target) = (Type)GetProcAddress((Module), #Name);                      \
    if (!(Target)) {                                                       \
        OutputDebugStringA("Failed to resolve " #Module " !" #Name ".\n"); \
        goto Error;                                                        \
    }                                                                      \
} while (0)

#define ALLOCATE_TYPE(Target, Type, Allocator) do {                   \
    (Target) = (P##Type)(                                             \
        Allocator->Calloc(                                            \
            Allocator->Context,                                       \
            1,                                                        \
            sizeof(Type)                                              \
        )                                                             \
    );                                                                \
    if (!(Target)) {                                                  \
        OutputDebugStringA("Allocation of type " #Type " failed.\n"); \
        goto Error;                                                   \
    }                                                                 \
} while (0)

#define MAYBE_FREE_POINTER(Target, Allocator) do {      \
    if ((Target)) {                                     \
        Allocator->Free(Allocator->Context, &(Target)); \
    }                                                   \
} while (0)

#define MAYBE_FREE_LIBRARY(Module) do { \
    if ((Module)) {                     \
        FreeLibrary((Module));          \
        Module = NULL;                  \
    }                                   \
} while (0)

#define MAYBE_CLOSE_HANDLE(Handle) do { \
    if ((Handle)) {                     \
        CloseHandle((Handle));          \
        Handle = NULL;                  \
    }                                   \
} while (0)

#define TIMESTAMP_TO_SECONDS    1000000
#define SECONDS_TO_MICROSECONDS 1000000

typedef const LONG CLONG;
typedef PVOID *PPVOID;
typedef const PVOID PCVOID;
typedef const PVOID CPVOID;
typedef CHAR **PPCHAR;
typedef WCHAR **PPWCHAR;
typedef CHAR **PPSTR;
typedef WCHAR **PPWSTR;

typedef const SHORT CSHORT;

typedef struct _RTL *PRTL;

typedef struct _STRING {
    USHORT Length;
    USHORT MaximumLength;
    LONG   Hash;
    PCHAR  Buffer;
} STRING, ANSI_STRING, *PSTRING, *PANSI_STRING, **PPSTRING, **PPANSI_STRING;
typedef const STRING *PCSTRING;

typedef struct _UNICODE_STRING {
    USHORT Length;
    USHORT MaximumLength;
    LONG   Hash;
    PWSTR  Buffer;
} UNICODE_STRING, *PUNICODE_STRING, **PPUNICODE_STRING, ***PPPUNICODE_STRING;
typedef const UNICODE_STRING *PCUNICODE_STRING;
#define UNICODE_NULL ((WCHAR)0)

#include "Time.h"
#include "Memory.h"
#include "Commandline.h"

typedef CONST char *PCSZ;

#ifdef _M_X64
#pragma intrinsic(__readgsdword)
FORCEINLINE
DWORD
FastGetCurrentProcessId(VOID)
{
    return __readgsdword(0x40);
}

FORCEINLINE
DWORD
FastGetCurrentThreadId(VOID)
{
    return __readgsdword(0x48);
}
#endif

typedef LONG (MAINPROCA)(
    _In_ LONG NumberOfArguments,
    _In_ PPSTR ArgvA
    );
typedef MAINPROCA *PMAINPROCA;

typedef LONG (MAINPROCW)(
    _In_ LONG NumberOfArguments,
    _In_ PPWSTR ArgvW
    );
typedef MAINPROCW *PMAINPROCW;

typedef VOID (RTL_INIT_STRING)(
    _Out_       PSTRING     DestinationString,
    _In_opt_    PCSZ        SourceString
    );

typedef RTL_INIT_STRING *PRTL_INIT_STRING;

typedef VOID (RTL_COPY_UNICODE_STRING)(
    _Inout_  PUNICODE_STRING  DestinationString,
    _In_opt_ PCUNICODE_STRING SourceString
    );
typedef RTL_COPY_UNICODE_STRING *PRTL_COPY_UNICODE_STRING;

typedef VOID (RTL_COPY_STRING)(
    _Out_    PSTRING  DestinationString,
    _In_opt_ PCSTRING SourceString
    );
typedef RTL_COPY_STRING *PRTL_COPY_STRING;

typedef
NTSTATUS
(NTAPI RTL_APPEND_STRING_TO_STRING)(
    _Inout_       PSTRING Destination,
    _In_    const STRING  *Source
    );
typedef RTL_APPEND_STRING_TO_STRING *PRTL_APPEND_STRING_TO_STRING;

typedef NTSTATUS (*PRTL_APPEND_UNICODE_TO_STRING)(
    _Inout_  PUNICODE_STRING Destination,
    _In_opt_ PCWSTR          Source
    );

typedef NTSTATUS (*PRTL_APPEND_UNICODE_STRING_TO_STRING)(
    _Inout_ PUNICODE_STRING  Destination,
    _In_    PCUNICODE_STRING Source
    );

typedef NTSTATUS (*PRTL_UNICODE_STRING_TO_ANSI_STRING)(
    _Inout_ PANSI_STRING     DestinationString,
    _In_    PCUNICODE_STRING SourceString,
    _In_    BOOLEAN          AllocateDestinationString
    );

typedef ULONG (*PRTL_UNICODE_STRING_TO_ANSI_SIZE)(
    _In_ PUNICODE_STRING UnicodeString
    );

typedef BOOLEAN (*PRTL_EQUAL_STRING)(
    _In_    PCSTRING    String1,
    _In_    PCSTRING    String2,
    _In_    BOOLEAN     CaseInSensitive
    );

typedef BOOLEAN (*PRTL_EQUAL_UNICODE_STRING)(
    _In_    PCUNICODE_STRING    String1,
    _In_    PCUNICODE_STRING    String2,
    _In_    BOOLEAN             CaseInSensitive
    );

typedef LONG (*PRTL_COMPARE_STRING)(
    _In_ PCSTRING String1,
    _In_ PCSTRING String2,
    _In_ BOOL     CaseInSensitive
    );

typedef LONG (*PCOMPARE_STRING_CASE_INSENSITIVE)(
    _In_ PCSTRING String1,
    _In_ PCSTRING String2
    );


typedef struct _RTL_BITMAP {
    ULONG SizeOfBitMap;     // Number of bits.
    PULONG Buffer;
} RTL_BITMAP, *PRTL_BITMAP, **PPRTL_BITMAP;

typedef struct _RTL_BITMAP_RUN {
    ULONG StartingIndex;
    ULONG NumberOfBits;
} RTL_BITMAP_RUN, *PRTL_BITMAP_RUN, **PPRTL_BITMAP_RUN;

//
// The various bitmap find functions return 0xFFFFFFFF
// if they couldn't find the requested bit pattern.
//

#define BITS_NOT_FOUND 0xFFFFFFFF


// 65535 (1 << 16)
#define MAX_STRING  ((USHORT)0xffff)
#define MAX_USTRING ((USHORT)0xffff)

#define RTL_CONSTANT_STRING(s) { \
    sizeof(s) - sizeof((s)[0]),  \
    sizeof( s ),                 \
    0,                           \
    s                            \
}

typedef union _ULONG_INTEGER {
    struct {
        USHORT  LowPart;
        USHORT  HighPart;
    };
    ULONG   LongPart;

} ULONG_INTEGER, *PULONG_INTEGER;

typedef union _LONG_INTEGER {
    struct {
        USHORT  LowPart;
        SHORT   HighPart;
    };
    LONG   LongPart;
} LONG_INTEGER, *PLONG_INTEGER;

typedef union _USHORT_INTEGER {
    struct {
        BYTE  LowPart;
        BYTE  HighPart;
    };
    USHORT   ShortPart;

} USHORT_INTEGER, *PUSHORT_INTEGER;

typedef union _SHORT_INTEGER {
    struct {
        CHAR  LowPart;
        CHAR  HighPart;
    };
    SHORT   ShortPart;

} SHORT_INTEGER, *PSHORT_INTEGER;

typedef union _WIDE_CHARACTER {
    struct {
        CHAR  LowPart;
        CHAR  HighPart;
    };
    WCHAR WidePart;

} WIDE_CHARACTER, *PWIDE_CHARACTER;

typedef union _OCTWORD_INTEGER {
    struct {
        LARGE_INTEGER LowPart;
        LARGE_INTEGER HighPart;
    };
    __m128 OctPart;
} OCTWORD_INTEGER, *POCTWORD_INTEGER, **PPOCTWORD_INTEGER;

typedef _Null_terminated_ CHAR *PSZ;
//typedef const PSZ PCSZ;

typedef BOOL (WINAPI *PGET_PROCESS_MEMORY_INFO)(
    _In_  HANDLE                      Process,
    _Out_ PPROCESS_MEMORY_COUNTERS    ppsmemCounters,
    _In_  DWORD                       cb
    );

typedef
BOOL
(WINAPI GET_PERFORMANCE_INFO)(
    _Out_writes_bytes_all_(cb) PPERFORMANCE_INFORMATION PerfInfo,
    _In_ DWORD cb
    );
typedef GET_PERFORMANCE_INFO *PGET_PERFORMANCE_INFO;

typedef BOOL (WINAPI *PGET_PROCESS_IO_COUNTERS)(
    _In_  HANDLE          Process,
    _Out_ PIO_COUNTERS    lpIoCounters
    );

typedef BOOL (WINAPI *PGET_PROCESS_HANDLE_COUNT)(
    _In_  HANDLE      Process,
    _Out_ PDWORD      pdwHandleCount
    );

typedef
_Check_return_
_Success_(return != 0)
BOOL
(WINAPI INITIALIZE_PROCESS_FOR_WS_WATCH)(
    _In_ HANDLE ProcessHandle
    );
typedef INITIALIZE_PROCESS_FOR_WS_WATCH *PINITIALIZE_PROCESS_FOR_WS_WATCH;

typedef
_Check_return_
_Success_(return != 0)
BOOL
(WINAPI GET_WS_CHANGES)(
    _In_ HANDLE ProcessHandle,
    _Out_writes_bytes_(SizeOfWatchInfoBufferInBytes)
         PPSAPI_WS_WATCH_INFORMATION WatchInfo,
    _In_ ULONG SizeOfWatchInfoBufferInBytes
    );
typedef GET_WS_CHANGES *PGET_WS_CHANGES;

typedef
_Check_return_
_Success_(return != 0)
BOOL
(WINAPI GET_WS_CHANGES_EX)(
    _In_ HANDLE ProcessHandle,

    _Out_writes_bytes_to_(*SizeOfWatchInfoExBufferInBytes,
                          *SizeOfWatchInfoExBufferInBytes)
         PPSAPI_WS_WATCH_INFORMATION_EX WatchInfoEx,

    _Inout_ PULONG SizeOfWatchInfoExBufferInBytes
    );
typedef GET_WS_CHANGES_EX *PGET_WS_CHANGES_EX;

typedef
_Check_return_
_Success_(return != 0)
BOOL
(WINAPI QUERY_WORKING_SET)(
    _In_ HANDLE ProcessHandle,

    _Out_writes_bytes_(SizeOfWorkingSetInfoBufferInBytes)
         PPSAPI_WORKING_SET_INFORMATION WorkingSetInfo,

    _In_ ULONG SizeOfWorkingSetInfoBufferInBytes
    );
typedef QUERY_WORKING_SET *PQUERY_WORKING_SET;

typedef
_Check_return_
_Success_(return != 0)
BOOL
(WINAPI QUERY_WORKING_SET_EX)(
    _In_ HANDLE ProcessHandle,

    _Out_writes_bytes_(SizeOfWorkingSetExInfoBufferInBytes)
         PPSAPI_WORKING_SET_EX_INFORMATION WorkingSetExInfo,

    _In_ ULONG SizeOfWorkingSetExInfoBufferInBytes
    );
typedef QUERY_WORKING_SET_EX *PQUERY_WORKING_SET_EX;

//
// Rtl Heap related functions.
//

typedef
NTSTATUS
(NTAPI RTL_HEAP_COMMIT_ROUTINE)(
    _In_    PVOID    Base,
    _Inout_ PVOID   *CommitAddress,
    _Inout_ PSIZE_T  CommitSize
    );
typedef RTL_HEAP_COMMIT_ROUTINE *PRTL_HEAP_COMMIT_ROUTINE;

typedef struct _RTL_HEAP_PARAMETERS {
    ULONG Length;
    SIZE_T SegmentReserve;
    SIZE_T SegmentCommit;
    SIZE_T DeCommitFreeBlockThreshold;
    SIZE_T DeCommitTotalFreeThreshold;
    SIZE_T MaximumAllocationSize;
    SIZE_T VirtualMemoryThreshold;
    SIZE_T InitialCommit;
    SIZE_T InitialReserve;
    PRTL_HEAP_COMMIT_ROUTINE CommitRoutine;
    SIZE_T Reserved[2];
} RTL_HEAP_PARAMETERS, *PRTL_HEAP_PARAMETERS;

typedef
_Check_return_
_Success_(return != 0)
PVOID
(NTAPI RTL_ALLOCATE_HEAP)(
    _In_        PVOID   HeapHandle,
    _In_opt_    ULONG   Flags,
    _In_        SIZE_T  SizeInBytes
    );
typedef RTL_ALLOCATE_HEAP *PRTL_ALLOCATE_HEAP;

typedef
_Check_return_
_Success_(return != 0)
PVOID
(NTAPI RTL_CREATE_HEAP)(
    _In_     ULONG                Flags,
    _In_opt_ PVOID                HeapBase,
    _In_opt_ SIZE_T               ReserveSize,
    _In_opt_ SIZE_T               CommitSize,
    _In_opt_ PVOID                Lock,
    _In_opt_ PRTL_HEAP_PARAMETERS Parameters
    );
typedef RTL_CREATE_HEAP *PRTL_CREATE_HEAP;

typedef
_Check_return_
(NTAPI RTL_DESTROY_HEAP)(
    _In_ PVOID HeapHandle
    );
typedef RTL_DESTROY_HEAP *PRTL_DESTROY_HEAP;

typedef
_Check_return_
_Success_(return != 0)
BOOLEAN
(NTAPI RTL_FREE_HEAP)(
    _In_     PVOID HeapHandle,
    _In_opt_ ULONG Flags,
    _In_     PVOID HeapBase
    );
typedef RTL_FREE_HEAP *PRTL_FREE_HEAP;

typedef
_Check_return_
NTSTATUS
(NTAPI ZW_ALLOCATE_VIRTUAL_MEMORY)(
    _In_    HANDLE    ProcessHandle,
    _Inout_ PVOID     *BaseAddress,
    _In_    ULONG_PTR ZeroBits,
    _Inout_ PSIZE_T   RegionSize,
    _In_    ULONG     AllocationType,
    _In_    ULONG     Protect
    );
typedef ZW_ALLOCATE_VIRTUAL_MEMORY *PZW_ALLOCATE_VIRTUAL_MEMORY;

typedef
_Check_return_
NTSTATUS
(NTAPI ZW_FREE_VIRTUAL_MEMORY)(
    _In_    HANDLE  ProcessHandle,
    _Inout_ PVOID   *BaseAddress,
    _Inout_ PSIZE_T RegionSize,
    _In_    ULONG   FreeType
    );
typedef ZW_FREE_VIRTUAL_MEMORY *PZW_FREE_VIRTUAL_MEMORY;

typedef
USHORT
(NTAPI RTL_CAPTURE_STACK_BACK_TRACE)(
    _In_      ULONG  FramesToSkip,
    _In_      ULONG  FramesToCapture,
    _Out_     PVOID  *BackTrace,
    _Out_opt_ PULONG BackTraceHash
    );
typedef RTL_CAPTURE_STACK_BACK_TRACE *PRTL_CAPTURE_STACK_BACK_TRACE;

typedef
PRUNTIME_FUNCTION
(WINAPI RTL_LOOKUP_FUNCTION_ENTRY)(
    _In_  ULONGLONG  ControlPc,
    _Out_ PULONGLONG ImageBase,
    _Inout_opt_ PUNWIND_HISTORY_TABLE HistoryTable
    );
typedef RTL_LOOKUP_FUNCTION_ENTRY *PRTL_LOOKUP_FUNCTION_ENTRY;

//
// Process and Thread support.
//

typedef enum _PROCESSINFOCLASS {
    ProcessBasicInformation = 0x0,
    ProcessQuotaLimits = 0x1,
    ProcessIoCounters = 0x2,
    ProcessVmCounters = 0x3,
    ProcessTimes = 0x4,
    ProcessBasePriority = 0x5,
    ProcessRaisePriority = 0x6,
    ProcessDebugPort = 0x7,
    ProcessExceptionPort = 0x8,
    ProcessAccessToken = 0x9,
    ProcessLdtInformation = 0xA,
    ProcessLdtSize = 0xB,
    ProcessDefaultHardErrorMode = 0xC,
    ProcessIoPortHandlers = 0xD,
    ProcessPooledUsageAndLimits = 0xE,
    ProcessWorkingSetWatch = 0xF,
    ProcessUserModeIOPL = 0x10,
    ProcessEnableAlignmentFaultFixup = 0x11,
    ProcessPriorityClass = 0x12,
    ProcessWx86Information = 0x13,
    ProcessHandleCount = 0x14,
    ProcessAffinityMask = 0x15,
    ProcessPriorityBoost = 0x16,
    ProcessDeviceMap = 0x17,
    ProcessSessionInformation = 0x18,
    ProcessForegroundInformation = 0x19,
    ProcessWow64Information = 0x1A,
    ProcessImageFileName = 0x1B,
    ProcessLUIDDeviceMapsEnabled = 0x1C,
    ProcessBreakOnTermination = 0x1D,
    ProcessDebugObjectHandle = 0x1E,
    ProcessDebugFlags = 0x1F,
    ProcessHandleTracing = 0x20,
    ProcessIoPriority = 0x21,
    ProcessExecuteFlags = 0x22,
    ProcessTlsInformation = 0x23,
    ProcessCookie = 0x24,
    ProcessImageInformation = 0x25,
    ProcessCycleTime = 0x26,
    ProcessPagePriority = 0x27,
    ProcessInstrumentationCallback = 0x28,
    ProcessThreadStackAllocation = 0x29,
    ProcessWorkingSetWatchEx = 0x2A,
    ProcessImageFileNameWin32 = 0x2B,
    ProcessImageFileMapping = 0x2C,
    ProcessAffinityUpdateMode = 0x2D,
    ProcessMemoryAllocationMode = 0x2E,
    ProcessGroupInformation = 0x2F,
    ProcessTokenVirtualizationEnabled = 0x30,
    ProcessConsoleHostProcess = 0x31,
    ProcessWindowInformation = 0x32,
    ProcessHandleInformation = 0x33,
    ProcessMitigationPolicy = 0x34,
    ProcessDynamicFunctionTableInformation = 0x35,
    ProcessHandleCheckingMode = 0x36,
    ProcessKeepAliveCount = 0x37,
    ProcessRevokeFileHandles = 0x38,
    ProcessWorkingSetControl = 0x39,
    MaxProcessInfoClass = 0x3A
} PROCESSINFOCLASS, *PPROCESSINFOCLASS;

typedef enum _THREADINFOCLASS {
    ThreadBasicInformation,
    ThreadTimes,
    ThreadPriority,
    ThreadBasePriority,
    ThreadAffinityMask,
    ThreadImpersonationToken,
    ThreadDescriptorTableEntry,
    ThreadEnableAlignmentFaultFixup,
    ThreadEventPair_Reusable,
    ThreadQuerySetWin32StartAddress,
    ThreadZeroTlsCell,
    ThreadPerformanceCount,
    ThreadAmILastThread,
    ThreadIdealProcessor,
    ThreadPriorityBoost,
    ThreadSetTlsArrayAddress,
    ThreadIsIoPending,
    ThreadHideFromDebugger,
    ThreadBreakOnTermination,
    ThreadSwitchLegacyState,
    ThreadIsTerminated,
    MaxThreadInfoClass
} THREADINFOCLASS, *PTHREADINFOCLASS;

typedef
NTSTATUS
(WINAPI NT_QUERY_INFORMATION_PROCESS)(
    _In_      HANDLE           ProcessHandle,
    _In_      PROCESSINFOCLASS ProcessInfoClass,
    _Out_     PVOID            ProcessInformation,
    _In_      ULONG            ProcessInformationLength,
    _Out_opt_ PULONG           ReturnLength
    );
typedef NT_QUERY_INFORMATION_PROCESS *PNT_QUERY_INFORMATION_PROCESS;
typedef NT_QUERY_INFORMATION_PROCESS   ZW_QUERY_INFORMATION_PROCESS;
typedef ZW_QUERY_INFORMATION_PROCESS *PZW_QUERY_INFORMATION_PROCESS;

typedef struct _PEB_LDR_DATA {
    ULONG Length;
    BOOLEAN Initialized;
    HANDLE SsHandle;
    LIST_ENTRY InLoadOrderModuleList;
    LIST_ENTRY InMemoryOrderModuleList;
    LIST_ENTRY InInitializationOrderModuleList;
    PVOID EntryInProgress;
} PEB_LDR_DATA, *PPEB_LDR_DATA;

typedef struct _LDR_DATA_TABLE_ENTRY {
    LIST_ENTRY InLoadOrderModuleList;
    LIST_ENTRY InMemoryOrderLinks;
    LIST_ENTRY InInitializationOrderModuleList;
    PVOID DllBase;
    PVOID EntryPoint;
    union {
        ULONG SizeOfImage;
        PVOID _Padding;
    };
    UNICODE_STRING FullDllName;
    UNICODE_STRING BaseDllName;
    ULONG Flags;
    USHORT LoadCount;
    USHORT TlsIndex;
    union {
        LIST_ENTRY HashLinks;
        struct {
            PVOID SectionPointer;
            ULONG CheckSum;
        };
    };
    union {
        struct {
            ULONG TimeDateStamp;
        };
        struct {
            PVOID LoadedImports;
        };
    };
} LDR_DATA_TABLE_ENTRY, *PLDR_DATA_TABLE_ENTRY;

#ifndef LDR_DLL_NOTIFICATION_REASON_LOADED
#define LDR_DLL_NOTIFICATION_REASON_LOADED 1
#endif

#ifndef LDR_DLL_NOTIFICATION_REASON_UNLOADED
#define LDR_DLL_NOTIFICATION_REASON_UNLOADED 2
#endif

typedef struct _LDR_DLL_LOADED_NOTIFICATION_DATA {
    ULONG Flags;
    PCUNICODE_STRING FullDllName;
    PCUNICODE_STRING BaseDllName;
    PVOID DllBase;
    ULONG SizeOfImage;
} LDR_DLL_LOADED_NOTIFICATION_DATA, *PLDR_DLL_LOADED_NOTIFICATION_DATA;

typedef struct _LDR_DLL_UNLOADED_NOTIFICATION_DATA {
    ULONG Flags;
    PCUNICODE_STRING FullDllName;
    PCUNICODE_STRING BaseDllName;
    PVOID DllBase;
    ULONG SizeOfImage;
} LDR_DLL_UNLOADED_NOTIFICATION_DATA, *PLDR_DLL_UNLOADED_NOTIFICATION_DATA;

typedef union _LDR_DLL_NOTIFICATION_DATA {
    LDR_DLL_LOADED_NOTIFICATION_DATA Loaded;
    LDR_DLL_UNLOADED_NOTIFICATION_DATA Unloaded;
} LDR_DLL_NOTIFICATION_DATA, *PLDR_DLL_NOTIFICATION_DATA;
typedef const LDR_DLL_NOTIFICATION_DATA *PCLDR_DLL_NOTIFICATION_DATA;

typedef
VOID
(CALLBACK LDR_DLL_NOTIFICATION_FUNCTION)(
    _In_     ULONG                       NotificationReason,
    _In_     PCLDR_DLL_NOTIFICATION_DATA NotificationData,
    _In_opt_ PVOID                       Context
    );
typedef LDR_DLL_NOTIFICATION_FUNCTION *PLDR_DLL_NOTIFICATION_FUNCTION;

typedef
NTSTATUS
(NTAPI LDR_REGISTER_DLL_NOTIFICATION)(
    _In_     ULONG                          Flags,
    _In_     PLDR_DLL_NOTIFICATION_FUNCTION NotificationFunction,
    _In_opt_ PVOID                          Context,
    _Out_    PVOID                          *Cookie
    );
typedef LDR_REGISTER_DLL_NOTIFICATION *PLDR_REGISTER_DLL_NOTIFICATION;

typedef
NTSTATUS
(NTAPI LDR_UNREGISTER_DLL_NOTIFICATION)(
    _In_ PVOID Cookie
    );
typedef LDR_UNREGISTER_DLL_NOTIFICATION *PLDR_UNREGISTER_DLL_NOTIFICATION;

#define LDR_LOCK_LOADER_LOCK_FLAG_RAISE_ON_ERRORS (0x00000001)
#define LDR_LOCK_LOADER_LOCK_FLAG_TRY_ONLY (0x00000002)

#define LDR_LOCK_LOADER_LOCK_DISPOSITION_INVALID (0)
#define LDR_LOCK_LOADER_LOCK_DISPOSITION_LOCK_ACQUIRED (1)
#define LDR_LOCK_LOADER_LOCK_DISPOSITION_LOCK_NOT_ACQUIRED (2)

typedef
NTSTATUS
(NTAPI LDR_LOCK_LOADER_LOCK)(
    _In_ ULONG Flags,
    _Inout_opt_ PULONG Disposition,
    _Out_ PVOID *Cookie
    );
typedef LDR_LOCK_LOADER_LOCK *PLDR_LOCK_LOADER_LOCK;

#define LDR_UNLOCK_LOADER_LOCK_FLAG_RAISE_ON_ERRORS (0x00000001)

typedef
NTSTATUS
(NTAPI LDR_UNLOCK_LOADER_LOCK)(
    _In_ ULONG Flags,
    _Inout_ PVOID Cookie
    );
typedef LDR_UNLOCK_LOADER_LOCK *PLDR_UNLOCK_LOADER_LOCK;

typedef struct _RTL_USER_PROCESS_PARAMETERS {
    BYTE           Reserved1[16];
    PVOID          Reserved2[10];
    UNICODE_STRING ImagePathName;
    UNICODE_STRING CommandLine;
} RTL_USER_PROCESS_PARAMETERS, *PRTL_USER_PROCESS_PARAMETERS;

#define FLS_MAXIMUM_AVAILABLE 128
#define TLS_MINIMUM_AVAILABLE 64
#define TLS_EXPANSION_SLOTS   1024

#define GDI_HANDLE_BUFFER_SIZE  60
typedef ULONG GDI_HANDLE_BUFFER[GDI_HANDLE_BUFFER_SIZE];

typedef struct _PEB_FREE_BLOCK {
    struct _PEB_FREE_BLOCK *Next;
    ULONG Size;
} PEB_FREE_BLOCK, *PPEB_FREE_BLOCK;

typedef
VOID
(PS_POST_PROCESS_INIT_ROUTINE)(
    VOID
    );
typedef PS_POST_PROCESS_INIT_ROUTINE *PPS_POST_PROCESS_INIT_ROUTINE;

typedef struct _PEB {
    BOOLEAN InheritedAddressSpace;
    BOOLEAN ReadImageFileExecOptions;
    BOOLEAN BeingDebugged;
    union {
        BOOLEAN BitField;
        struct {
            BOOLEAN ImageUsesLargePages:1;
            BOOLEAN SpareBits:7;
         };
    };
    HANDLE Mutant;
    PVOID ImageBaseAddress;
    PPEB_LDR_DATA Ldr;
    PRTL_USER_PROCESS_PARAMETERS ProcessParameters;
    PVOID SubSystemData;
    PVOID ProcessHeap;
    PCRITICAL_SECTION FastPebLock;
    PVOID AtlThunkSListPtr;
    PVOID SparePtr2;
    ULONG EnvironmentUpdateCount;
    PVOID KernelCallbackTable;
    ULONG SystemReserved[1];
    ULONG SpareUlong;
    PPEB_FREE_BLOCK FreeList;
    ULONG TlsExpansionCounter;
    PVOID TlsBitmap;
    ULONG TlsBitmapBits[2];
    PVOID ReadOnlySharedMemoryBase;
    PVOID ReadOnlySharedMemoryHeap;
    PPVOID ReadOnlyStaticServerData;
    PVOID AnsiCodePageData;
    PVOID OemCodePageData;
    PVOID UnicodeCaseTableData;
    ULONG NumberOfProcessors;
    ULONG NtGlobalFlag;
    LARGE_INTEGER CriticalSectionTimeout;
    SIZE_T HeapSegmentReserve;
    SIZE_T HeapSegmentCommit;
    SIZE_T HeapDeCommitTotalFreeThreshold;
    SIZE_T HeapDeCommitFreeBlockThreshold;
    ULONG NumberOfHeaps;
    ULONG MaximumNumberOfHeaps;
    PPVOID ProcessHeaps;
    PVOID GdiSharedHandleTable;
    PVOID ProcessStarterHelper;
    ULONG GdiDCAttributeList;
    PCRITICAL_SECTION LoaderLock;
    ULONG OSMajorVersion;
    ULONG OSMinorVersion;
    USHORT OSBuildNumber;
    USHORT OSCSDVersion;
    ULONG OSPlatformId;
    ULONG ImageSubsystem;
    ULONG ImageSubsystemMajorVersion;
    ULONG ImageSubsystemMinorVersion;
    ULONG_PTR ImageProcessAffinityMask;
    GDI_HANDLE_BUFFER GdiHandleBuffer;
    PPS_POST_PROCESS_INIT_ROUTINE PostProcessInitRoutine;
    PVOID TlsExpansionBitmap;
    ULONG TlsExpansionBitmapBits[32];
    ULONG SessionId;
    ULARGE_INTEGER AppCompatFlags;
    ULARGE_INTEGER AppCompatFlagsUser;
    PVOID pShimData;
    PVOID AppCompatInfo;
    UNICODE_STRING CSDVersion;
    const struct _ACTIVATION_CONTEXT_DATA *ActivationContextData;
    struct _ASSEMBLY_STORAGE_MAP *ProcessAssemblyStorageMap;
    const struct _ACTIVATION_CONTEXT_DATA *SystemDefaultActivationContextData;
    struct _ASSEMBLY_STORAGE_MAP *SystemAssemblyStorageMap;
    SIZE_T MinimumStackCommit;
    PPVOID FlsCallback;
    LIST_ENTRY FlsListHead;
    PVOID FlsBitmap;
    ULONG FlsBitmapBits[FLS_MAXIMUM_AVAILABLE / (sizeof(ULONG) * 8)];
    ULONG FlsHighIndex;
} PEB, *PPEB;

typedef struct _ACTIVATION_CONTEXT_STACK {
    struct _RTL_ACTIVATION_CONTEXT_STACK_FRAME *ActiveFrame;
    LIST_ENTRY FrameListCache;
    ULONG Flags;
    ULONG NextCookieSequenceNumber;
    ULONG StackId;
} ACTIVATION_CONTEXT_STACK, * PACTIVATION_CONTEXT_STACK;

typedef const ACTIVATION_CONTEXT_STACK *PCACTIVATION_CONTEXT_STACK;

typedef struct _TEB_ACTIVE_FRAME_CONTEXT {
    ULONG Flags;
    PCSTR FrameName;
} TEB_ACTIVE_FRAME_CONTEXT, *PTEB_ACTIVE_FRAME_CONTEXT;

typedef const TEB_ACTIVE_FRAME_CONTEXT *PCTEB_ACTIVE_FRAME_CONTEXT;

typedef struct _TEB_ACTIVE_FRAME_CONTEXT_EX {
    TEB_ACTIVE_FRAME_CONTEXT BasicContext;
    PCSTR SourceLocation;
} TEB_ACTIVE_FRAME_CONTEXT_EX, *PTEB_ACTIVE_FRAME_CONTEXT_EX;

typedef const TEB_ACTIVE_FRAME_CONTEXT_EX *PCTEB_ACTIVE_FRAME_CONTEXT_EX;

typedef struct _TEB_ACTIVE_FRAME {
    ULONG Flags;
    struct _TEB_ACTIVE_FRAME *Previous;
    PCTEB_ACTIVE_FRAME_CONTEXT Context;
} TEB_ACTIVE_FRAME, *PTEB_ACTIVE_FRAME;

typedef const TEB_ACTIVE_FRAME *PCTEB_ACTIVE_FRAME;

typedef struct _TEB_ACTIVE_FRAME_EX {
    TEB_ACTIVE_FRAME BasicFrame;
    PVOID ExtensionIdentifier;
} TEB_ACTIVE_FRAME_EX, *PTEB_ACTIVE_FRAME_EX;

typedef const TEB_ACTIVE_FRAME_EX *PCTEB_ACTIVE_FRAME_EX;

typedef struct _CLIENT_ID {
    HANDLE ProcessId;
    HANDLE ThreadId;
} CLIENT_ID, *PCLIENT_ID;

#define WIN32_CLIENT_INFO_LENGTH 62
#define STATIC_UNICODE_BUFFER_LENGTH 261

#define GDI_BATCH_BUFFER_SIZE 310

typedef struct _GDI_TEB_BATCH {
    ULONG     Offset;
    ULONG_PTR HDC;
    ULONG     Buffer[GDI_BATCH_BUFFER_SIZE];
} GDI_TEB_BATCH,*PGDI_TEB_BATCH;

typedef struct _TEB {
    NT_TIB NtTib;
    PVOID EnvironmentPointer;
    CLIENT_ID ClientId;
    PVOID ActiveRpcHandle;
    PVOID ThreadLocalStoragePointer;
    PPEB ProcessEnvironmentBlock;
    ULONG LastErrorValue;
    ULONG CountOfOwnedCriticalSections;
    PVOID CsrClientThread;
    PVOID Win32ThreadInfo;
    ULONG User32Reserved[26];
    ULONG UserReserved[5];
    PVOID WOW32Reserved;
    LCID CurrentLocale;
    ULONG FpSoftwareStatusRegister;
    PVOID SystemReserved1[54];
    NTSTATUS ExceptionCode;
    PACTIVATION_CONTEXT_STACK ActivationContextStackPointer;
    UCHAR SpareBytes1[28];
    GDI_TEB_BATCH GdiTebBatch;
    CLIENT_ID RealClientId;
    HANDLE GdiCachedProcessHandle;
    ULONG GdiClientPID;
    ULONG GdiClientTID;
    PVOID GdiThreadLocalInfo;
    ULONG_PTR Win32ClientInfo[WIN32_CLIENT_INFO_LENGTH];
    PVOID glDispatchTable[233];
    ULONG_PTR glReserved1[29];
    PVOID glReserved2;
    PVOID glSectionInfo;
    PVOID glSection;
    PVOID glTable;
    PVOID glCurrentRC;
    PVOID glContext;
    ULONG LastStatusValue;
    UNICODE_STRING StaticUnicodeString;
    WCHAR StaticUnicodeBuffer[STATIC_UNICODE_BUFFER_LENGTH];
    PVOID DeallocationStack;
    PVOID TlsSlots[TLS_MINIMUM_AVAILABLE];
    LIST_ENTRY TlsLinks;
    PVOID Vdm;
    PVOID ReservedForNtRpc;
    PVOID DbgSsReserved[2];
    ULONG HardErrorMode;
    PVOID Instrumentation[14];
    PVOID SubProcessTag;
    PVOID EtwTraceData;
    PVOID WinSockData;
    ULONG GdiBatchCount;
    BOOLEAN InDbgPrint;
    BOOLEAN FreeStackOnTermination;
    BOOLEAN HasFiberData;
    BOOLEAN IdealProcessor;
    ULONG GuaranteedStackBytes;
    PVOID ReservedForPerf;
    PVOID ReservedForOle;
    ULONG WaitingOnLoaderLock;
    ULONG_PTR SparePointer1;
    ULONG_PTR SoftPatchPtr1;
    ULONG_PTR SoftPatchPtr2;
    PPVOID TlsExpansionSlots;
    PVOID DeallocationBStore;
    PVOID BStoreLimit;
    LCID ImpersonationLocale;
    ULONG IsImpersonating;
    PVOID NlsCache;
    PVOID pShimData;
    ULONG HeapVirtualAffinity;
    HANDLE CurrentTransactionHandle;
    PTEB_ACTIVE_FRAME ActiveFrame;
    PVOID FlsData;
    BOOLEAN SafeThunkCall;
    BOOLEAN BooleanSpare[3];
} TEB, *PTEB;

typedef struct _INITIAL_TEB {
    struct {
        PVOID OldStackBase;
        PVOID OldStackLimit;
    } OldInitialTeb;
    PVOID StackBase;
    PVOID StackLimit;
    PVOID StackAllocationBase;
} INITIAL_TEB, *PINITIAL_TEB;

typedef LONG KPRIORITY;

#define NtCurrentPeb() (NtCurrentTeb()->ProcessEnvironmentBlock)

typedef struct _THREAD_BASIC_INFORMATION {
    NTSTATUS ExitStatus;
    PTEB TebBaseAddress;
    CLIENT_ID ClientId;
    ULONG_PTR AffinityMask;
    KPRIORITY Priority;
    LONG BasePriority;
} THREAD_BASIC_INFORMATION;
typedef THREAD_BASIC_INFORMATION *PTHREAD_BASIC_INFORMATION;

typedef struct _PROCESS_BASIC_INFORMATION {
    NTSTATUS ExitStatus;
    PPEB PebBaseAddress;
    ULONG_PTR AffinityMask;
    KPRIORITY BasePriority;
    ULONG_PTR UniqueProcessId;
    ULONG_PTR InheritedFromUniqueProcessId;
} PROCESS_BASIC_INFORMATION;

typedef struct _OBJECT_ATTRIBUTES {
    ULONG Length;
    HANDLE RootDirectory;
    PUNICODE_STRING ObjectName;
    ULONG Attributes;
    PVOID SecurityDescriptor;
    PVOID SecurityQualityOfService;
} OBJECT_ATTRIBUTES, *POBJECT_ATTRIBUTES;

typedef enum _SECTION_INHERIT {
    ViewShare = 1,
    ViewUnmap = 2
} SECTION_INHERIT, *PSECTION_INHERIT;

typedef
NTSTATUS
(NTAPI NT_CREATE_SECTION)(
    _Out_    PHANDLE            SectionHandle,
    _In_     ACCESS_MASK        DesiredAccess,
    _In_opt_ POBJECT_ATTRIBUTES ObjectAttributes,
    _In_opt_ PLARGE_INTEGER     MaximumSize,
    _In_     ULONG              SectionPageProtection,
    _In_     ULONG              AllocationAttributes,
    _In_opt_ HANDLE             FileHandle
    );
typedef NT_CREATE_SECTION *PNT_CREATE_SECTION;
typedef NT_CREATE_SECTION   ZW_CREATE_SECTION;
typedef ZW_CREATE_SECTION *PZW_CREATE_SECTION;

typedef
NTSTATUS
(NTAPI NT_MAP_VIEW_OF_SECTION)(
    _In_        HANDLE          SectionHandle,
    _In_        HANDLE          ProcessHandle,
    _Inout_     PVOID           *BaseAddress,
    _In_        ULONG_PTR       ZeroBits,
    _In_        SIZE_T          CommitSize,
    _Inout_opt_ PLARGE_INTEGER  SectionOffset,
    _Inout_     PSIZE_T         ViewSize,
    _In_        SECTION_INHERIT InheritDisposition,
    _In_        ULONG           AllocationType,
    _In_        ULONG           Win32Protect
    );
typedef NT_MAP_VIEW_OF_SECTION *PNT_MAP_VIEW_OF_SECTION;
typedef NT_MAP_VIEW_OF_SECTION   ZW_MAP_VIEW_OF_SECTION;
typedef ZW_MAP_VIEW_OF_SECTION *PZW_MAP_VIEW_OF_SECTION;

typedef
NTSTATUS
(NTAPI NT_UNMAP_VIEW_OF_SECTION)(
    _In_        HANDLE  ProcessHandle,
    _In_opt_    PVOID   BaseAddress
    );
typedef NT_UNMAP_VIEW_OF_SECTION *PNT_UNMAP_VIEW_OF_SECTION;
typedef NT_UNMAP_VIEW_OF_SECTION   ZW_UNMAP_VIEW_OF_SECTION;
typedef ZW_UNMAP_VIEW_OF_SECTION *PZW_UNMAP_VIEW_OF_SECTION;

typedef
NTSTATUS
(NTAPI NT_CREATE_PROCESS)(
    _Out_ PHANDLE ProcessHandle,
    _In_ ACCESS_MASK DesiredAccess,
    _In_opt_ POBJECT_ATTRIBUTES ObjectAttributes,
    _In_ HANDLE ParentProcess,
    _In_ BOOLEAN InheritObjectTable,
    _In_opt_ HANDLE SectionHandle,
    _In_opt_ HANDLE DebugPort,
    _In_opt_ HANDLE ExceptionPort
    );
typedef NT_CREATE_PROCESS *PNT_CREATE_PROCESS;
typedef NT_CREATE_PROCESS   ZW_CREATE_PROCESS;
typedef ZW_CREATE_PROCESS *PZW_CREATE_PROCESS;

typedef
NTSTATUS
(NTAPI NT_CREATE_PROCESS_EX)(
    _Out_ PHANDLE ProcessHandle,
    _In_ ACCESS_MASK DesiredAccess,
    _In_opt_ POBJECT_ATTRIBUTES ObjectAttributes,
    _In_ HANDLE ParentProcess,
    _In_ BOOLEAN InheritObjectTable,
    _In_opt_ HANDLE SectionHandle,
    _In_opt_ HANDLE DebugPort,
    _In_opt_ HANDLE ExceptionPort,
    _In_ ULONG JobMemberLevel
    );
typedef NT_CREATE_PROCESS_EX *PNT_CREATE_PROCESS_EX;
typedef NT_CREATE_PROCESS_EX   ZW_CREATE_PROCESS_EX;
typedef ZW_CREATE_PROCESS_EX *PZW_CREATE_PROCESS_EX;

typedef
NTSTATUS
(NTAPI NT_CREATE_THREAD)(
    _Out_ PHANDLE ThreadHandle,
    _In_ ACCESS_MASK DesiredAccess,
    _In_opt_ POBJECT_ATTRIBUTES ObjectAttributes,
    _In_ HANDLE ProcessHandle,
    _Out_ PCLIENT_ID ClientId,
    _In_ PCONTEXT ThreadContext,
    _In_ PINITIAL_TEB InitialTeb,
    _In_ BOOLEAN CreateSuspended
    );
typedef NT_CREATE_THREAD *PNT_CREATE_THREAD;
typedef NT_CREATE_THREAD   ZW_CREATE_THREAD;
typedef ZW_CREATE_THREAD *PZW_CREATE_THREAD;

typedef
NTSTATUS
(NTAPI NT_OPEN_THREAD)(
    _Out_ PHANDLE ThreadHandle,
    _In_ ACCESS_MASK DesiredAccess,
    _In_ POBJECT_ATTRIBUTES ObjectAttributes,
    _In_opt_ PCLIENT_ID ClientId
    );
typedef NT_OPEN_THREAD *PNT_OPEN_THREAD;
typedef NT_OPEN_THREAD   ZW_OPEN_THREAD;
typedef ZW_OPEN_THREAD *PZW_OPEN_THREAD;

typedef
NTSTATUS
(NTAPI NT_TERMINATE_THREAD)(
    _In_opt_ HANDLE ThreadHandle,
    _In_ NTSTATUS ExitStatus
    );
typedef NT_TERMINATE_THREAD *PNT_TERMINATE_THREAD;
typedef NT_TERMINATE_THREAD   ZW_TERMINATE_THREAD;
typedef ZW_TERMINATE_THREAD *PZW_TERMINATE_THREAD;

typedef
VOID
(APC_ROUTINE) (
    _In_opt_ PVOID ApcArgument1,
    _In_opt_ PVOID ApcArgument2,
    _In_opt_ PVOID ApcArgument3
    );
typedef APC_ROUTINE *PAPC_ROUTINE;

typedef
NTSTATUS
(NTAPI NT_QUEUE_APC_THREAD)(
    _In_ HANDLE ThreadHandle,
    _In_ PAPC_ROUTINE ApcRoutine,
    _In_opt_ PVOID ApcArgument1,
    _In_opt_ PVOID ApcArgument2,
    _In_opt_ PVOID ApcArgument3
    );
typedef NT_QUEUE_APC_THREAD *PNT_QUEUE_APC_THREAD;

typedef
NTSTATUS
(NTAPI NT_TEST_ALERT)(
    VOID
    );
typedef NT_TEST_ALERT *PNT_TEST_ALERT;

//
// SystemTime-related functions.
//

typedef VOID (WINAPI *PGETSYSTEMTIMEPRECISEASFILETIME)(
    _Out_ LPFILETIME lpSystemTimeAsFileTime
);

typedef NTSTATUS (WINAPI *PNTQUERYSYSTEMTIME)(
    _Out_ PLARGE_INTEGER SystemTime
    );

typedef BOOL (*PGETSYSTEMTIMEPRECISEASLARGEINTEGER)(
    _Out_   PLARGE_INTEGER  SystemTime
);

#define _SYSTEM_TIMER_FUNCTIONS_HEAD                                \
    PGETSYSTEMTIMEPRECISEASFILETIME GetSystemTimePreciseAsFileTime; \
    PNTQUERYSYSTEMTIME NtQuerySystemTime;

FORCEINLINE
VOID
CopySystemTime(
    _In_ PSYSTEMTIME Dest,
    _In_ PSYSTEMTIME Source
    )
{
    __movsq((PULONGLONG)Dest, (PULONGLONG)Source, sizeof(*Dest) >> 3);
}

typedef struct _SYSTEM_TIMER_FUNCTION {
    _SYSTEM_TIMER_FUNCTIONS_HEAD
} SYSTEM_TIMER_FUNCTION, *PSYSTEM_TIMER_FUNCTION, **PPSYSTEM_TIMER_FUNCTION;

BOOL
CallSystemTimer(
    _Out_       PFILETIME               SystemTime,
    _Inout_opt_ PPSYSTEM_TIMER_FUNCTION ppSystemTimerFunction
);

typedef
NTSTATUS
(WINAPI RTL_CHAR_TO_INTEGER)(
    _In_ PCSZ String,
    _In_opt_ ULONG Base,
    _Out_ PULONG Value
    );
typedef RTL_CHAR_TO_INTEGER *PRTL_CHAR_TO_INTEGER;

typedef
DWORD
(WINAPI SEARCHPATHW)(
    _In_opt_    LPCWSTR     lpPath,
    _In_        LPCWSTR     lpFileName,
    _In_opt_    LPCWSTR     lpExtension,
    _In_        DWORD       nBufferLength,
    _Out_       LPWSTR      lpBuffer,
    _Out_opt_   LPWSTR      lpFilePart
    );
typedef SEARCHPATHW *PSEARCHPATHW;

//
// CRT functions.
//

typedef
INT
(__cdecl CRTCOMPARE)(
    _In_    CONST PVOID Key,
    _In_    CONST PVOID Datum
    );
typedef CRTCOMPARE *PCRTCOMPARE;

typedef
PVOID
(BSEARCH)(
    _In_ CPVOID      Key,
    _In_ CPVOID      Base,
    _In_ SIZE_T      NumberOfElements,
    _In_ SIZE_T      WidthOfElement,
    _In_ PCRTCOMPARE Compare
    );
typedef BSEARCH *PBSEARCH;

typedef
VOID
(QSORT)(
    _In_ PVOID       Base,
    _In_ SIZE_T      NumberOfElements,
    _In_ SIZE_T      WidthOfElement,
    _In_ PCRTCOMPARE Compare
    );
typedef QSORT *PQSORT;

//
// atexit-related functions and structures.
//

typedef
VOID
(__cdecl ATEXITFUNC)(
    VOID
    );
typedef ATEXITFUNC *PATEXITFUNC;

typedef
_Success_(return == 0)
INT
(ATEXIT)(
    _In_ PATEXITFUNC AtExitFunc
    );
typedef ATEXIT *PATEXIT;

typedef
VOID
(SET_ATEXIT)(
    _In_ PATEXIT AtExit
    );
typedef SET_ATEXIT *PSET_ATEXIT;

//
// Our extended version of CRT atexit() functionality.  Callers can indicate
// if they wish to suppress exceptions during callback, and additionally provide
// a context parameter passed to the callback function when invoked.
//

typedef struct _Struct_size_bytes_(sizeof(ULONG)) _ATEXITEX_FLAGS {

    //
    // When set, indicates that the caller's atexit function will be wrapped
    // in a __try/__except SEH block that suppresses all exceptions.
    //

    ULONG SuppressExceptions:1;

} ATEXITEX_FLAGS, *PATEXITEX_FLAGS;
C_ASSERT(sizeof(ATEXITEX_FLAGS) == sizeof(ULONG));

typedef
VOID
(CALLBACK ATEXITEX_CALLBACK)(
    _In_ BOOL IsProcessTerminating,
    _In_opt_ PVOID Context
    );
typedef ATEXITEX_CALLBACK *PATEXITEX_CALLBACK;

typedef
_Success_(return == 0)
BOOL
(ATEXITEX)(
    _In_ PATEXITEX_CALLBACK Callback,
    _In_opt_ PATEXITEX_FLAGS Flags,
    _In_opt_ PVOID Context,
    _Outptr_opt_result_nullonfailure_ struct _RTL_ATEXIT_ENTRY **EntryPointer
    );
typedef ATEXITEX *PATEXITEX;

typedef
VOID
(SET_ATEXITEX)(
    _In_ PATEXITEX AtExitEx
    );
typedef SET_ATEXITEX *PSET_ATEXITEX;

typedef
_Success_(return != 0)
_Check_return_
BOOL
(UNREGISTER_RTL_ATEXIT_ENTRY)(
    _In_ _Post_invalid_ struct _RTL_ATEXIT_ENTRY *Entry
    );
typedef UNREGISTER_RTL_ATEXIT_ENTRY *PUNREGISTER_RTL_ATEXIT_ENTRY;

//
// End of atexit-related functionality.
//

typedef
PVOID
(MEMSET)(
    _In_ PVOID Destination,
    _In_ INT Character,
    _In_ SIZE_T Count
    );
typedef MEMSET *PMEMSET;

typedef
PWCHAR
(WMEMSET)(
    _In_ PWCHAR Destination,
    _In_ WCHAR Character,
    _In_ SIZE_T Count
    );
typedef WMEMSET *PWMEMSET;

//
// End of CRT functions.
//

typedef NTSYSAPI SIZE_T (NTAPI RTL_COMPARE_MEMORY)(
    _In_ const VOID * Source1,
    _In_ const VOID * Source2,
    _In_ SIZE_T Length
    );

typedef RTL_COMPARE_MEMORY *PRTL_COMPARE_MEMORY;

typedef
EXCEPTION_DISPOSITION
(__cdecl __C_SPECIFIC_HANDLER)(
    PEXCEPTION_RECORD ExceptionRecord,
    ULONG_PTR Frame,
    PCONTEXT Context,
    struct _DISPATCHER_CONTEXT *Dispatch
    );
typedef __C_SPECIFIC_HANDLER *P__C_SPECIFIC_HANDLER;

typedef
VOID
(SET_C_SPECIFIC_HANDLER)(
    _In_ P__C_SPECIFIC_HANDLER Handler
    );
typedef SET_C_SPECIFIC_HANDLER *PSET_C_SPECIFIC_HANDLER;

typedef
VOID
(__cdecl __SECURITY_INIT_COOKIE)(
    VOID
    );
typedef __SECURITY_INIT_COOKIE *P__SECURITY_INIT_COOKIE;

//
// Prefix Helpers
//

typedef BOOLEAN (NTAPI *PRTL_PREFIX_STRING)(
    _In_ PCSTRING String1,
    _In_ PCSTRING String2,
    _In_ BOOLEAN CaseInSensitive
    );

typedef BOOLEAN (NTAPI *PRTL_SUFFIX_STRING)(
    _In_ PCSTRING String1,
    _In_ PCSTRING String2,
    _In_ BOOLEAN CaseInSensitive
    );

typedef BOOLEAN (NTAPI *PRTL_PREFIX_UNICODE_STRING)(
    _In_ PCUNICODE_STRING String1,
    _In_ PCUNICODE_STRING String2,
    _In_ BOOLEAN CaseInSensitive
    );

typedef BOOLEAN (NTAPI *PRTL_SUFFIX_UNICODE_STRING)(
    _In_ PCUNICODE_STRING String1,
    _In_ PCUNICODE_STRING String2,
    _In_ BOOLEAN CaseInSensitive
    );

//
// Splay Links
//

typedef struct _RTL_SPLAY_LINKS {
    struct _RTL_SPLAY_LINKS *Parent;
    struct _RTL_SPLAY_LINKS *LeftChild;
    struct _RTL_SPLAY_LINKS *RightChild;
} RTL_SPLAY_LINKS, *PRTL_SPLAY_LINKS;
C_ASSERT(sizeof(RTL_SPLAY_LINKS) == 24);

typedef PRTL_SPLAY_LINKS (NTAPI PRTL_SPLAY)(
    _Inout_ PRTL_SPLAY_LINKS Links
    );


//
// Generic Tables
//

typedef struct _TABLE_ENTRY_HEADER {
    RTL_SPLAY_LINKS SplayLinks;
    LIST_ENTRY ListEntry;
    LONGLONG UserData;
} TABLE_ENTRY_HEADER, *PTABLE_ENTRY_HEADER;
C_ASSERT(sizeof(TABLE_ENTRY_HEADER) == 48);

//
// _HEADER_HEADER is a terrible name for something, unless you're dealing with
// the header of a header, which is what we're dealing with here.
//

typedef struct _TABLE_ENTRY_HEADER_HEADER {

    RTL_SPLAY_LINKS SplayLinks;
    LIST_ENTRY ListEntry;

} TABLE_ENTRY_HEADER_HEADER, *PTABLE_ENTRY_HEADER_HEADER;

typedef enum _TABLE_SEARCH_RESULT {
    TableEmptyTree,
    TableFoundNode,
    TableInsertAsLeft,
    TableInsertAsRight
} TABLE_SEARCH_RESULT;

struct _RTL_GENERIC_TABLE;

typedef enum _RTL_GENERIC_COMPARE_RESULTS {
    GenericLessThan,
    GenericGreaterThan,
    GenericEqual
} RTL_GENERIC_COMPARE_RESULTS;

typedef RTL_GENERIC_COMPARE_RESULTS (NTAPI *PRTL_GENERIC_COMPARE_ROUTINE)(
    _In_ struct _RTL_GENERIC_TABLE  *Table,
    _In_ PVOID  FirstStruct,
    _In_ PVOID  SecondStruct
    );

typedef PVOID (NTAPI *PRTL_GENERIC_ALLOCATE_ROUTINE) (
    _In_ struct _RTL_GENERIC_TABLE  *Table,
    _In_ CLONG  ByteSize
    );

typedef VOID (NTAPI *PRTL_GENERIC_FREE_ROUTINE)(
    _In_ struct _RTL_GENERIC_TABLE *Table,
    _In_ PVOID  Buffer
    );

typedef struct _RTL_GENERIC_TABLE {
    PRTL_SPLAY_LINKS              TableRoot;
    LIST_ENTRY                    InsertOrderList;
    PLIST_ENTRY                   OrderedPointer;
    ULONG                         WhichOrderedElement;
    ULONG                         NumberGenericTableElements;
    PRTL_GENERIC_COMPARE_ROUTINE  CompareRoutine;
    PRTL_GENERIC_ALLOCATE_ROUTINE AllocateRoutine;
    PRTL_GENERIC_FREE_ROUTINE     FreeRoutine;
    PVOID                         TableContext;
} RTL_GENERIC_TABLE, *PRTL_GENERIC_TABLE;

typedef VOID (NTAPI *PRTL_INITIALIZE_GENERIC_TABLE)(
    _Out_    PRTL_GENERIC_TABLE            Table,
    _In_     PRTL_GENERIC_COMPARE_ROUTINE  CompareRoutine,
    _In_     PRTL_GENERIC_ALLOCATE_ROUTINE AllocateRoutine,
    _In_     PRTL_GENERIC_FREE_ROUTINE     FreeRoutine,
    _In_opt_ PVOID                         TableContext
    );

typedef PVOID (NTAPI *PRTL_INSERT_ELEMENT_GENERIC_TABLE)(
    _In_ PRTL_GENERIC_TABLE Table,
    _In_ PVOID Buffer,
    _In_ CLONG BufferSize,
    _Out_opt_ PBOOLEAN NewElement
    );

typedef PVOID (NTAPI *PRTL_INSERT_ELEMENT_GENERIC_TABLE_FULL)(
    _In_ PRTL_GENERIC_TABLE Table,
    _In_ PVOID Buffer,
    _In_ CLONG BufferSize,
    _Out_opt_ PBOOLEAN NewElement,
    _In_ PVOID NodeOrParent,
    _In_ TABLE_SEARCH_RESULT SearchResult
    );

typedef BOOLEAN (NTAPI *PRTL_DELETE_ELEMENT_GENERIC_TABLE)(
    _In_ PRTL_GENERIC_TABLE Table,
    _In_ PVOID Buffer
    );

typedef PVOID (NTAPI *PRTL_LOOKUP_ELEMENT_GENERIC_TABLE)(
    _In_ PRTL_GENERIC_TABLE Table,
    _In_ PVOID Buffer
    );

typedef PVOID (NTAPI *PRTL_LOOKUP_ELEMENT_GENERIC_TABLE_FULL)(
    _In_ PRTL_GENERIC_TABLE Table,
    _In_ PVOID Buffer,
    _Out_ PVOID *NodeOrParent,
    _Out_ TABLE_SEARCH_RESULT *SearchResult
    );

typedef PVOID (NTAPI *PRTL_ENUMERATE_GENERIC_TABLE)(
    _In_ PRTL_GENERIC_TABLE Table,
    _In_ BOOLEAN Restart
    );

typedef PVOID (NTAPI *PRTL_ENUMERATE_GENERIC_TABLE_WITHOUT_SPLAYING)(
    _In_ PRTL_GENERIC_TABLE Table,
    _Inout_ PVOID *RestartKey
    );

typedef PVOID (NTAPI *PRTL_GET_ELEMENT_GENERIC_TABLE)(
    _In_ PRTL_GENERIC_TABLE Table,
    _In_ ULONG I
    );

typedef PVOID (NTAPI *PRTL_NUMBER_GENERIC_TABLE_ELEMENTS)(
    _In_ PRTL_GENERIC_TABLE Table
    );

typedef BOOLEAN (NTAPI *PRTL_IS_GENERIC_TABLE_EMPTY)(
    _In_ PRTL_GENERIC_TABLE Table
    );

//
// Avl Table
//

typedef struct _RTL_BALANCED_LINKS {
    struct _RTL_BALANCED_LINKS *Parent;
    struct _RTL_BALANCED_LINKS *LeftChild;
    struct _RTL_BALANCED_LINKS *RightChild;
    CHAR Balance;
    UCHAR Reserved[3];
    ULONG Padding;
} RTL_BALANCED_LINKS;
typedef RTL_BALANCED_LINKS *PRTL_BALANCED_LINKS;
C_ASSERT(sizeof(RTL_BALANCED_LINKS) == 32);

typedef RTL_GENERIC_COMPARE_RESULTS (NTAPI *PRTL_AVL_COMPARE_ROUTINE)(
    _In_ struct _RTL_AVL_TABLE *Table,
    _In_ PVOID FirstStruct,
    _In_ PVOID SecondStruct
    );

typedef PVOID (NTAPI *PRTL_AVL_ALLOCATE_ROUTINE)(
    _In_ struct _RTL_AVL_TABLE *Table,
    _In_ CLONG ByteSize
    );

typedef VOID (NTAPI *PRTL_AVL_FREE_ROUTINE)(
    _In_ struct _RTL_AVL_TABLE *Table,
    _In_ __drv_freesMem(Mem) _Post_invalid_ PVOID Buffer
    );

typedef struct _RTL_AVL_TABLE {
    RTL_BALANCED_LINKS BalancedRoot;
    PVOID OrderedPointer;
    ULONG WhichOrderedElement;
    ULONG NumberGenericTableElements;
    ULONG DepthOfTree;
    ULONG Unused1;
    PRTL_BALANCED_LINKS RestartKey;
    ULONG DeleteCount;
    ULONG Unused2;
    PRTL_AVL_COMPARE_ROUTINE CompareRoutine;
    PRTL_AVL_ALLOCATE_ROUTINE AllocateRoutine;
    PRTL_AVL_FREE_ROUTINE FreeRoutine;
    PVOID TableContext;
} RTL_AVL_TABLE, *PRTL_AVL_TABLE;
C_ASSERT(FIELD_OFFSET(RTL_AVL_TABLE, OrderedPointer) == 32);
C_ASSERT(sizeof(RTL_AVL_TABLE) == 32+8+4+4+4+4+8+4+4+8+8+8+8);
C_ASSERT(sizeof(RTL_AVL_TABLE) == 104);

typedef NTSTATUS (NTAPI *PRTL_AVL_MATCH_FUNCTION)(
    _In_ struct _RTL_AVL_TABLE *Table,
    _In_ PVOID UserData,
    _In_ PVOID MatchData
    );

typedef VOID (NTAPI *PRTL_INITIALIZE_GENERIC_TABLE_AVL)(
    _Out_ PRTL_AVL_TABLE Table,
    _In_ PRTL_AVL_COMPARE_ROUTINE CompareRoutine,
    _In_ PRTL_AVL_ALLOCATE_ROUTINE AllocateRoutine,
    _In_ PRTL_AVL_FREE_ROUTINE FreeRoutine,
    _In_opt_ PVOID TableContext
    );

typedef PVOID (NTAPI *PRTL_INSERT_ELEMENT_GENERIC_TABLE_AVL)(
    _In_ PRTL_AVL_TABLE Table,
    _In_ PVOID Buffer,
    _In_ CLONG BufferSize,
    _Out_opt_ PBOOLEAN NewElement
    );

typedef PVOID (NTAPI *PRTL_INSERT_ELEMENT_GENERIC_TABLE_FULL_AVL)(
    _In_ PRTL_AVL_TABLE Table,
    _In_ PVOID Buffer,
    _In_ CLONG BufferSize,
    _Out_opt_ PBOOLEAN NewElement,
    _In_ PVOID NodeOrParent,
    _In_ TABLE_SEARCH_RESULT SearchResult
    );

typedef BOOLEAN (NTAPI *PRTL_DELETE_ELEMENT_GENERIC_TABLE_AVL)(
    _In_ PRTL_AVL_TABLE Table,
    _In_ PVOID Buffer
    );

typedef PVOID (NTAPI *PRTL_LOOKUP_ELEMENT_GENERIC_TABLE_AVL)(
    _In_ PRTL_AVL_TABLE Table,
    _In_ PVOID Buffer
    );

typedef PVOID (NTAPI *PRTL_LOOKUP_ELEMENT_GENERIC_TABLE_FULL_AVL)(
    _In_ PRTL_AVL_TABLE Table,
    _In_ PVOID Buffer,
    _Out_ PVOID *NodeOrParent,
    _Out_ TABLE_SEARCH_RESULT *SearchResult
    );

typedef PVOID (NTAPI *PRTL_ENUMERATE_GENERIC_TABLE_AVL)(
    _In_ PRTL_AVL_TABLE Table,
    _In_ BOOLEAN Restart
    );

typedef PVOID (NTAPI *PRTL_ENUMERATE_GENERIC_TABLE_WITHOUT_SPLAYING_AVL)(
    _In_ PRTL_AVL_TABLE Table,
    _Inout_ PVOID *RestartKey
    );

typedef PVOID (NTAPI *PRTL_LOOKUP_FIRST_MATCHING_ELEMENT_GENERIC_TABLE_AVL)(
    _In_ PRTL_AVL_TABLE Table,
    _In_ PVOID Buffer,
    _Out_ PVOID *RestartKey
    );

typedef PVOID (NTAPI *PRTL_ENUMERATE_GENERIC_TABLE_LIKE_A_DICTIONARY)(
    _In_ PRTL_AVL_TABLE Table,
    _In_opt_ PRTL_AVL_MATCH_FUNCTION MatchFunction,
    _In_opt_ PVOID MatchData,
    _In_ ULONG NextFlag,
    _Inout_ PVOID *RestartKey,
    _Inout_ PULONG DeleteCount,
    _In_ PVOID Buffer
    );

typedef PVOID (NTAPI *PRTL_GET_ELEMENT_GENERIC_TABLE_AVL)(
    _In_ PRTL_AVL_TABLE Table,
    _In_ ULONG I
    );

typedef PVOID (NTAPI *PRTL_NUMBER_GENERIC_TABLE_ELEMENTS_AVL)(
    _In_ PRTL_AVL_TABLE Table
    );

typedef BOOLEAN (NTAPI *PRTL_IS_GENERIC_TABLE_EMPTY_AVL)(
    _In_ PRTL_AVL_TABLE Table
    );

//
// Hash Tables
//

typedef struct _RTL_DYNAMIC_HASH_TABLE_ENTRY {
    LIST_ENTRY Linkage;
    ULONG_PTR Signature;
} RTL_DYNAMIC_HASH_TABLE_ENTRY, *PRTL_DYNAMIC_HASH_TABLE_ENTRY;
C_ASSERT(sizeof(RTL_DYNAMIC_HASH_TABLE_ENTRY) == 24);

typedef struct _RTL_DYNAMIC_HASH_TABLE_CONTEXT {
    PLIST_ENTRY ChainHead;
    PLIST_ENTRY PrevLinkage;
    ULONG_PTR Signature;
} RTL_DYNAMIC_HASH_TABLE_CONTEXT, *PRTL_DYNAMIC_HASH_TABLE_CONTEXT;
C_ASSERT(sizeof(RTL_DYNAMIC_HASH_TABLE_CONTEXT) == 24);

typedef struct _RTL_DYNAMIC_HASH_TABLE_ENUMERATOR {
    union {
       RTL_DYNAMIC_HASH_TABLE_ENTRY HashEntry;
       PLIST_ENTRY CurEntry;
    };
    PLIST_ENTRY ChainHead;
    ULONG BucketIndex;
    ULONG Padding1;
} RTL_DYNAMIC_HASH_TABLE_ENUMERATOR, *PRTL_DYNAMIC_HASH_TABLE_ENUMERATOR;
C_ASSERT(sizeof(RTL_DYNAMIC_HASH_TABLE_ENUMERATOR) == 40);

typedef struct _RTL_DYNAMIC_HASH_TABLE {

    // Entries initialized at creation
    ULONG Flags;
    ULONG Shift;

    // Entries used in bucket computation.
    ULONG TableSize;
    ULONG Pivot;
    ULONG DivisorMask;

    // Counters
    ULONG NumEntries;
    ULONG NonEmptyBuckets;
    ULONG NumEnumerators;

    // The directory. This field is for internal use only.
    PVOID Directory;

} RTL_DYNAMIC_HASH_TABLE, *PRTL_DYNAMIC_HASH_TABLE;

FORCEINLINE
VOID
RtlInitHashTableContext(
    _Inout_ PRTL_DYNAMIC_HASH_TABLE_CONTEXT Context
    )
{
    Context->ChainHead = NULL;
    Context->PrevLinkage = NULL;
}

typedef BOOLEAN (NTAPI RTL_CREATE_HASH_TABLE)(
    _Inout_ PRTL_DYNAMIC_HASH_TABLE *HashTable,
    _In_ ULONG Shift,
    _In_ ULONG Flags
    );
typedef RTL_CREATE_HASH_TABLE *PRTL_CREATE_HASH_TABLE;

typedef BOOLEAN (NTAPI RTL_CREATE_HASH_TABLE_EX)(
    _Inout_ PRTL_DYNAMIC_HASH_TABLE *HashTable,
    _In_ ULONG InitialSize,
    _In_ ULONG Shift,
    _In_ ULONG Flags
    );
typedef RTL_CREATE_HASH_TABLE_EX *PRTL_CREATE_HASH_TABLE_EX;

typedef VOID (NTAPI RTL_DELETE_HASH_TABLE)(
    _In_ PRTL_DYNAMIC_HASH_TABLE HashTable
    );
typedef RTL_DELETE_HASH_TABLE *PRTL_DELETE_HASH_TABLE;

typedef BOOLEAN (NTAPI RTL_INSERT_ENTRY_HASH_TABLE)(
    _In_ PRTL_DYNAMIC_HASH_TABLE HashTable,
    _In_ PRTL_DYNAMIC_HASH_TABLE_ENTRY Entry,
    _In_ ULONG_PTR Signature,
    _Inout_opt_ PRTL_DYNAMIC_HASH_TABLE_CONTEXT Context
    );
typedef RTL_INSERT_ENTRY_HASH_TABLE *PRTL_INSERT_ENTRY_HASH_TABLE;

typedef BOOLEAN (NTAPI *PRTL_REMOVE_ENTRY_HASH_TABLE)(
    _In_ PRTL_DYNAMIC_HASH_TABLE HashTable,
    _In_ PRTL_DYNAMIC_HASH_TABLE_ENTRY Entry,
    _Inout_opt_ PRTL_DYNAMIC_HASH_TABLE_CONTEXT Context
    );

typedef PRTL_DYNAMIC_HASH_TABLE_ENTRY (NTAPI *PRTL_LOOKUP_ENTRY_HASH_TABLE)(
    _In_ PRTL_DYNAMIC_HASH_TABLE HashTable,
    _In_ ULONG_PTR Signature,
    _Out_opt_ PRTL_DYNAMIC_HASH_TABLE_CONTEXT Context
    );

typedef PRTL_DYNAMIC_HASH_TABLE_ENTRY (NTAPI *PRTL_GET_NEXT_ENTRY_HASH_TABLE)(
    _In_ PRTL_DYNAMIC_HASH_TABLE HashTable,
    _In_ PRTL_DYNAMIC_HASH_TABLE_CONTEXT Context
    );

typedef BOOLEAN (NTAPI *PRTL_INIT_ENUMERATION_HASH_TABLE)(
    _In_ PRTL_DYNAMIC_HASH_TABLE HashTable,
    _Out_ PRTL_DYNAMIC_HASH_TABLE_ENUMERATOR Enumerator
    );

typedef PRTL_DYNAMIC_HASH_TABLE_ENTRY (NTAPI *PRTL_ENUMERATE_ENTRY_HASH_TABLE)(
    _In_ PRTL_DYNAMIC_HASH_TABLE HashTable,
    _Inout_ PRTL_DYNAMIC_HASH_TABLE_ENUMERATOR Enumerator
    );

typedef VOID (NTAPI *PRTL_END_ENUMERATION_HASH_TABLE)(
    _In_ PRTL_DYNAMIC_HASH_TABLE HashTable,
    _Inout_ PRTL_DYNAMIC_HASH_TABLE_ENUMERATOR Enumerator
    );

typedef BOOLEAN (NTAPI *PRTL_INIT_WEAK_ENUMERATION_HASH_TABLE)(
    _In_ PRTL_DYNAMIC_HASH_TABLE HashTable,
    _Out_ PRTL_DYNAMIC_HASH_TABLE_ENUMERATOR Enumerator
    );

typedef
PRTL_DYNAMIC_HASH_TABLE_ENTRY
(NTAPI *PRTL_WEAKLY_ENUMERATE_ENTRY_HASH_TABLE)(
    _In_ PRTL_DYNAMIC_HASH_TABLE HashTable,
    _Inout_ PRTL_DYNAMIC_HASH_TABLE_ENUMERATOR Enumerator
    );

typedef VOID (NTAPI *PRTL_END_WEAK_ENUMERATION_HASH_TABLE)(
    _In_ PRTL_DYNAMIC_HASH_TABLE HashTable,
    _Inout_ PRTL_DYNAMIC_HASH_TABLE_ENUMERATOR Enumerator
    );

typedef BOOLEAN (NTAPI *PRTL_INIT_STRONG_ENUMERATION_HASH_TABLE)(
    _In_ PRTL_DYNAMIC_HASH_TABLE HashTable,
    _Out_ PRTL_DYNAMIC_HASH_TABLE_ENUMERATOR Enumerator
    );

typedef
PRTL_DYNAMIC_HASH_TABLE_ENTRY
(NTAPI *PRTL_STRONGLY_ENUMERATE_ENTRY_HASH_TABLE)(
    _In_ PRTL_DYNAMIC_HASH_TABLE HashTable,
    _Inout_ PRTL_DYNAMIC_HASH_TABLE_ENUMERATOR Enumerator
    );

typedef VOID (NTAPI *PRTL_END_STRONG_ENUMERATION_HASH_TABLE)(
    _In_ PRTL_DYNAMIC_HASH_TABLE HashTable,
    _Inout_ PRTL_DYNAMIC_HASH_TABLE_ENUMERATOR Enumerator
    );

typedef BOOLEAN (NTAPI *PRTL_EXPAND_HASH_TABLE)(
    _In_ PRTL_DYNAMIC_HASH_TABLE HashTable
    );

typedef BOOLEAN (NTAPI *PRTL_CONTRACT_HASH_TABLE)(
    _In_ PRTL_DYNAMIC_HASH_TABLE HashTable
    );

//
// Prefix Tables
//
typedef struct _PREFIX_TABLE_ENTRY {
    CSHORT NodeTypeCode;
    CSHORT NameLength;
    struct _PREFIX_TABLE_ENTRY *NextPrefixTree;
    RTL_SPLAY_LINKS Links;
    PSTRING Prefix;
} PREFIX_TABLE_ENTRY, *PPREFIX_TABLE_ENTRY, **PPPREFIX_TABLE_ENTRY;

typedef struct _PREFIX_TABLE {
    CSHORT NodeTypeCode;
    CSHORT NameLength;
    ULONG Unused;
    PPREFIX_TABLE_ENTRY NextPrefixTree;
} PREFIX_TABLE, *PPREFIX_TABLE, **PPPREFIX_TABLE;
C_ASSERT(sizeof(PREFIX_TABLE) == 16);

typedef VOID (NTAPI *PPFX_INITIALIZE)(
    _Out_ PPREFIX_TABLE PrefixTable
    );

typedef BOOLEAN (NTAPI *PPFX_INSERT_PREFIX)(
    _In_ PPREFIX_TABLE PrefixTable,
    _In_ PSTRING Prefix,
    _Out_ PPREFIX_TABLE_ENTRY PrefixTableEntry
    );

typedef VOID (NTAPI *PPFX_REMOVE_PREFIX)(
    _In_ PPREFIX_TABLE PrefixTable,
    _In_ PPREFIX_TABLE_ENTRY PrefixTableEntry
    );

typedef PPREFIX_TABLE_ENTRY (NTAPI *PPFX_FIND_PREFIX)(
    _In_ PPREFIX_TABLE PrefixTable,
    _In_ PSTRING FullName
    );

//
// Unicode Prefix Table
//

typedef struct _UNICODE_PREFIX_TABLE_ENTRY {
    CSHORT NodeTypeCode;
    CSHORT NameLength;
    ULONG Unused1;
    struct _UNICODE_PREFIX_TABLE_ENTRY *NextPrefixTree;
    struct _UNICODE_PREFIX_TABLE_ENTRY *CaseMatch;
    RTL_SPLAY_LINKS Links;
    PUNICODE_STRING Prefix;
} UNICODE_PREFIX_TABLE_ENTRY;
C_ASSERT(FIELD_OFFSET(UNICODE_PREFIX_TABLE_ENTRY, NextPrefixTree) == 8);
C_ASSERT(FIELD_OFFSET(UNICODE_PREFIX_TABLE_ENTRY, Links) == 24);
C_ASSERT(FIELD_OFFSET(UNICODE_PREFIX_TABLE_ENTRY, Prefix) == 48);
C_ASSERT(sizeof(UNICODE_PREFIX_TABLE_ENTRY) == 56);
typedef UNICODE_PREFIX_TABLE_ENTRY *PUNICODE_PREFIX_TABLE_ENTRY;

typedef struct _UNICODE_PREFIX_TABLE {
    CSHORT NodeTypeCode;
    CSHORT NameLength;
    ULONG Unused;
    PUNICODE_PREFIX_TABLE_ENTRY NextPrefixTree;
    PUNICODE_PREFIX_TABLE_ENTRY LastNextEntry;
} UNICODE_PREFIX_TABLE;
typedef UNICODE_PREFIX_TABLE *PUNICODE_PREFIX_TABLE;
C_ASSERT(sizeof(UNICODE_PREFIX_TABLE) == 2+2+4+8+8);
C_ASSERT(sizeof(UNICODE_PREFIX_TABLE) == 24);

typedef VOID (NTAPI *PRTL_INITIALIZE_UNICODE_PREFIX)(
    _In_ PUNICODE_PREFIX_TABLE PrefixTable
    );

typedef BOOLEAN (NTAPI *PRTL_INSERT_UNICODE_PREFIX)(
    _In_ PUNICODE_PREFIX_TABLE PrefixTable,
    _In_ PUNICODE_STRING Prefix,
    _In_ PUNICODE_PREFIX_TABLE_ENTRY PrefixTableEntry
    );

typedef VOID (NTAPI *PRTL_REMOVE_UNICODE_PREFIX)(
    _In_ PUNICODE_PREFIX_TABLE PrefixTable,
    _In_ PUNICODE_PREFIX_TABLE_ENTRY PrefixTableEntry
    );

typedef PUNICODE_PREFIX_TABLE_ENTRY (NTAPI *PRTL_FIND_UNICODE_PREFIX)(
    _In_ PUNICODE_PREFIX_TABLE PrefixTable,
    _In_ PCUNICODE_STRING FullName,
    _In_ ULONG CaseInsensitiveIndex
    );

typedef PUNICODE_PREFIX_TABLE_ENTRY (NTAPI *PRTL_NEXT_UNICODE_PREFIX)(
    _In_ PUNICODE_PREFIX_TABLE PrefixTable,
    _In_ BOOLEAN Restart
    );

//
// Bitmaps
//

typedef VOID (NTAPI *PRTL_INITIALIZE_BITMAP)(
    _Out_ PRTL_BITMAP BitMapHeader,
    _In_opt_ PULONG BitMapBuffer,
    _In_opt_ ULONG SizeOfBitMap
    );

typedef VOID (NTAPI *PRTL_CLEAR_BIT)(
    _In_ PRTL_BITMAP BitMapHeader,
    _In_range_(<, BitMapHeader->SizeOfBitMap) ULONG BitNumber
    );

typedef VOID (NTAPI *PRTL_SET_BIT)(
    _In_ PRTL_BITMAP BitMapHeader,
    _In_range_(<, BitMapHeader->SizeOfBitMap) ULONG BitNumber
    );

typedef BOOLEAN (NTAPI *PRTL_TEST_BIT)(
    _In_ PRTL_BITMAP BitMapHeader,
    _In_range_(<, BitMapHeader->SizeOfBitMap) ULONG BitNumber
    );

typedef VOID (NTAPI *PRTL_CLEAR_ALL_BITS)(
    _In_ PRTL_BITMAP BitMapHeader
    );

typedef VOID (NTAPI *PRTL_SET_ALL_BITS)(
    _In_ PRTL_BITMAP BitMapHeader
    );

typedef ULONG (NTAPI *PRTL_FIND_CLEAR_BITS)(
    _In_ PRTL_BITMAP BitMapHeader,
    _In_ ULONG NumberToFind,
    _In_ ULONG HintIndex
    );

typedef ULONG (NTAPI *PRTL_FIND_SET_BITS)(
    _In_ PRTL_BITMAP BitMapHeader,
    _In_ ULONG NumberToFind,
    _In_ ULONG HintIndex
    );

typedef ULONG (NTAPI *PRTL_FIND_CLEAR_BITS_AND_SET)(
    _In_ PRTL_BITMAP BitMapHeader,
    _In_ ULONG NumberToFind,
    _In_ ULONG HintIndex
    );

typedef ULONG (NTAPI *PRTL_FIND_SET_BITS_AND_CLEAR)(
    _In_ PRTL_BITMAP BitMapHeader,
    _In_ ULONG NumberToFind,
    _In_ ULONG HintIndex
    );

typedef VOID (NTAPI *PRTL_CLEAR_BITS)(
    _In_ PRTL_BITMAP BitMapHeader,
    _In_ ULONG StartingIndex,
    _In_ ULONG NumberToClear
    );

typedef VOID (NTAPI *PRTL_SET_BITS)(
    _In_ PRTL_BITMAP BitMapHeader,
    _In_ ULONG StartingIndex,
    _In_ ULONG NumberToSet
    );

typedef ULONG (NTAPI *PRTL_FIND_CLEAR_BITS)(
    _In_ PRTL_BITMAP BitMapHeader,
    _In_ ULONG NumberToFind,
    _In_ ULONG HintIndex
    );

typedef ULONG (NTAPI *PRTL_FIND_SET_BITS)(
    _In_ PRTL_BITMAP BitMapHeader,
    _In_ ULONG NumberToFind,
    _In_ ULONG HintIndex
    );

typedef ULONG (NTAPI *PRTL_FIND_CLEAR_BITS_AND_SET)(
    _In_ PRTL_BITMAP BitMapHeader,
    _In_ ULONG NumberToFind,
    _In_ ULONG HintIndex
    );

typedef ULONG (NTAPI *PRTL_FIND_SET_BITS_AND_CLEAR)(
    _In_ PRTL_BITMAP BitMapHeader,
    _In_ ULONG NumberToFind,
    _In_ ULONG HintIndex
    );

typedef VOID (NTAPI *PRTL_CLEAR_BITS)(
    _In_ PRTL_BITMAP BitMapHeader,
    _In_ ULONG StartingIndex,
    _In_ ULONG NumberToClear
    );

typedef VOID (NTAPI *PRTL_SET_BITS)(
    _In_ PRTL_BITMAP BitMapHeader,
    _In_ ULONG StartingIndex,
    _In_ ULONG NumberToSet
    );

typedef ULONG (NTAPI *PRTL_FIND_CLEAR_RUNS)(
    _In_ PRTL_BITMAP BitMapHeader,
    _Out_ PRTL_BITMAP_RUN RunArray,
    _In_ ULONG SizeOfRunArray,
    _In_ BOOLEAN LocateLongestRuns
    );

typedef ULONG (NTAPI *PRTL_FIND_LONGEST_RUN_CLEAR)(
    _In_ PRTL_BITMAP BitMapHeader,
    _Out_ PULONG StartingIndex
    );

typedef ULONG (NTAPI *PRTL_FIND_FIRST_RUN_CLEAR)(
    _In_ PRTL_BITMAP BitMapHeader,
    _Out_ PULONG StartingIndex
    );

typedef ULONG (NTAPI *PRTL_NUMBER_OF_CLEAR_BITS)(
    _In_ PRTL_BITMAP BitMapHeader
    );

typedef ULONG (NTAPI *PRTL_NUMBER_OF_SET_BITS)(
    _In_ PRTL_BITMAP BitMapHeader
    );

typedef BOOLEAN (NTAPI *PRTL_ARE_BITS_CLEAR)(
    _In_ PRTL_BITMAP BitMapHeader,
    _In_ ULONG StartingIndex,
    _In_ ULONG Length
    );

typedef BOOLEAN (NTAPI *PRTL_ARE_BITS_SET)(
    _In_ PRTL_BITMAP BitMapHeader,
    _In_ ULONG StartingIndex,
    _In_ ULONG Length
    );

typedef ULONG (NTAPI *PRTL_FIND_NEXT_FORWARD_RUN_CLEAR)(
    _In_ PRTL_BITMAP BitMapHeader,
    _In_ ULONG FromIndex,
    _Out_ PULONG StartingRunIndex
    );

typedef ULONG (NTAPI *PRTL_FIND_LAST_BACKWARD_RUN_CLEAR)(
    _In_ PRTL_BITMAP BitMapHeader,
    _In_ ULONG FromIndex,
    _Out_ PULONG StartingRunIndex
    );

//
// Quad-word Bitmaps.  (Work in progress.)
//

typedef struct _RTL_BITMAP_EX {
    ULONGLONG SizeOfBitMap; // Number of bits.
    PULONGLONG Buffer;
} RTL_BITMAP_EX, *PRTL_BITMAP_EX, **PPRTL_BITMAP_EX;

typedef VOID (NTAPI *PRTL_INITIALIZE_BITMAP_EX)(
    _Out_ PRTL_BITMAP_EX BitMapHeader,
    _In_opt_ __drv_aliasesMem PULONGLONG BitMapBuffer,
    _In_opt_ ULONGLONG SizeOfBitMap
    );

typedef VOID (NTAPI *PRTL_CLEAR_BIT_EX)(
    _In_ PRTL_BITMAP_EX BitMapHeader,
    _In_range_(<, BitMapHeader->SizeOfBitMap) ULONGLONG BitNumber
    );

//
// Sparse bitmaps.  (Work in progress.)
//

typedef union _RTL_SPARSE_BITMAP_CTX_FLAGS {
    LONG AsLong;
    ULONG AsULong;
    struct _Struct_size_bytes_(sizeof(ULONG)) {
        ULONG DefaultBitsSet:1;
        ULONG SparseRangeArray:1;
        ULONG NoInternalLocking:1;
        ULONG SpareFlags:29;
    };
} RTL_SPARSE_BITMAP_CTX_FLAGS, *PRTL_SPARSE_BITMAP_CTX_FLAGS;
C_ASSERT(sizeof(RTL_SPARSE_BITMAP_CTX_FLAGS) == sizeof(ULONG));

typedef SRWLOCK RTL_SPARSE_BITMAP_LOCK;

typedef
_Check_return_
_Success_(return != 0)
PVOID
(NTAPI RTL_SPARSE_BITMAP_ALLOCATION_ROUTINE)(
    _In_ struct _RTL_SPARSE_BITMAP_CTX *Context,
    _In_ CLONG ByteSize
    );
typedef RTL_SPARSE_BITMAP_ALLOCATION_ROUTINE
      *PRTL_SPARSE_BITMAP_ALLOCATION_ROUTINE;

typedef
VOID
(NTAPI RTL_SPARSE_BITMAP_FREE_ROUTINE)(
    _In_ struct _RTL_SPARSE_BITMAP_CTX *Context,
    _In_ _Post_invalid_ PVOID Buffer
    );
typedef RTL_SPARSE_BITMAP_FREE_ROUTINE *PRTL_SPARSE_BITMAP_FREE_ROUTINE;

typedef struct _RTL_SPARSE_BITMAP_RANGE {
    RTL_SPARSE_BITMAP_LOCK Lock;
    struct _SINGLE_LIST_ENTRY Next;
    RTL_BITMAP RangeBitmap;
} RTL_SPARSE_BITMAP_RANGE, *PRTL_SPARSE_BITMAP_RANGE;
typedef RTL_SPARSE_BITMAP_RANGE **PPRTL_SPARSE_BITMAP_RANGE;

typedef struct _RTL_SPARSE_BITMAP_CTX {
    RTL_SPARSE_BITMAP_LOCK Lock;
    PPRTL_SPARSE_BITMAP_RANGE BitmapRanges;
    RTL_BITMAP RangeArrayCommitStatus;
    PRTL_SPARSE_BITMAP_ALLOCATION_ROUTINE AllocationRoutine;
    PRTL_SPARSE_BITMAP_FREE_ROUTINE FreeRoutine;

    ULONG RangeCount;
    ULONG RangeIndexLimit;
    ULONG RangeCountMax;
    ULONG RangeMetadataOffset;
    ULONG MetadataSizePerBit;

    ULONG Padding1;

    union {
        RTL_SPARSE_BITMAP_CTX_FLAGS Flags;
        struct _Struct_size_bytes_(sizeof(ULONG)) {
            ULONG DefaultBitsSet:1;
            ULONG SparseRangeArray:1;
            ULONG NoInternalLocking:1;
            ULONG SpareFlags:29;
        };
    };

    ULONG Padding2;

} RTL_SPARSE_BITMAP_CTX, *PRTL_SPARSE_BITMAP_CTX;
C_ASSERT(FIELD_OFFSET(RTL_SPARSE_BITMAP_CTX, BitmapRanges) == 8);
C_ASSERT(FIELD_OFFSET(RTL_SPARSE_BITMAP_CTX, AllocationRoutine) == 0x20);
C_ASSERT(FIELD_OFFSET(RTL_SPARSE_BITMAP_CTX, FreeRoutine) == 0x28);
C_ASSERT(FIELD_OFFSET(RTL_SPARSE_BITMAP_CTX, RangeCount) == 0x30);
C_ASSERT(FIELD_OFFSET(RTL_SPARSE_BITMAP_CTX, Flags) == 0x48);
C_ASSERT(sizeof(RTL_SPARSE_BITMAP_CTX) == 80);

//
// CRC32 and CRC64
//
typedef ULONG (NTAPI *PRTLCRC32)(
    _In_ const void *Buffer,
    _In_ size_t Size,
    _In_ ULONG InitialCrc
    );

typedef ULONGLONG (NTAPI *PRTLCRC64)(
    _In_ const void *Buffer,
    _In_ size_t Size,
    _In_ ULONGLONG InitialCrc
    );

//
// Tool Help
//

typedef struct tagTHREADENTRY32 *LPTHREADENTRY32;

typedef HANDLE (WINAPI * PCREATE_TOOLHELP32_SNAPSHOT)(
    DWORD dwFlags,
    DWORD th32ProcessID
    );

typedef BOOL (WINAPI *PTHREAD32_FIRST)(
    HANDLE hSnapshot,
    LPTHREADENTRY32 lpte
    );

typedef BOOL (WINAPI *PTHREAD32_NEXT)(
    HANDLE hSnapshot,
    LPTHREADENTRY32 lpte
    );

//
// Misc
//

typedef
_Check_return_
_Success_(return != 0)
BOOL
(CALLBACK INIT_ONCE_CALLBACK)(
    _Inout_     PINIT_ONCE InitOnce,
    _Inout_opt_ PVOID      Parameter,
    _Out_opt_   PVOID      *Context
    );
typedef INIT_ONCE_CALLBACK *PINIT_ONCE_CALLBACK;

typedef VOID (NTAPI *PRTL_PREFETCH_MEMORY_NON_TEMPORAL)(
    _In_ PVOID Source,
    _In_ SIZE_T Length
    );

typedef VOID (*PRTL_MOVE_MEMORY)(
    _Out_       VOID UNALIGNED *Destination,
    _In_  const VOID UNALIGNED *Source,
    _In_        SIZE_T          Length
    );

typedef PVOID (__cdecl *PRTL_COPY_MEMORY)(
    _Out_ PVOID   Destination,
    _In_  LPCVOID Source,
    _In_  SIZE_T  Size
    );

typedef NTSTATUS (NTAPI *PRTL_COPY_MAPPED_MEMORY)(
    _Out_ PVOID   Destination,
    _In_  LPCVOID Source,
    _In_  SIZE_T  Size
    );

typedef PVOID (__cdecl *PRTL_FILL_MEMORY)(
    _Out_ PVOID  Destination,
    _In_  INT    Value,
    _In_  SIZE_T Size
    );

typedef BOOLEAN (WINAPI *PRTL_LOCAL_TIME_TO_SYSTEM_TIME)(
    _In_    PLARGE_INTEGER  LocalTime,
    _In_    PLARGE_INTEGER  SystemTime
    );

typedef BOOLEAN (WINAPI *PRTL_TIME_TO_SECONDS_SINCE_1970)(
    _In_    PLARGE_INTEGER  Time,
    _Out_   PULONG          ElapsedSeconds
    );

typedef
PVOID
(MM_GET_MAXIMUM_FILE_SECTION_SIZE)(VOID);
typedef MM_GET_MAXIMUM_FILE_SECTION_SIZE *PMM_GET_MAXIMUM_FILE_SECTION_SIZE;

#ifdef _M_X64

#ifndef BitTestAndSet
#define BitTestAndSet _bittestandset
#endif

#define FastSetBit(Bitmap, BitNumber) (             \
    BitTestAndSet((PLONG)Bitmap->Buffer, BitNumber) \
)

#else

#define FastSetBit(Bitmap, BitNumber) ( \
    Rtl->RtlSetBit(Bitmap, BitNumber)   \
)

#endif

#undef RtlFillMemory
#undef RtlMoveMemory
#undef RtlCopyMemory

//
// Our RTL_PATH structure.
//

typedef enum _RTL_PATH_LINK_TYPE {

    //
    // No linkage is being used.
    //

    PathLinkTypeNone = 0,

    //
    // Linkage type is LIST_ENTRY.
    //

    PathLinkTypeListEntry,

    //
    // Linkage type is SLIST_ENTRY.
    //

    PathLinkTypeSListEntry,

    //
    // Linkage type is UNICODE_PREFIX_TABLE_ENTRY.
    //

    PathLinkTypePrefixTableEntry,

    //
    // Linkage type is RTL_DYNAMIC_HASH_TABLE_ENTRY.
    //

    PathLinkHashTableEntry

} RTL_PATH_LINK_TYPE, *PRTL_PATH_LINK_TYPE;

typedef struct _RTL_PATH_LINK {

    RTL_PATH_LINK_TYPE Type;                                    // 0    4   4

    //
    // Pad to an 16 byte boundary in order to ensure SLIST_ENTRY is aligned
    // properly.
    //

    ULONG Padding1[3];                                          // 4    12  16

    union {
        LIST_ENTRY ListEntry;                                   // 16   16  32
        DECLSPEC_ALIGN(16) SLIST_ENTRY SListEntry;              // 16   8   24
        struct _UNICODE_PREFIX_TABLE_ENTRY PrefixTableEntry;    // 16   56  72
        struct _RTL_DYNAMIC_HASH_TABLE_ENTRY HashTableEntry;    // 16   24  40
    };

} RTL_PATH_LINK, *PRTL_PATH_LINK;
C_ASSERT(FIELD_OFFSET(RTL_PATH_LINK, SListEntry) == 16);
C_ASSERT(sizeof(RTL_PATH_LINK) == 80);

typedef union _RTL_PATH_FLAGS {
    LONG AsLong;
    ULONG AsULong;
    struct _Struct_size_bytes_(sizeof(ULONG)) {
        ULONG IsFile:1;
        ULONG IsDirectory:1;
        ULONG IsSymlink:1;
        ULONG IsFullyQualified:1;
        ULONG HasParent:1;
        ULONG HasChildren:1;

        //
        // When set, indicates that the path resides within the Windows
        // directory (e.g. "C:\Windows").  This includes the Windows directory
        // itself.
        //
        // N.B. The Windows directory is obtained via GetWindowsDirectory();
        //      if Windows was installed into the root directory of a drive,
        //      e.g. C:\, this bit will be set for every fully-qualified path.
        //
        // Invariants:
        //
        //      If WithinWindowsDirectory == TRUE:
        //          Assert IsFullyQualified == TRUE
        //

        ULONG WithinWindowsDirectory:1;

        //
        // When set, indicates that the path resides within the Windows
        // side-by-side assembly directory (e.g. "C:\Windows\WinSxS").  This
        // includes the WinSxS directory itself.
        //
        // N.B. This path is obtained by calling GetWindowsDirectory() and
        //      appending "WinSxS" to the returned path.
        //
        // Invariants:
        //
        //      If WithinWindowsSxSDirectory == TRUE:
        //          Assert IsFullyQualified == TRUE
        //

        ULONG WithinWindowsSxSDirectory:1;

        //
        // When set, indicates that the path resides within the Windows
        // system directory (e.g. "C:\Windows\system32").  This includes the
        // Windows sytem directory itself.
        //
        // Invariants:
        //
        //      If WithinWindowsSystemDirectory == TRUE:
        //          Assert IsFullyQualified == TRUE
        //

        ULONG WithinWindowsSystemDirectory:1;
    };
} RTL_PATH_FLAGS;
C_ASSERT(sizeof(RTL_PATH_FLAGS) == sizeof(ULONG));
typedef RTL_PATH_FLAGS *PRTL_PATH_FLAGS;

typedef _Struct_size_bytes_(sizeof(ULONG)) struct _RTL_PATH_CREATE_FLAGS {
    ULONG CheckType:1;
    ULONG EnsureQualified:1;
} RTL_PATH_CREATE_FLAGS, *PRTL_PATH_CREATE_FLAGS;

typedef enum _RTL_PATH_TYPE_INTENT {

    PathTypeDontCare = 0,
    PathTypeLookup,
    PathTypeKnownFile,
    PathTypeKnownSymlink,
    PathTypeKnownDirectory

} RTL_PATH_TYPE_INTENT;

typedef _Struct_size_bytes_(StructSize) struct _RTL_PATH {

    //
    // Size of the structure, in bytes.
    //

    _Field_range_(==, sizeof(struct _RTL_PATH)) USHORT StructSize; // 0    2   2

    //
    // Drive letter.
    //

    WCHAR Drive;                                                // 2    2   4

    //
    // Number of slashes and dots.  Saves having to do RtlNumberOfSetBits().
    //

    USHORT NumberOfSlashes;                                     // 4    2   6
    USHORT NumberOfDots;                                        // 6    2   8

    //
    // We get a free ULONG slot in each RTL_BITMAP structure due to the buffer
    // pointer needing to be 8 bytes aligned.  Leverage these to store AllocSize
    // and Flags.
    //

    union {
        struct {
            ULONG SizeOfReversedSlashesBitMap;                  // 8    4   12

            //
            // Total number of bytes allocated for the structure, including
            // StructSize.  This includes the bitmap buffers and Unicode string
            // buffer (all of which will typically trail this structure in
            // memory).
            //

            ULONG AllocSize;                                    // 12   4   16
            PULONG ReversedSlashesBitMapBuffer;                 // 16   8   24
        };
        RTL_BITMAP ReversedSlashesBitmap;                       // 8    16  24
    };

    union {
        struct {
            ULONG SizeOfReversedDotsBitMap;                     // 24   4   28
            RTL_PATH_FLAGS Flags;                               // 28   4   32
            PULONG ReversedDotsBitMapBuffer;                    // 32   8   40
        };
        RTL_BITMAP ReversedDotsBitmap;                          // 24   16  40
    };

    //
    // Optional allocator used to allocate this structure.
    //

    PALLOCATOR Allocator;                                       // 40   8   48

    //
    // Unicode strings for path details.
    //

    UNICODE_STRING Full;                                        // 48   16  64
    UNICODE_STRING Name;                                        // 64   16  80
    UNICODE_STRING Directory;                                   // 80   16  96
    UNICODE_STRING Extension;                                   // 96   16  112

    //
    // Path linkage.
    //

    RTL_PATH_LINK Link;                                         // 112  80  192

} RTL_PATH, *PRTL_PATH, **PPRTL_PATH;
C_ASSERT(FIELD_OFFSET(RTL_PATH, ReversedSlashesBitmap) == 8);
C_ASSERT(FIELD_OFFSET(RTL_PATH, ReversedDotsBitmap) == 24);
C_ASSERT(FIELD_OFFSET(RTL_PATH, Allocator) == 40);
C_ASSERT(FIELD_OFFSET(RTL_PATH, Full) == 48);
C_ASSERT(FIELD_OFFSET(RTL_PATH, Name) == 64);
C_ASSERT(FIELD_OFFSET(RTL_PATH, Link) == 112);
C_ASSERT(sizeof(RTL_PATH) == 192);

typedef
_Success_(return != 0)
BOOL
(UNICODE_STRING_TO_RTL_PATH)(
    _In_ PRTL Rtl,
    _In_ PUNICODE_STRING String,
    _In_ PALLOCATOR Allocator,
    _Out_ PPRTL_PATH PathPointer
    );
typedef UNICODE_STRING_TO_RTL_PATH *PUNICODE_STRING_TO_RTL_PATH;

typedef
_Success_(return != 0)
BOOL
(STRING_TO_RTL_PATH)(
    _In_ PRTL Rtl,
    _In_ PSTRING String,
    _In_ PALLOCATOR Allocator,
    _Out_ PPRTL_PATH PathPointer
    );
typedef STRING_TO_RTL_PATH *PSTRING_TO_RTL_PATH;

typedef
_Success_(return != 0)
BOOL
(STRING_TO_EXISTING_RTL_PATH)(
    _In_ PRTL Rtl,
    _In_ PSTRING AnsiString,
    _In_ PALLOCATOR BitmapAllocator,
    _In_ PALLOCATOR UnicodeStringBufferAllocator,
    _In_ PRTL_PATH Path,
    _In_ PLARGE_INTEGER TimestampPointer
    );
typedef STRING_TO_EXISTING_RTL_PATH *PSTRING_TO_EXISTING_RTL_PATH;

typedef
_Success_(return != 0)
BOOL
(UNICODE_STRING_TO_EXISTING_RTL_PATH)(
    _In_ PRTL Rtl,
    _In_ PUNICODE_STRING UnicodeString,
    _In_ PALLOCATOR BitmapAllocator,
    _In_ PALLOCATOR UnicodeStringBufferAllocator,
    _In_ PRTL_PATH Path,
    _In_ PLARGE_INTEGER TimestampPointer
    );
typedef UNICODE_STRING_TO_EXISTING_RTL_PATH \
      *PUNICODE_STRING_TO_EXISTING_RTL_PATH;

typedef
_Success_(return != 0)
BOOL
(DESTROY_RTL_PATH)(
    _Inout_opt_ PPRTL_PATH PathPointer
    );
typedef DESTROY_RTL_PATH *PDESTROY_RTL_PATH;

typedef
_Success_(return != 0)
BOOL
(GET_MODULE_RTL_PATH)(
    _In_ PRTL Rtl,
    _In_ HMODULE Module,
    _In_ PALLOCATOR Allocator,
    _Out_ PPRTL_PATH PathPointer
    );
typedef GET_MODULE_RTL_PATH *PGET_MODULE_RTL_PATH;

//
// Our RTL_FILE structure.
//

//
// Flags for the RTL_FILE structure.
//

typedef struct _Struct_size_bytes_(sizeof(ULONG)) _RTL_FILE_FLAGS {

    ULONG Valid:1;

    //
    // Which copy method was used to copy the source file contents into the
    // destination.
    //

    ULONG Avx2Copy:1;
    ULONG MovsqCopy:1;

} RTL_FILE_FLAGS, *PRTL_FILE_FLAGS;

typedef enum _RTL_FILE_TYPE {
    RtlFileNullType = 0,
    RtlFileTextFileType = 1,
    RtlFileImageFileType,
    RtlFileInvalidType
} RTL_FILE_TYPE, *PRTL_FILE_TYPE;

//
// A structure for capturing details about a text file.  This is used for source
// code files.
//

typedef struct _Struct_size_bytes_(StructSizeInBytes) _RTL_TEXT_FILE {

    //
    // Size of the structure, in bytes.
    //

    _Field_range_(==, sizeof(struct _RTL_TEXT_FILE)) ULONG StructSizeInBytes;

    //
    // Number of lines in the file.
    //

    ULONG NumberOfLines;

    //
    // An array of STRING structures, one for each line in the file.
    // Number of elements in the array is governed by NumberOfLines.
    //

    PSTRING Lines;

    //
    // Line ending bitmaps.
    //

    PRTL_BITMAP CarriageReturnBitmap;
    PRTL_BITMAP LineFeedBitmap;

    //
    // The two bitmaps above are combined (literally AND'd together) to
    // create the following line ending bitmap, where each set bit
    // indicates a line ending character.
    //

    PRTL_BITMAP LineEndingBitmap;

    //
    // This bitmap is then inverted, such that each set bit indicates a
    // normal non-line-ending character.
    //

    PRTL_BITMAP LineBitmap;

    //
    // Bitmaps for capturing whitespace/tabs.
    //

    PRTL_BITMAP WhitespaceBitmap;
    PRTL_BITMAP TabBitmap;

    //
    // Set bits correlate to whitespace/tabs that indicate indentation;
    // i.e.  longest run of space/tab after the last line-ending bit.
    //

    PRTL_BITMAP IndentBitmap;

    //
    // Set bits correlate to trailing whitespace.
    //

    PRTL_BITMAP TrailingWhitespaceBitmap;

    //
    // (80 bytes consumed.)
    //

} RTL_TEXT_FILE, *PRTL_TEXT_FILE;
C_ASSERT(sizeof(RTL_TEXT_FILE) == 80);

#define NUMBER_OF_RTL_TEXT_FILE_BITMAPS 8

//
// This structure is used to capture information about image files (e.g. dll,
// exe).

typedef struct _RTL_IMAGE_FILE {

    //
    // Preferred base address, if set.
    //

    PVOID PreferredBaseAddress;

    //
    // Actual base address the module was loaded at.
    //

    PVOID BaseAddress;

    //
    // Pointer to the entry point of the image if applicable.  This will be
    // relative to the loaded BaseAddress.
    //

    PVOID EntryPoint;

    //
    // (24 bytes consumed.)
    //

    //
    // Size of the image, in bytes.
    //

    ULONG SizeOfImage;

    //
    // HeaderSum and CheckSum are filled in after CheckSumMappedFile() is
    // called.
    //

    ULONG HeaderSum;
    ULONG CheckSum;

    //
    // Timestamp receives the return value from GetTimestampForLoadedLibrary().
    //

    ULONG Timestamp;

    //
    // (40 bytes consumed.)
    //

    //
    // If a PDB file could be located, this will point to it.
    //

    PRTL_PATH PdbPath;

    //
    // Captures the module handle.
    //

    HMODULE ModuleHandle;

    //
    // (56 bytes consumed.)
    //

    //
    // Pointer to an IMAGEHLP_MODULE64 structure if symbol tracing is enabled
    // and symbols were successfully loaded.
    //

    PIMAGEHLP_MODULEW64 ModuleInfo;

} RTL_IMAGE_FILE, *PRTL_IMAGE_FILE;
C_ASSERT(FIELD_OFFSET(RTL_IMAGE_FILE, SizeOfImage) == 24);
C_ASSERT(FIELD_OFFSET(RTL_IMAGE_FILE, ModuleInfo) == 56);
C_ASSERT(sizeof(RTL_IMAGE_FILE) == 64);

//
// This structure is used to capture information about a file that participates
// in a trace session some how (e.g. text source code, binary image, etc).
//

typedef DECLSPEC_ALIGN(16) struct _RTL_FILE {

    //
    // Singly-linked list entry allowing the record to be pushed and popped
    // onto interlocked lists.
    //

    union {
        SLIST_ENTRY ListEntry;
        struct {
            PSLIST_ENTRY Next;
            PVOID Unused;
        };
    };

    //
    // File information.
    //

    //
    // Inline FILE_BASIC_INFO.
    //

    union {
        FILE_BASIC_INFO BasicInfo;
        struct {
            LARGE_INTEGER CreationTime;
            LARGE_INTEGER LastAccessTime;
            LARGE_INTEGER LastWriteTime;
            LARGE_INTEGER ChangeTime;
            DWORD FileAttributes;

            //
            // Stash the number of pages here as we get a free DWORD/ULONG in
            // order to maintain alignment.  Note that this isn't part of the
            // FILE_BASIC_INFO structure.
            //

            ULONG NumberOfPages;
        };
    };

    LARGE_INTEGER EndOfFile;
    LARGE_INTEGER AllocationSize;

    //
    // (72 bytes consumed.)
    //

    //
    // File ID related information.
    //

    LARGE_INTEGER FileId;

    //
    // Inline FILE_ID_INFO.
    //

    union {
        FILE_ID_INFO FileIdInfo;
        struct {
            ULONGLONG VolumeSerialNumber;
            FILE_ID_128 FileId128;
        };
    };

    //
    // (104 bytes consumed.)
    //

    //
    // Checksums.
    //

    BYTE MD5[16];
    BYTE SHA1[20];

    //
    // (116 bytes consumed.)
    //

    //
    // Define type and flags.
    //

    RTL_FILE_TYPE Type;
    RTL_FILE_FLAGS Flags;

    //
    // Pad to 8 byte boundary with an elapsed field that captures ticks required
    // to copy the file from the memory mapping to our allocated memory.
    //

    ULONG Elapsed;

    //
    // A pointer to the first byte of data for the file, once it has been
    // loaded.
    //

    PCHAR Content;

    //
    // Capture all path related information via Rtl's RTL_PATH structure.
    //

    RTL_PATH Path;

    //
    // (360 bytes consumed.)
    //

    //
    // Additional information about the loading speed.
    //

    LARGE_INTEGER CopyTimeInMicroseconds;
    LARGE_INTEGER CopiedBytesPerSecond;

    //
    // (376 bytes consumed.)
    //

    union {

        //
        // Source code specific structure.
        //

        RTL_TEXT_FILE SourceCode;

        //
        // Image file specific structure.
        //

        RTL_IMAGE_FILE ImageFile;

        //
        // Pad out to 480 bytes such that we've got 32 bytes at the end of the
        // structure spare.
        //

        BYTE Reserved[112];
    };

    //
    // (480 bytes consumed.)
    //

    //
    // These will have values as long as the handles are open.
    //

    HANDLE FileHandle;
    HANDLE MappingHandle;
    PVOID MappedAddress;

    //
    // Pad out to a final 512 bytes.
    //

    BYTE Reserved2[8];

} RTL_FILE, *PRTL_FILE, **PPRTL_FILE;
C_ASSERT(FIELD_OFFSET(RTL_FILE, CreationTime) == 16);
C_ASSERT(FIELD_OFFSET(RTL_FILE, EndOfFile) == 56);
C_ASSERT(FIELD_OFFSET(RTL_FILE, FileId) == 72);
C_ASSERT(FIELD_OFFSET(RTL_FILE, FileIdInfo) == 80);
C_ASSERT(FIELD_OFFSET(RTL_FILE, MD5) == 104);
C_ASSERT(FIELD_OFFSET(RTL_FILE, SHA1) == 120);
C_ASSERT(FIELD_OFFSET(RTL_FILE, Type) == 140);
C_ASSERT(FIELD_OFFSET(RTL_FILE, Flags) == 144);
C_ASSERT(FIELD_OFFSET(RTL_FILE, Elapsed) == 148);
C_ASSERT(FIELD_OFFSET(RTL_FILE, Content) == 152);
C_ASSERT(FIELD_OFFSET(RTL_FILE, Path) == 160);
C_ASSERT(FIELD_OFFSET(RTL_FILE, CopyTimeInMicroseconds) == 352);
C_ASSERT(FIELD_OFFSET(RTL_FILE, SourceCode) == 368);
C_ASSERT(FIELD_OFFSET(RTL_FILE, FileHandle) == 480);
C_ASSERT(FIELD_OFFSET(RTL_FILE, Reserved2) == 504);
C_ASSERT(sizeof(RTL_FILE) == 512);

//
// Inline functions for pushing/popping RTL_FILE structures to/from interlocked
// singly-linked list heads.
//

FORCEINLINE
_Check_return_
_Success_(return != 0)
BOOL
PopRtlFile(
    _In_  PSLIST_HEADER ListHead,
    _Out_ PPRTL_FILE File
    )
{
    PSLIST_ENTRY ListEntry;

    ListEntry = InterlockedPopEntrySList(ListHead);
    if (!ListEntry) {
        return FALSE;
    }

    *File = CONTAINING_RECORD(ListEntry,
                              RTL_FILE,
                              ListEntry);

    return TRUE;
}

FORCEINLINE
VOID
PushRtlFile(
    _In_ PSLIST_HEADER ListHead,
    _In_ PRTL_FILE File
    )
{
    InterlockedPushEntrySList(ListHead, &File->ListEntry);
}

//
// This structure provides bitfields that customize the behavior of the routine
// InitializeRtlFile().
//

typedef union _RTL_FILE_INIT_FLAGS {
    ULONG AsLong;
    struct _Struct_size_bytes_(sizeof(ULONG)) {
        ULONG IsSourceCode:1;
        ULONG IsImageFile:1;
