Opened log file 'cdb-output.txt'
0:000> dt -v Asm!_PAGE_COPY_TYPE
*** WARNING: Unable to verify checksum for S:\Source\tracer\x64\Debug\Asm.dll
struct _PAGE_COPY_TYPE, 5 elements, 0x4 bytes
   +0x000 Movsb            : Bitfield Pos 0, 1 Bit
   +0x000 Movsw            : Bitfield Pos 1, 1 Bit
   +0x000 Movsq            : Bitfield Pos 2, 1 Bit
   +0x000 Avx2C            : Bitfield Pos 3, 1 Bit
   +0x000 Avx2NonTemporal  : Bitfield Pos 4, 1 Bit
0:000> dt -v Asm!_COPY_PAGES_FUNCTIONS
struct _COPY_PAGES_FUNCTIONS, 4 elements, 0x20 bytes
   +0x000 CopyPagesNonTemporalAvx2_v1 : Ptr64 to     void 
   +0x008 CopyPagesNonTemporalAvx2_v2 : Ptr64 to     void 
   +0x010 CopyPagesNonTemporalAvx2_v3 : Ptr64 to     void 
   +0x018 CopyPagesNonTemporalAvx2_v4 : Ptr64 to     void 
0:000> dt -v DebugEngine!_DEBUG_ENGINE
*** WARNING: Unable to verify checksum for S:\Source\tracer\x64\Debug\DebugEngine.dll
struct _DEBUG_ENGINE, 64 elements, 0x2d0 bytes
   +0x000 SizeOfStruct     : Uint4B
   +0x004 Flags            : union _DEBUG_ENGINE_FLAGS, 3 elements, 0x4 bytes
   +0x008 State            : union _DEBUG_ENGINE_STATE, 8 elements, 0x4 bytes
   +0x010 Rtl              : Ptr64 to struct _RTL, 483 elements, 0x1020 bytes
   +0x018 Session          : Ptr64 to struct _DEBUG_ENGINE_SESSION, 67 elements, 0x2f0 bytes
   +0x020 IID_Client       : Ptr64 to struct _GUID, 4 elements, 0x10 bytes
   +0x028 IClient          : Ptr64 to struct IDebugClient7, 1 elements, 0x8 bytes
   +0x030 Client           : Ptr64 to struct IDebugClient7Vtbl, 97 elements, 0x308 bytes
   +0x038 IID_Control      : Ptr64 to struct _GUID, 4 elements, 0x10 bytes
   +0x040 IControl         : Ptr64 to struct IDebugControl7, 1 elements, 0x8 bytes
   +0x048 Control          : Ptr64 to struct IDebugControl7Vtbl, 177 elements, 0x588 bytes
   +0x050 IID_Symbols      : Ptr64 to struct _GUID, 4 elements, 0x10 bytes
   +0x058 ISymbols         : Ptr64 to struct IDebugSymbols5, 1 elements, 0x8 bytes
   +0x060 Symbols          : Ptr64 to struct IDebugSymbols5Vtbl, 135 elements, 0x438 bytes
   +0x068 IID_SymbolGroup  : Ptr64 to struct _GUID, 4 elements, 0x10 bytes
   +0x070 ISymbolGroup     : Ptr64 to struct IDebugSymbolGroup2, 1 elements, 0x8 bytes
   +0x078 SymbolGroup      : Ptr64 to struct IDebugSymbolGroup2Vtbl, 26 elements, 0xd0 bytes
   +0x080 IID_Advanced     : Ptr64 to struct _GUID, 4 elements, 0x10 bytes
   +0x088 IAdvanced        : Ptr64 to struct IDebugAdvanced4, 1 elements, 0x8 bytes
   +0x090 Advanced         : Ptr64 to struct IDebugAdvanced4Vtbl, 14 elements, 0x70 bytes
   +0x098 IID_DataSpaces   : Ptr64 to struct _GUID, 4 elements, 0x10 bytes
   +0x0a0 IDataSpaces      : Ptr64 to struct IDebugDataSpaces4, 1 elements, 0x8 bytes
   +0x0a8 DataSpaces       : Ptr64 to struct IDebugDataSpaces4Vtbl, 44 elements, 0x160 bytes
   +0x0b0 IID_Registers    : Ptr64 to struct _GUID, 4 elements, 0x10 bytes
   +0x0b8 IRegisters       : Ptr64 to struct IDebugRegisters2, 1 elements, 0x8 bytes
   +0x0c0 Registers        : Ptr64 to struct IDebugRegisters2Vtbl, 29 elements, 0xe8 bytes
   +0x0c8 IID_SystemObjects : Ptr64 to struct _GUID, 4 elements, 0x10 bytes
   +0x0d0 ISystemObjects   : Ptr64 to struct IDebugSystemObjects4, 1 elements, 0x8 bytes
   +0x0d8 SystemObjects    : Ptr64 to struct IDebugSystemObjects4Vtbl, 48 elements, 0x180 bytes
   +0x0e0 SessionStatus    : Uint4B
   +0x0e8 ExecutionStatus  : union _DEBUG_EXECUTION_STATUS, 8 elements, 0x8 bytes
   +0x0f0 EngineState      : Uint4B
   +0x0f8 EngineStateArg   : Uint8B
   +0x100 ChangeEngineState : union _DEBUG_CHANGE_ENGINE_STATE, 18 elements, 0x4 bytes
   +0x104 DebuggeeState    : Uint4B
   +0x108 DebuggeeStateArg : Uint8B
   +0x110 SymbolState      : Uint4B
   +0x118 SymbolStateArg   : Uint8B
   +0x120 ActualProcessorType : Uint4B
   +0x124 SystemError      : struct <unnamed-tag>, 2 elements, 0x8 bytes
   +0x12c EventCallbacksRefCount : Int4B
   +0x130 InputCallbacksRefCount : Int4B
   +0x134 OutputCallbacksRefCount : Int4B
   +0x138 OutputCallbacks2RefCount : Int4B
   +0x140 Lock             : struct _RTL_SRWLOCK, 1 elements, 0x8 bytes
   +0x148 OutputMask       : union _DEBUG_OUTPUT_MASK, 13 elements, 0x4 bytes
   +0x150 OutputCallback   : Ptr64 to     HRESULT 
   +0x158 DefaultOutputCallback : Ptr64 to     HRESULT 
   +0x160 OutputCallback2  : Ptr64 to     HRESULT 
   +0x168 CurrentOutput    : Ptr64 to struct _DEBUG_ENGINE_OUTPUT, 61 elements, 0x188 bytes
   +0x170 DefaultOutput    : Ptr64 to struct _DEBUG_ENGINE_OUTPUT, 61 elements, 0x188 bytes
   +0x178 EventCallbacksInterestMask : union _DEBUG_EVENT_CALLBACKS_INTEREST_MASK, 16 elements, 0x4 bytes
   +0x17c OutputCallbacks2InterestMask : union _DEBUG_OUTPUT_CALLBACKS2_INTEREST_MASK, 5 elements, 0x4 bytes
   +0x180 EventCallbacks   : struct IDebugEventCallbacksWideVtbl, 17 elements, 0x88 bytes
   +0x208 IEventCallbacks  : struct IDebugEventCallbacksWide, 1 elements, 0x8 bytes
   +0x210 InputCallbacks   : struct IDebugInputCallbacksVtbl, 5 elements, 0x28 bytes
   +0x238 IInputCallbacks  : struct IDebugInputCallbacks, 1 elements, 0x8 bytes
   +0x240 OutputCallbacks  : struct IDebugOutputCallbacksVtbl, 4 elements, 0x20 bytes
   +0x260 IOutputCallbacks : struct IDebugOutputCallbacks, 1 elements, 0x8 bytes
   +0x268 OutputCallbacks2 : struct IDebugOutputCallbacks2Vtbl, 6 elements, 0x30 bytes
   +0x298 IOutputCallbacks2 : struct IDebugOutputCallbacks2, 1 elements, 0x8 bytes
   +0x2a0 IID_CurrentEventCallbacks : struct _GUID, 4 elements, 0x10 bytes
   +0x2b0 IID_CurrentInputCallbacks : struct _GUID, 4 elements, 0x10 bytes
   +0x2c0 IID_CurrentOutputCallbacks : struct _GUID, 4 elements, 0x10 bytes
0:000> dt -v DebugEngine!_LINKED_PARTIAL_LINE
struct _LINKED_PARTIAL_LINE, 3 elements, 0x20 bytes
   +0x000 ListEntry        : struct _LIST_ENTRY, 2 elements, 0x10 bytes
   +0x010 PartialLine      : struct _STRING, 5 elements, 0x10 bytes
   +0x010 PartialLineWide  : struct _UNICODE_STRING, 5 elements, 0x10 bytes
0:000> dt -v DebugEngine!_DEBUG_ENGINE_OUTPUT
struct _DEBUG_ENGINE_OUTPUT, 61 elements, 0x188 bytes
   +0x000 SizeOfStruct     : Uint4B
   +0x004 Flags            : union _DEBUG_ENGINE_OUTPUT_FLAGS, 10 elements, 0x4 bytes
   +0x008 State            : union _DEBUG_ENGINE_OUTPUT_STATE, 30 elements, 0x4 bytes
   +0x00c NumberOfCallbacks : Uint4B
   +0x010 NumberOfLines    : Uint4B
   +0x014 NumberOfPartialCallbacks : Uint4B
   +0x018 TotalBufferLengthInChars : Uint4B
   +0x01c TotalBufferSizeInBytes : Uint4B
   +0x020 LargestChunkSizeInBytes : Uint4B
   +0x024 NumberOfParsedLines : Uint4B
   +0x028 Unused1          : Uint4B
   +0x02c ShortestLineInBytes : Uint2B
   +0x02e LongestLineInBytes : Uint2B
   +0x030 CurrentNumberOfConsecutivePartialCallbacks : Uint2B
   +0x032 LongestNumberOfConsecutivePartialCallbacks : Uint2B
   +0x034 LastResult       : HRESULT
   +0x038 Session          : Ptr64 to struct _DEBUG_ENGINE_SESSION, 67 elements, 0x2f0 bytes
   +0x040 Context          : Ptr64 to Void
   +0x048 Allocator        : Ptr64 to struct _ALLOCATOR, 28 elements, 0x90 bytes
   +0x050 ModulePath       : Ptr64 to struct _RTL_PATH, 18 elements, 0xc0 bytes
   +0x058 Command          : Ptr64 to struct _UNICODE_STRING, 5 elements, 0x10 bytes
   +0x060 CommandTemplate  : Ptr64 to struct _DEBUG_ENGINE_COMMAND_TEMPLATE, 9 elements, 0x38 bytes
   +0x068 CommandOptions   : Uint4B
   +0x070 Timestamp        : struct <unnamed-tag>, 2 elements, 0x10 bytes
   +0x080 LineOutputCallback : Ptr64 to     int 
   +0x088 PartialOutputCallback : Ptr64 to     int 
   +0x090 OutputCompleteCallback : Ptr64 to     int 
   +0x098 SaveOutputLine   : Ptr64 to     int 
   +0x0a0 LineAllocator    : Ptr64 to struct _ALLOCATOR, 28 elements, 0x90 bytes
   +0x0a8 TextAllocator    : Ptr64 to struct _ALLOCATOR, 28 elements, 0x90 bytes
   +0x0b0 CustomStructureAllocator : Ptr64 to struct _ALLOCATOR, 28 elements, 0x90 bytes
   +0x0b8 CustomStructureSecondaryAllocator : Ptr64 to struct _ALLOCATOR, 28 elements, 0x90 bytes
   +0x0c0 CustomStructureName : Ptr64 to struct _STRING, 5 elements, 0x10 bytes
   +0x0c8 CustomStructureSecondaryName : Ptr64 to struct _STRING, 5 elements, 0x10 bytes
   +0x0d0 NumberOfCustomStructures : Uint4B
   +0x0d8 CustomStructure  : Ptr64 to Void
   +0x0d8 FirstCustomStructure : Ptr64 to Void
   +0x0d8 DisplayedType    : Ptr64 to struct _DEBUG_ENGINE_DISPLAYED_TYPE, 7 elements, 0x38 bytes
   +0x0d8 ExaminedSymbol   : Ptr64 to struct _DEBUG_ENGINE_EXAMINED_SYMBOL, 11 elements, 0x100 bytes
   +0x0d8 UnassembledFunction : Ptr64 to struct _DEBUG_ENGINE_UNASSEMBLED_FUNCTION, 7 elements, 0x30 bytes
   +0x0e0 CustomStructureListHead : struct _LIST_ENTRY, 2 elements, 0x10 bytes
   +0x0f0 ParseLinesIntoCustomStructureCallback : Ptr64 to     int 
   +0x0f8 Line             : struct _STRING, 5 elements, 0x10 bytes
   +0x0f8 LineWide         : struct _UNICODE_STRING, 5 elements, 0x10 bytes
   +0x108 NumberOfSavedLines : Uint4B
   +0x10c NumberOfSavedBytes : Uint4B
   +0x110 SavedLinesListHead : struct _LIST_ENTRY, 2 elements, 0x10 bytes
   +0x120 pSavedLinesListHead : Ptr64 to struct _LIST_ENTRY, 2 elements, 0x10 bytes
   +0x128 NumberOfFailedLines : Uint4B
   +0x12c Unused2          : Uint4B
   +0x130 FailedLinesListHead : struct _LIST_ENTRY, 2 elements, 0x10 bytes
   +0x140 SavedLineBufferAllocationState : struct <unnamed-tag>, 2 elements, 0x4 bytes
   +0x144 FirstDiscontiguousBufferIndex : Uint4B
   +0x148 FirstSavedLineBuffer : Ptr64 to Char
   +0x150 SavedLineAllocationState : struct <unnamed-tag>, 2 elements, 0x4 bytes
   +0x154 FirstDiscontiguousLineIndex : Uint4B
   +0x158 FirstSavedLine   : Ptr64 to struct _LINKED_STRING, 8 elements, 0x20 bytes
   +0x160 NumberOfPartialLines : Uint4B
   +0x168 PartialLinesListHead : struct _LIST_ENTRY, 2 elements, 0x10 bytes
   +0x178 Chunk            : struct _STRING, 5 elements, 0x10 bytes
   +0x178 ChunkWide        : struct _UNICODE_STRING, 5 elements, 0x10 bytes
0:000> dt -v DebugEngine!_DEBUG_ENGINE_FUNCTION_ARGUMENT
struct _DEBUG_ENGINE_FUNCTION_ARGUMENT, 12 elements, 0x58 bytes
   +0x000 SizeOfStruct     : Uint4B
   +0x004 Flags            : union _DEBUG_ENGINE_FUNCTION_ARGUMENT_FLAGS, 20 elements, 0x4 bytes
   +0x008 SizeInBytes      : Int2B
   +0x00a ArgumentNumber   : Uint2B
   +0x00c StackPointerOffset : Uint2B
   +0x00e PointerDepth     : Uint2B
   +0x010 Atom             : struct <unnamed-tag>, 2 elements, 0x4 bytes
   +0x014 ArgumentType     : Enum _DEBUG_ENGINE_FUNCTION_ARGUMENT_TYPE,  27 total enums

   +0x018 String           : struct <unnamed-tag>, 2 elements, 0x20 bytes
   +0x038 Register         : union <unnamed-tag>, 1 elements, 0x4 bytes
   +0x040 ListEntry        : struct _LIST_ENTRY, 2 elements, 0x10 bytes
   +0x050 Type             : Ptr64 to struct _DEBUG_ENGINE_DISPLAYED_TYPE, 7 elements, 0x38 bytes
0:000> dt -v DebugEngine!_DEBUG_ENGINE_EXAMINED_SYMBOL
struct _DEBUG_ENGINE_EXAMINED_SYMBOL, 11 elements, 0x100 bytes
   +0x000 SizeOfStruct     : Uint4B
   +0x004 Flags            : union _DEBUG_ENGINE_EXAMINED_SYMBOL_FLAGS, 6 elements, 0x4 bytes
   +0x008 Type             : Enum _DEBUG_ENGINE_EXAMINE_SYMBOLS_TYPE,  28 total enums

   +0x00c Scope            : Enum _DEBUG_ENGINE_EXAMINE_SYMBOLS_SCOPE,  7 total enums

   +0x010 Output           : Ptr64 to struct _DEBUG_ENGINE_OUTPUT, 61 elements, 0x188 bytes
   +0x018 Size             : Uint4B
   +0x01c Padding1         : Uint4B
   +0x020 Address          : union _LARGE_INTEGER, 4 elements, 0x8 bytes
   +0x028 String           : struct <unnamed-tag>, 15 elements, 0xb0 bytes
   +0x0d8 ListEntry        : struct _LIST_ENTRY, 2 elements, 0x10 bytes
   +0x0e8 Function         : struct <unnamed-tag>, 3 elements, 0x18 bytes
0:000> dt -v DebugEngine!_DEBUG_ENGINE_DYNAMIC_COMMAND
struct _DEBUG_ENGINE_DYNAMIC_COMMAND, 6 elements, 0x20 bytes
   +0x000 SizeOfStruct     : Uint4B
   +0x004 Flags            : union _DEBUG_ENGINE_DYNAMIC_COMMAND_FLAGS, 3 elements, 0x4 bytes
   +0x008 NumberOfArguments : UChar
   +0x00a Unused           : [3] Uint2B
   +0x010 Bitmap           : Uint8B
   +0x018 Arguments        : Ptr64 to struct _UNICODE_STRING, 5 elements, 0x10 bytes
0:000> dt -v DebugEngine!_DEBUG_ENGINE_SESSION
struct _DEBUG_ENGINE_SESSION, 67 elements, 0x2f0 bytes
   +0x000 SizeOfStruct     : Uint4B
   +0x004 Flags            : union _DEBUG_ENGINE_SESSION_FLAGS, 8 elements, 0x4 bytes
   +0x008 Engine           : Ptr64 to struct _DEBUG_ENGINE, 64 elements, 0x2d0 bytes
   +0x010 ExitDispatchEngine : Ptr64 to struct _DEBUG_ENGINE, 64 elements, 0x2d0 bytes
   +0x018 InjectionModules : Ptr64 to struct _TRACER_INJECTION_MODULES, 7 elements, 0x28 bytes
   +0x020 Parent           : Ptr64 to struct _DEBUG_ENGINE_SESSION, 67 elements, 0x2f0 bytes
   +0x028 Children         : struct _GUARDED_LIST, 3 elements, 0x20 bytes
   +0x048 ListEntry        : struct _LIST_ENTRY, 2 elements, 0x10 bytes
   +0x058 InitializeChildDebugEngineSession : Ptr64 to     int 
   +0x060 ChildContext     : Ptr64 to Void
   +0x068 OutstandingInjectionInitializers : Uint8B
   +0x070 AllInjectionInitializersReady : Ptr64 to Void
   +0x078 NumberOfPendingApcs : Uint8B
   +0x080 ReadyForApcEvent : Ptr64 to Void
   +0x088 WaitForApcEvent  : Ptr64 to Void
   +0x090 Apc              : struct _APC, 4 elements, 0x20 bytes
   +0x0b0 ShutdownEvent    : Ptr64 to Void
   +0x0b8 ShutdownCompleteEvent : Ptr64 to Void
   +0x0c0 Destroy          : Ptr64 to     void 
   +0x0c8 InitializeDebugEngineOutput : Ptr64 to     int 
   +0x0d0 WaitForEvent     : Ptr64 to     HRESULT 
   +0x0d8 DispatchCallbacks : Ptr64 to     HRESULT 
   +0x0e0 EventDispatch    : Ptr64 to     HRESULT 
   +0x0e8 EventLoop        : Ptr64 to     int 
   +0x0f0 EventLoopRunOnce : Ptr64 to     int 
   +0x0f8 ExamineSymbols   : Ptr64 to     int 
   +0x100 UnassembleFunction : Ptr64 to     int 
   +0x108 DisplayType      : Ptr64 to     int 
   +0x110 SettingsMeta     : Ptr64 to     int 
   +0x118 ListSettings     : Ptr64 to     int 
   +0x120 ExecuteStaticCommand : Ptr64 to     int 
   +0x128 ExecuteDynamicCommand : Ptr64 to     int 
   +0x130 Rtl              : Ptr64 to struct _RTL, 483 elements, 0x1020 bytes
   +0x138 Allocator        : Ptr64 to struct _ALLOCATOR, 28 elements, 0x90 bytes
   +0x140 TracerConfig     : Ptr64 to struct _TRACER_CONFIG, 15 elements, 0x1c0 bytes
   +0x148 CommandLineA     : Ptr64 to Char
   +0x150 CommandLineW     : Ptr64 to Wchar
   +0x158 CommandLineOption : Enum _DEBUG_ENGINE_COMMAND_LINE_OPTION,  3 total enums

   +0x15c NumberOfArguments : Int4B
   +0x160 ArgvA            : Ptr64 to Ptr64 to Char
   +0x168 ArgvW            : Ptr64 to Ptr64 to Wchar
   +0x170 TargetProcessId  : Uint4B
   +0x170 TargetCommandLineA : Ptr64 to Char
   +0x180 TraceSessionDirectory : struct _RTL_PATH, 18 elements, 0xc0 bytes
   +0x240 RunHistoryRegistryPath : struct _UNICODE_STRING, 5 elements, 0x10 bytes
   +0x250 TargetProcessHandle : Ptr64 to Void
   +0x258 TargetMainThreadHandle : Ptr64 to Void
   +0x260 InitialProcessId : Uint4B
   +0x264 InitialThreadId  : Uint4B
   +0x268 InitialModuleNameW : struct _UNICODE_STRING, 5 elements, 0x10 bytes
   +0x278 RunHistoryRegistryKey : Ptr64 to struct HKEY__, 1 elements, 0x4 bytes
   +0x280 CreateStringTableFromDelimitedString : Ptr64 to     _STRING_TABLE* 
   +0x288 StringTableAllocator : Ptr64 to struct _ALLOCATOR, 28 elements, 0x90 bytes
   +0x290 StringArrayAllocator : Ptr64 to struct _ALLOCATOR, 28 elements, 0x90 bytes
   +0x298 ExamineSymbolsPrefixStringTable : Ptr64 to struct _STRING_TABLE, 16 elements, 0x200 bytes
   +0x2a0 NumberOfBasicTypeStringTables : Uint2B
   +0x2a2 NumberOfFunctionArgumentTypeStringTables : Uint2B
   +0x2a4 NumberOfDisplayTypesStringTables : Uint2B
   +0x2a6 Padding          : Uint2B
   +0x2a8 ExamineSymbolsBasicTypeStringTable1 : Ptr64 to struct _STRING_TABLE, 16 elements, 0x200 bytes
   +0x2b0 ExamineSymbolsBasicTypeStringTable2 : Ptr64 to struct _STRING_TABLE, 16 elements, 0x200 bytes
   +0x2b8 FunctionArgumentTypeStringTable1 : Ptr64 to struct _STRING_TABLE, 16 elements, 0x200 bytes
   +0x2c0 FunctionArgumentTypeStringTable2 : Ptr64 to struct _STRING_TABLE, 16 elements, 0x200 bytes
   +0x2c8 FunctionArgumentVectorTypeStringTable1 : Ptr64 to struct _STRING_TABLE, 16 elements, 0x200 bytes
   +0x2d0 DisplayTypesStringTable1 : Ptr64 to struct _STRING_TABLE, 16 elements, 0x200 bytes
   +0x2d8 DisplayTypesStringTable2 : Ptr64 to struct _STRING_TABLE, 16 elements, 0x200 bytes
   +0x2e0 CommandLineOptionsStringTable : Ptr64 to struct _STRING_TABLE, 16 elements, 0x200 bytes
0:000> dt -v DebugEngine!_DEBUG_ENGINE_COMMAND_FLAGS
struct _DEBUG_ENGINE_COMMAND_FLAGS, 7 elements, 0x4 bytes
   +0x000 HasOptions       : Bitfield Pos 0, 1 Bit
   +0x000 HasModuleName    : Bitfield Pos 1, 1 Bit
   +0x000 HasExclamationPoint : Bitfield Pos 2, 1 Bit
   +0x000 MandatoryArgument : Bitfield Pos 3, 1 Bit
   +0x000 OptionalArgument : Bitfield Pos 4, 1 Bit
   +0x000 ArgumentDefaultsToAsterisk : Bitfield Pos 5, 1 Bit
   +0x000 Unused           : Bitfield Pos 6, 1 Bit
0:000> dt -v DebugEngine!_DEBUG_ENGINE_COMMAND_OPTIONS
struct _DEBUG_ENGINE_COMMAND_OPTIONS, 1 elements, 0x8 bytes
   +0x000 OptionStrings    : Ptr64 to Ptr64 to Wchar
0:000> dt -v Python!_PYOBJECT
*** WARNING: Unable to verify checksum for S:\Source\tracer\x64\Debug\Python.dll
struct _PYOBJECT, 5 elements, 0x10 bytes
   +0x000 ob_refcnt        : Int8B
   +0x000 ReferenceCount   : Int8B
   +0x000 RefCountEx       : union _PY_OBJECT_REFCOUNTEX, 7 elements, 0x8 bytes
   +0x008 ob_type          : Ptr64 to struct _PYTYPEOBJECT, 101 elements, 0x188 bytes
   +0x008 Type             : Ptr64 to struct _PYTYPEOBJECT, 101 elements, 0x188 bytes
0:000> dt -v Python!_PYVAROBJECT
struct _PYVAROBJECT, 7 elements, 0x18 bytes
   +0x000 ob_refcnt        : Int8B
   +0x000 ReferenceCount   : Int8B
   +0x000 RefCountEx       : union _PY_OBJECT_REFCOUNTEX, 7 elements, 0x8 bytes
   +0x008 ob_type          : Ptr64 to struct _PYTYPEOBJECT, 101 elements, 0x188 bytes
   +0x008 Type             : Ptr64 to struct _PYTYPEOBJECT, 101 elements, 0x188 bytes
   +0x010 ob_size          : Int8B
   +0x010 ObjectSize       : Int8B
0:000> dt -v Python!_PYOLDSTYLECLASS
struct _PYOLDSTYLECLASS, 11 elements, 0x40 bytes
   +0x000 ob_refcnt        : Int8B
   +0x000 ReferenceCount   : Int8B
   +0x000 RefCountEx       : union _PY_OBJECT_REFCOUNTEX, 7 elements, 0x8 bytes
   +0x008 ob_type          : Ptr64 to struct _PYTYPEOBJECT, 101 elements, 0x188 bytes
   +0x008 Type             : Ptr64 to struct _PYTYPEOBJECT, 101 elements, 0x188 bytes
   +0x010 Bases            : Ptr64 to struct _PYOBJECT, 5 elements, 0x10 bytes
   +0x018 Dict             : Ptr64 to struct _PYOBJECT, 5 elements, 0x10 bytes
   +0x020 Name             : Ptr64 to struct _PYOBJECT, 5 elements, 0x10 bytes
   +0x028 GetAttr          : Ptr64 to struct _PYOBJECT, 5 elements, 0x10 bytes
   +0x030 SetAttr          : Ptr64 to struct _PYOBJECT, 5 elements, 0x10 bytes
   +0x038 DelAttr          : Ptr64 to struct _PYOBJECT, 5 elements, 0x10 bytes
0:000> dt -v Python!_PYINSTANCEOBJECT
struct _PYINSTANCEOBJECT, 8 elements, 0x28 bytes
   +0x000 ob_refcnt        : Int8B
   +0x000 ReferenceCount   : Int8B
   +0x000 RefCountEx       : union _PY_OBJECT_REFCOUNTEX, 7 elements, 0x8 bytes
   +0x008 ob_type          : Ptr64 to struct _PYTYPEOBJECT, 101 elements, 0x188 bytes
   +0x008 Type             : Ptr64 to struct _PYTYPEOBJECT, 101 elements, 0x188 bytes
   +0x010 OldStyleClass    : Ptr64 to struct _PYOLDSTYLECLASS, 11 elements, 0x40 bytes
   +0x018 Dict             : Ptr64 to struct _PYOBJECT, 5 elements, 0x10 bytes
   +0x020 WeakRefList      : Ptr64 to struct _PYOBJECT, 5 elements, 0x10 bytes
0:000> dt -v Python!_PYSTRINGOBJECT
struct _PYSTRINGOBJECT, 13 elements, 0x28 bytes
   +0x000 ob_refcnt        : Int8B
   +0x000 ReferenceCount   : Int8B
   +0x000 RefCountEx       : union _PY_OBJECT_REFCOUNTEX, 7 elements, 0x8 bytes
   +0x008 ob_type          : Ptr64 to struct _PYTYPEOBJECT, 101 elements, 0x188 bytes
   +0x008 Type             : Ptr64 to struct _PYTYPEOBJECT, 101 elements, 0x188 bytes
   +0x010 ob_size          : Int8B
   +0x010 ObjectSize       : Int8B
   +0x018 ob_shash         : Int4B
   +0x018 Hash             : Int4B
   +0x01c ob_sstate        : Int4B
   +0x01c State            : Int4B
   +0x020 ob_sval          : [1] Char
   +0x020 Value            : [1] Char
0:000> dt -v Python!_PYBYTESOBJECT
struct _PYBYTESOBJECT, 11 elements, 0x20 bytes
   +0x000 ob_refcnt        : Int8B
   +0x000 ReferenceCount   : Int8B
   +0x000 RefCountEx       : union _PY_OBJECT_REFCOUNTEX, 7 elements, 0x8 bytes
   +0x008 ob_type          : Ptr64 to struct _PYTYPEOBJECT, 101 elements, 0x188 bytes
   +0x008 Type             : Ptr64 to struct _PYTYPEOBJECT, 101 elements, 0x188 bytes
   +0x010 ob_size          : Int8B
   +0x010 ObjectSize       : Int8B
   +0x018 ob_shash         : Int4B
   +0x018 Hash             : Int4B
   +0x01c ob_sval          : [1] Char
   +0x01c Value            : [1] Char
0:000> dt -v Python!_PYUNICODEOBJECT
struct _PYUNICODEOBJECT, 11 elements, 0x28 bytes
   +0x000 ob_refcnt        : Int8B
   +0x000 ReferenceCount   : Int8B
   +0x000 RefCountEx       : union _PY_OBJECT_REFCOUNTEX, 7 elements, 0x8 bytes
   +0x008 ob_type          : Ptr64 to struct _PYTYPEOBJECT, 101 elements, 0x188 bytes
   +0x008 Type             : Ptr64 to struct _PYTYPEOBJECT, 101 elements, 0x188 bytes
   +0x010 length           : Int8B
   +0x010 Length           : Int8B
   +0x018 str              : Ptr64 to Wchar
   +0x018 String           : Ptr64 to Wchar
   +0x020 hash             : Int4B
   +0x020 Hash             : Int4B
0:000> dt -v Python!_PYCODEOBJECT25_27
struct _PYCODEOBJECT25_27, 34 elements, 0x70 bytes
   +0x000 ob_refcnt        : Int8B
   +0x000 ReferenceCount   : Int8B
   +0x000 RefCountEx       : union _PY_OBJECT_REFCOUNTEX, 7 elements, 0x8 bytes
   +0x008 ob_type          : Ptr64 to struct _PYTYPEOBJECT, 101 elements, 0x188 bytes
   +0x008 Type             : Ptr64 to struct _PYTYPEOBJECT, 101 elements, 0x188 bytes
   +0x010 co_argcount      : Int4B
   +0x010 ArgumentCount    : Int4B
   +0x014 co_nlocals       : Int4B
   +0x014 NumberOfLocals   : Int4B
   +0x018 co_stacksize     : Int4B
   +0x018 StackSize        : Int4B
   +0x01c co_flags         : Int4B
   +0x01c Flags            : Int4B
   +0x020 co_code          : Ptr64 to struct _PYOBJECT, 5 elements, 0x10 bytes
   +0x020 Code             : Ptr64 to struct _PYOBJECT, 5 elements, 0x10 bytes
   +0x028 co_consts        : Ptr64 to struct _PYOBJECT, 5 elements, 0x10 bytes
   +0x028 Constants        : Ptr64 to struct _PYOBJECT, 5 elements, 0x10 bytes
   +0x030 co_names         : Ptr64 to struct _PYOBJECT, 5 elements, 0x10 bytes
   +0x030 Names            : Ptr64 to struct _PYOBJECT, 5 elements, 0x10 bytes
   +0x038 co_varnames      : Ptr64 to struct _PYOBJECT, 5 elements, 0x10 bytes
   +0x038 LocalVariableNames : Ptr64 to struct _PYOBJECT, 5 elements, 0x10 bytes
   +0x040 co_freevars      : Ptr64 to struct _PYOBJECT, 5 elements, 0x10 bytes
   +0x040 FreeVariableNames : Ptr64 to struct _PYOBJECT, 5 elements, 0x10 bytes
   +0x048 co_cellvars      : Ptr64 to struct _PYOBJECT, 5 elements, 0x10 bytes
   +0x048 CellVariableNames : Ptr64 to struct _PYOBJECT, 5 elements, 0x10 bytes
   +0x050 co_filename      : Ptr64 to struct _PYOBJECT, 5 elements, 0x10 bytes
   +0x050 Filename         : Ptr64 to struct _PYOBJECT, 5 elements, 0x10 bytes
   +0x058 co_name          : Ptr64 to struct _PYOBJECT, 5 elements, 0x10 bytes
   +0x058 Name             : Ptr64 to struct _PYOBJECT, 5 elements, 0x10 bytes
   +0x058 NameString       : Ptr64 to struct _PYSTRINGOBJECT, 13 elements, 0x28 bytes
   +0x060 co_firstlineno   : Int4B
   +0x060 FirstLineNumber  : Int4B
   +0x068 co_lnotab        : Ptr64 to struct _PYOBJECT, 5 elements, 0x10 bytes
   +0x068 LineNumberTable  : Ptr64 to struct _PYOBJECT, 5 elements, 0x10 bytes
0:000> dt -v Python!_PYCODEOBJECT30_32
struct _PYCODEOBJECT30_32, 37 elements, 0x80 bytes
   +0x000 ob_refcnt        : Int8B
   +0x000 ReferenceCount   : Int8B
   +0x000 RefCountEx       : union _PY_OBJECT_REFCOUNTEX, 7 elements, 0x8 bytes
   +0x008 ob_type          : Ptr64 to struct _PYTYPEOBJECT, 101 elements, 0x188 bytes
   +0x008 Type             : Ptr64 to struct _PYTYPEOBJECT, 101 elements, 0x188 bytes
   +0x010 co_argcount      : Int4B
   +0x010 ArgumentCount    : Int4B
   +0x014 co_kwonlyargcount : Int4B
   +0x014 KeywordOnlyArgumentCount : Int4B
   +0x018 co_nlocals       : Int4B
   +0x018 NumberOfLocals   : Int4B
   +0x01c co_stacksize     : Int4B
   +0x01c StackSize        : Int4B
   +0x020 co_flags         : Int4B
   +0x020 Flags            : Int4B
   +0x028 co_code          : Ptr64 to struct _PYOBJECT, 5 elements, 0x10 bytes
   +0x028 Code             : Ptr64 to struct _PYOBJECT, 5 elements, 0x10 bytes
   +0x030 co_consts        : Ptr64 to struct _PYOBJECT, 5 elements, 0x10 bytes
   +0x030 Constants        : Ptr64 to struct _PYOBJECT, 5 elements, 0x10 bytes
   +0x038 co_names         : Ptr64 to struct _PYOBJECT, 5 elements, 0x10 bytes
   +0x038 Names            : Ptr64 to struct _PYOBJECT, 5 elements, 0x10 bytes
   +0x040 co_varnames      : Ptr64 to struct _PYOBJECT, 5 elements, 0x10 bytes
   +0x040 LocalVariableNames : Ptr64 to struct _PYOBJECT, 5 elements, 0x10 bytes
   +0x048 co_freevars      : Ptr64 to struct _PYOBJECT, 5 elements, 0x10 bytes
   +0x048 FreeVariableNames : Ptr64 to struct _PYOBJECT, 5 elements, 0x10 bytes
   +0x050 co_cellvars      : Ptr64 to struct _PYOBJECT, 5 elements, 0x10 bytes
   +0x050 CellVariableNames : Ptr64 to struct _PYOBJECT, 5 elements, 0x10 bytes
   +0x058 co_filename      : Ptr64 to struct _PYOBJECT, 5 elements, 0x10 bytes
   +0x058 Filename         : Ptr64 to struct _PYOBJECT, 5 elements, 0x10 bytes
   +0x060 co_name          : Ptr64 to struct _PYOBJECT, 5 elements, 0x10 bytes
   +0x060 Name             : Ptr64 to struct _PYOBJECT, 5 elements, 0x10 bytes
   +0x068 co_firstlineno   : Int4B
   +0x068 FirstLineNumber  : Int4B
   +0x070 co_lnotab        : Ptr64 to struct _PYOBJECT, 5 elements, 0x10 bytes
   +0x070 LineNumberTable  : Ptr64 to struct _PYOBJECT, 5 elements, 0x10 bytes
   +0x078 co_zombieframe   : Ptr64 to struct _PYOBJECT, 5 elements, 0x10 bytes
   +0x078 ZombieFrame      : Ptr64 to struct _PYOBJECT, 5 elements, 0x10 bytes
0:000> dt -v Python!_PYCODEOBJECT33_35
struct _PYCODEOBJECT33_35, 39 elements, 0x88 bytes
   +0x000 ob_refcnt        : Int8B
   +0x000 ReferenceCount   : Int8B
   +0x000 RefCountEx       : union _PY_OBJECT_REFCOUNTEX, 7 elements, 0x8 bytes
   +0x008 ob_type          : Ptr64 to struct _PYTYPEOBJECT, 101 elements, 0x188 bytes
   +0x008 Type             : Ptr64 to struct _PYTYPEOBJECT, 101 elements, 0x188 bytes
   +0x010 co_argcount      : Int4B
   +0x010 ArgumentCount    : Int4B
   +0x014 co_kwonlyargcount : Int4B
   +0x014 KeywordOnlyArgumentCount : Int4B
   +0x018 co_nlocals       : Int4B
   +0x018 NumberOfLocals   : Int4B
   +0x01c co_stacksize     : Int4B
   +0x01c StackSize        : Int4B
   +0x020 co_flags         : Int4B
   +0x020 Flags            : Int4B
   +0x028 co_code          : Ptr64 to struct _PYOBJECT, 5 elements, 0x10 bytes
   +0x028 Code             : Ptr64 to struct _PYOBJECT, 5 elements, 0x10 bytes
   +0x030 co_consts        : Ptr64 to struct _PYOBJECT, 5 elements, 0x10 bytes
   +0x030 Constants        : Ptr64 to struct _PYOBJECT, 5 elements, 0x10 bytes
   +0x038 co_names         : Ptr64 to struct _PYOBJECT, 5 elements, 0x10 bytes
   +0x038 Names            : Ptr64 to struct _PYOBJECT, 5 elements, 0x10 bytes
   +0x040 co_varnames      : Ptr64 to struct _PYOBJECT, 5 elements, 0x10 bytes
   +0x040 LocalVariableNames : Ptr64 to struct _PYOBJECT, 5 elements, 0x10 bytes
   +0x048 co_freevars      : Ptr64 to struct _PYOBJECT, 5 elements, 0x10 bytes
   +0x048 FreeVariableNames : Ptr64 to struct _PYOBJECT, 5 elements, 0x10 bytes
   +0x050 co_cellvars      : Ptr64 to struct _PYOBJECT, 5 elements, 0x10 bytes
   +0x050 CellVariableNames : Ptr64 to struct _PYOBJECT, 5 elements, 0x10 bytes
   +0x058 co_cell2arg      : Ptr64 to UChar
   +0x058 CellVariableToArgument : Ptr64 to UChar
   +0x060 co_filename      : Ptr64 to struct _PYOBJECT, 5 elements, 0x10 bytes
   +0x060 Filename         : Ptr64 to struct _PYOBJECT, 5 elements, 0x10 bytes
   +0x068 co_name          : Ptr64 to struct _PYOBJECT, 5 elements, 0x10 bytes
   +0x068 Name             : Ptr64 to struct _PYOBJECT, 5 elements, 0x10 bytes
   +0x070 co_firstlineno   : Int4B
   +0x070 FirstLineNumber  : Int4B
   +0x078 co_lnotab        : Ptr64 to struct _PYOBJECT, 5 elements, 0x10 bytes
   +0x078 LineNumberTable  : Ptr64 to struct _PYOBJECT, 5 elements, 0x10 bytes
   +0x080 co_zombieframe   : Ptr64 to struct _PYOBJECT, 5 elements, 0x10 bytes
   +0x080 ZombieFrame      : Ptr64 to struct _PYOBJECT, 5 elements, 0x10 bytes
0:000> dt -v Python!_PYCODEOBJECTOFFSETS
struct _PYCODEOBJECTOFFSETS, 32 elements, 0x20 bytes
   +0x000 co_argcount      : Uint2B
   +0x000 ArgumentCount    : Uint2B
   +0x002 co_kwonlyargcount : Uint2B
   +0x002 KeywordOnlyArgumentCount : Uint2B
   +0x004 co_nlocals       : Uint2B
   +0x004 NumberOfLocals   : Uint2B
   +0x006 co_stacksize     : Uint2B
   +0x006 StackSize        : Uint2B
   +0x008 co_flags         : Uint2B
   +0x008 Flags            : Uint2B
   +0x00a co_code          : Uint2B
   +0x00a Code             : Uint2B
   +0x00c co_consts        : Uint2B
   +0x00c Constants        : Uint2B
   +0x00e co_names         : Uint2B
   +0x00e Names            : Uint2B
   +0x010 co_varnames      : Uint2B
   +0x010 LocalVariableNames : Uint2B
   +0x012 co_freevars      : Uint2B
   +0x012 FreeVariableNames : Uint2B
   +0x014 co_cellvars      : Uint2B
   +0x014 CellVariableNames : Uint2B
   +0x016 co_filename      : Uint2B
   +0x016 Filename         : Uint2B
   +0x018 co_name          : Uint2B
   +0x018 Name             : Uint2B
   +0x01a co_firstlineno   : Uint2B
   +0x01a FirstLineNumber  : Uint2B
   +0x01c co_lnotab        : Uint2B
   +0x01c LineNumberTable  : Uint2B
   +0x01e co_zombieframe   : Uint2B
   +0x01e ZombieFrame      : Uint2B
0:000> dt -v Python!_PYFUNCTIONOBJECT
struct _PYFUNCTIONOBJECT, 14 elements, 0x28 bytes
   +0x000 ob_refcnt        : Int8B
   +0x000 ReferenceCount   : Int8B
   +0x000 RefCountEx       : union _PY_OBJECT_REFCOUNTEX, 7 elements, 0x8 bytes
   +0x008 ob_type          : Ptr64 to struct _PYTYPEOBJECT, 101 elements, 0x188 bytes
   +0x008 Type             : Ptr64 to struct _PYTYPEOBJECT, 101 elements, 0x188 bytes
   +0x010 func_code        : Ptr64 to struct _PYOBJECT, 5 elements, 0x10 bytes
   +0x010 Code             : Ptr64 to struct _PYOBJECT, 5 elements, 0x10 bytes
   +0x010 Code25_27        : Ptr64 to struct _PYCODEOBJECT25_27, 34 elements, 0x70 bytes
   +0x010 Code30_32        : Ptr64 to struct _PYCODEOBJECT30_32, 37 elements, 0x80 bytes
   +0x010 Code33_35        : Ptr64 to struct _PYCODEOBJECT33_35, 39 elements, 0x88 bytes
   +0x018 func_globals     : Ptr64 to struct _PYOBJECT, 5 elements, 0x10 bytes
   +0x018 Globals          : Ptr64 to struct _PYOBJECT, 5 elements, 0x10 bytes
   +0x020 func_defaults    : Ptr64 to struct _PYOBJECT, 5 elements, 0x10 bytes
   +0x020 Defaults         : Ptr64 to struct _PYOBJECT, 5 elements, 0x10 bytes
0:000> dt -v Python!_PYTRYBLOCK
struct _PYTRYBLOCK, 6 elements, 0xc bytes
   +0x000 b_type           : Int4B
   +0x000 Type             : Int4B
   +0x004 b_handler        : Int4B
   +0x004 Handler          : Int4B
   +0x008 b_level          : Int4B
   +0x008 Level            : Int4B
0:000> dt -v Python!_PYFRAMEOBJECT
struct _PYFRAMEOBJECT, 29 elements, 0x70 bytes
   +0x000 ob_refcnt        : Int8B
   +0x000 ReferenceCount   : Int8B
   +0x000 RefCountEx       : union _PY_OBJECT_REFCOUNTEX, 7 elements, 0x8 bytes
   +0x008 ob_type          : Ptr64 to struct _PYTYPEOBJECT, 101 elements, 0x188 bytes
   +0x008 Type             : Ptr64 to struct _PYTYPEOBJECT, 101 elements, 0x188 bytes
   +0x010 ob_size          : Int8B
   +0x010 ObjectSize       : Int8B
   +0x018 f_back           : Ptr64 to struct _PYFRAMEOBJECT, 29 elements, 0x70 bytes
   +0x018 Back             : Ptr64 to struct _PYFRAMEOBJECT, 29 elements, 0x70 bytes
   +0x020 f_code           : Ptr64 to struct _PYOBJECT, 5 elements, 0x10 bytes
   +0x020 Code             : Ptr64 to struct _PYOBJECT, 5 elements, 0x10 bytes
   +0x028 f_builtins       : Ptr64 to struct _PYOBJECT, 5 elements, 0x10 bytes
   +0x028 Builtins         : Ptr64 to struct _PYOBJECT, 5 elements, 0x10 bytes
   +0x030 f_globals        : Ptr64 to struct _PYOBJECT, 5 elements, 0x10 bytes
   +0x030 Globals          : Ptr64 to struct _PYOBJECT, 5 elements, 0x10 bytes
   +0x038 f_locals         : Ptr64 to struct _PYOBJECT, 5 elements, 0x10 bytes
   +0x038 Locals           : Ptr64 to struct _PYOBJECT, 5 elements, 0x10 bytes
   +0x040 f_valuestack     : Ptr64 to Ptr64 to struct _PYOBJECT, 5 elements, 0x10 bytes
   +0x040 ValueStack       : Ptr64 to Ptr64 to struct _PYOBJECT, 5 elements, 0x10 bytes
   +0x048 f_stacktop       : Ptr64 to Ptr64 to struct _PYOBJECT, 5 elements, 0x10 bytes
   +0x048 StackTop         : Ptr64 to Ptr64 to struct _PYOBJECT, 5 elements, 0x10 bytes
   +0x050 f_trace          : Ptr64 to struct _PYOBJECT, 5 elements, 0x10 bytes
   +0x050 Trace            : Ptr64 to struct _PYOBJECT, 5 elements, 0x10 bytes
   +0x058 f_exc_type       : Ptr64 to struct _PYOBJECT, 5 elements, 0x10 bytes
   +0x058 ExceptionType    : Ptr64 to struct _PYOBJECT, 5 elements, 0x10 bytes
   +0x060 f_exc_value      : Ptr64 to struct _PYOBJECT, 5 elements, 0x10 bytes
   +0x060 ExceptionValue   : Ptr64 to struct _PYOBJECT, 5 elements, 0x10 bytes
   +0x068 f_exc_traceback  : Ptr64 to struct _PYOBJECT, 5 elements, 0x10 bytes
   +0x068 ExceptionTraceback : Ptr64 to struct _PYOBJECT, 5 elements, 0x10 bytes
0:000> dt -v Python!_PYFRAMEOBJECT25_33
struct _PYFRAMEOBJECT25_33, 41 elements, 0x180 bytes
   +0x000 ob_refcnt        : Int8B
   +0x000 ReferenceCount   : Int8B
   +0x000 RefCountEx       : union _PY_OBJECT_REFCOUNTEX, 7 elements, 0x8 bytes
   +0x008 ob_type          : Ptr64 to struct _PYTYPEOBJECT, 101 elements, 0x188 bytes
   +0x008 Type             : Ptr64 to struct _PYTYPEOBJECT, 101 elements, 0x188 bytes
   +0x010 ob_size          : Int8B
   +0x010 ObjectSize       : Int8B
   +0x018 f_back           : Ptr64 to struct _PYFRAMEOBJECT, 29 elements, 0x70 bytes
   +0x018 Back             : Ptr64 to struct _PYFRAMEOBJECT, 29 elements, 0x70 bytes
   +0x020 f_code           : Ptr64 to struct _PYOBJECT, 5 elements, 0x10 bytes
   +0x020 Code             : Ptr64 to struct _PYOBJECT, 5 elements, 0x10 bytes
   +0x028 f_builtins       : Ptr64 to struct _PYOBJECT, 5 elements, 0x10 bytes
   +0x028 Builtins         : Ptr64 to struct _PYOBJECT, 5 elements, 0x10 bytes
   +0x030 f_globals        : Ptr64 to struct _PYOBJECT, 5 elements, 0x10 bytes
   +0x030 Globals          : Ptr64 to struct _PYOBJECT, 5 elements, 0x10 bytes
   +0x038 f_locals         : Ptr64 to struct _PYOBJECT, 5 elements, 0x10 bytes
   +0x038 Locals           : Ptr64 to struct _PYOBJECT, 5 elements, 0x10 bytes
   +0x040 f_valuestack     : Ptr64 to Ptr64 to struct _PYOBJECT, 5 elements, 0x10 bytes
   +0x040 ValueStack       : Ptr64 to Ptr64 to struct _PYOBJECT, 5 elements, 0x10 bytes
   +0x048 f_stacktop       : Ptr64 to Ptr64 to struct _PYOBJECT, 5 elements, 0x10 bytes
   +0x048 StackTop         : Ptr64 to Ptr64 to struct _PYOBJECT, 5 elements, 0x10 bytes
   +0x050 f_trace          : Ptr64 to struct _PYOBJECT, 5 elements, 0x10 bytes
   +0x050 Trace            : Ptr64 to struct _PYOBJECT, 5 elements, 0x10 bytes
   +0x058 f_exc_type       : Ptr64 to struct _PYOBJECT, 5 elements, 0x10 bytes
   +0x058 ExceptionType    : Ptr64 to struct _PYOBJECT, 5 elements, 0x10 bytes
   +0x060 f_exc_value      : Ptr64 to struct _PYOBJECT, 5 elements, 0x10 bytes
   +0x060 ExceptionValue   : Ptr64 to struct _PYOBJECT, 5 elements, 0x10 bytes
   +0x068 f_exc_traceback  : Ptr64 to struct _PYOBJECT, 5 elements, 0x10 bytes
   +0x068 ExceptionTraceback : Ptr64 to struct _PYOBJECT, 5 elements, 0x10 bytes
   +0x070 f_state          : Ptr64 to struct _PYTHREADSTATE, 0 elements, 0x0 bytes
   +0x070 ThreadState      : Ptr64 to struct _PYTHREADSTATE, 0 elements, 0x0 bytes
   +0x078 f_lasti          : Int4B
   +0x078 LastInstruction  : Int4B
   +0x07c f_lineno         : Int4B
   +0x07c LineNumber       : Int4B
   +0x080 f_iblock         : Int4B
   +0x080 BlockIndex       : Int4B
   +0x084 f_blockstack     : [20] struct _PYTRYBLOCK, 6 elements, 0xc bytes
   +0x084 BlockStack       : [20] struct _PYTRYBLOCK, 6 elements, 0xc bytes
   +0x178 f_localsplus     : [1] Ptr64 to struct _PYOBJECT, 5 elements, 0x10 bytes
   +0x178 LocalsPlusStack  : [1] Ptr64 to struct _PYOBJECT, 5 elements, 0x10 bytes
0:000> dt -v Python!_PYFRAMEOBJECT34_35
struct _PYFRAMEOBJECT34_35, 43 elements, 0x180 bytes
   +0x000 ob_refcnt        : Int8B
   +0x000 ReferenceCount   : Int8B
   +0x000 RefCountEx       : union _PY_OBJECT_REFCOUNTEX, 7 elements, 0x8 bytes
   +0x008 ob_type          : Ptr64 to struct _PYTYPEOBJECT, 101 elements, 0x188 bytes
   +0x008 Type             : Ptr64 to struct _PYTYPEOBJECT, 101 elements, 0x188 bytes
   +0x010 ob_size          : Int8B
   +0x010 ObjectSize       : Int8B
   +0x018 f_back           : Ptr64 to struct _PYFRAMEOBJECT, 29 elements, 0x70 bytes
   +0x018 Back             : Ptr64 to struct _PYFRAMEOBJECT, 29 elements, 0x70 bytes
   +0x020 f_code           : Ptr64 to struct _PYOBJECT, 5 elements, 0x10 bytes
   +0x020 Code             : Ptr64 to struct _PYOBJECT, 5 elements, 0x10 bytes
   +0x028 f_builtins       : Ptr64 to struct _PYOBJECT, 5 elements, 0x10 bytes
   +0x028 Builtins         : Ptr64 to struct _PYOBJECT, 5 elements, 0x10 bytes
   +0x030 f_globals        : Ptr64 to struct _PYOBJECT, 5 elements, 0x10 bytes
   +0x030 Globals          : Ptr64 to struct _PYOBJECT, 5 elements, 0x10 bytes
   +0x038 f_locals         : Ptr64 to struct _PYOBJECT, 5 elements, 0x10 bytes
   +0x038 Locals           : Ptr64 to struct _PYOBJECT, 5 elements, 0x10 bytes
   +0x040 f_valuestack     : Ptr64 to Ptr64 to struct _PYOBJECT, 5 elements, 0x10 bytes
   +0x040 ValueStack       : Ptr64 to Ptr64 to struct _PYOBJECT, 5 elements, 0x10 bytes
   +0x048 f_stacktop       : Ptr64 to Ptr64 to struct _PYOBJECT, 5 elements, 0x10 bytes
   +0x048 StackTop         : Ptr64 to Ptr64 to struct _PYOBJECT, 5 elements, 0x10 bytes
   +0x050 f_trace          : Ptr64 to struct _PYOBJECT, 5 elements, 0x10 bytes
   +0x050 Trace            : Ptr64 to struct _PYOBJECT, 5 elements, 0x10 bytes
   +0x058 f_exc_type       : Ptr64 to struct _PYOBJECT, 5 elements, 0x10 bytes
   +0x058 ExceptionType    : Ptr64 to struct _PYOBJECT, 5 elements, 0x10 bytes
   +0x060 f_exc_value      : Ptr64 to struct _PYOBJECT, 5 elements, 0x10 bytes
   +0x060 ExceptionValue   : Ptr64 to struct _PYOBJECT, 5 elements, 0x10 bytes
   +0x068 f_exc_traceback  : Ptr64 to struct _PYOBJECT, 5 elements, 0x10 bytes
   +0x068 ExceptionTraceback : Ptr64 to struct _PYOBJECT, 5 elements, 0x10 bytes
   +0x070 f_gen            : Ptr64 to struct _PYOBJECT, 5 elements, 0x10 bytes
   +0x070 Generator        : Ptr64 to struct _PYOBJECT, 5 elements, 0x10 bytes
   +0x078 f_lasti          : Int4B
   +0x078 LastInstruction  : Int4B
   +0x07c f_lineno         : Int4B
   +0x07c LineNumber       : Int4B
   +0x080 f_iblock         : Int4B
   +0x080 BlockIndex       : Int4B
   +0x084 f_executing      : Char
   +0x084 StillExecuting   : Char
   +0x088 f_blockstack     : [20] struct _PYTRYBLOCK, 6 elements, 0xc bytes
   +0x088 BlockStack       : [20] struct _PYTRYBLOCK, 6 elements, 0xc bytes
   +0x178 f_localsplus     : [1] Ptr64 to struct _PYOBJECT, 5 elements, 0x10 bytes
   +0x178 LocalsPlusStack  : [1] Ptr64 to struct _PYOBJECT, 5 elements, 0x10 bytes
0:000> dt -v Python!_PYFRAMEOBJECTOFFSETS
struct _PYFRAMEOBJECTOFFSETS, 16 elements, 0x10 bytes
   +0x000 f_state          : Uint2B
   +0x000 ThreadState      : Uint2B
   +0x002 f_lasti          : Uint2B
   +0x002 LastInstruction  : Uint2B
   +0x004 f_lineno         : Uint2B
   +0x004 LineNumber       : Uint2B
   +0x006 f_iblock         : Uint2B
   +0x006 BlockIndex       : Uint2B
   +0x008 f_blockstack     : Uint2B
   +0x008 BlockStack       : Uint2B
   +0x00a f_localsplus     : Uint2B
   +0x00a LocalsPlusStack  : Uint2B
   +0x00c f_gen            : Uint2B
   +0x00c Generator        : Uint2B
   +0x00e f_executing      : Uint2B
   +0x00e StillExecuting   : Uint2B
0:000> dt -v Python!_PYMETHODDEF
struct _PYMETHODDEF, 15 elements, 0x20 bytes
   +0x000 ml_name          : Ptr64 to Char
   +0x000 Name             : Ptr64 to Char
   +0x008 ml_meth          : Ptr64 to     _PYOBJECT* 
   +0x008 FunctionPointer  : Ptr64 to     _PYOBJECT* 
   +0x010 ml_flags         : Int4B
   +0x010 Flags            : Uint4B
   +0x010 VarArgs          : Bitfield Pos 0, 1 Bit
   +0x010 KeywordArgs      : Bitfield Pos 1, 1 Bit
   +0x010 NoArgs           : Bitfield Pos 2, 1 Bit
   +0x010 ObjectArg        : Bitfield Pos 3, 1 Bit
   +0x010 ClassMethod      : Bitfield Pos 4, 1 Bit
   +0x010 StaticMethod     : Bitfield Pos 5, 1 Bit
   +0x010 CoexistMethod    : Bitfield Pos 6, 1 Bit
   +0x018 ml_doc           : Ptr64 to Char
   +0x018 Doc              : Ptr64 to Char
0:000> dt -v Python!_PYGETSETDEF
struct _PYGETSETDEF, 10 elements, 0x28 bytes
   +0x000 name             : Ptr64 to Char
   +0x000 Name             : Ptr64 to Char
   +0x008 get              : Ptr64 to Ptr64 to struct _PYOBJECT, 5 elements, 0x10 bytes
   +0x008 Get              : Ptr64 to     _PYOBJECT* 
   +0x010 set              : Ptr64 to Int4B
   +0x010 Set              : Ptr64 to     long 
   +0x018 doc              : Ptr64 to Char
   +0x018 Doc              : Ptr64 to Char
   +0x020 closure          : Ptr64 to Void
   +0x020 Closure          : Ptr64 to Void
0:000> dt -v Python!_PYBUFFER
struct _PYBUFFER, 22 elements, 0x50 bytes
   +0x000 buf              : Ptr64 to Void
   +0x000 Buffer           : Ptr64 to Void
   +0x008 obj              : Ptr64 to struct _PYOBJECT, 5 elements, 0x10 bytes
   +0x008 Object           : Ptr64 to struct _PYOBJECT, 5 elements, 0x10 bytes
   +0x010 len              : Int8B
   +0x010 Length           : Int8B
   +0x018 itemsize         : Int8B
   +0x018 ItemSize         : Int8B
   +0x020 readonly         : Int4B
   +0x020 ReadOnly         : Int4B
   +0x024 ndim             : Int4B
   +0x024 NumberOfDimensions : Int4B
   +0x028 format           : Ptr64 to Char
   +0x028 Format           : Ptr64 to Char
   +0x030 shape            : Ptr64 to Int8B
   +0x030 Shape            : Ptr64 to Int8B
   +0x038 strides          : Ptr64 to Int8B
   +0x038 Strides          : Ptr64 to Int8B
   +0x040 suboffsets       : Ptr64 to Int8B
   +0x040 SubOffsets       : Ptr64 to Int8B
   +0x048 internal         : Ptr64 to Void
   +0x048 Internal         : Ptr64 to Void
0:000> dt -v Python!_PYBUFFERPROCS
struct _PYBUFFERPROCS, 4 elements, 0x10 bytes
   +0x000 bf_getbuffer     : Ptr64 to Int4B
   +0x000 GetBuffer        : Ptr64 to     long 
   +0x008 bf_releasebuffer : Ptr64 to     void 
   +0x008 ReleaseBuffer    : Ptr64 to     void 
0:000> dt -v Python!_PYASYNCMETHODS
struct _PYASYNCMETHODS, 6 elements, 0x18 bytes
   +0x000 am_await         : Ptr64 to Ptr64 to struct _PYOBJECT, 5 elements, 0x10 bytes
   +0x000 AsyncAwait       : Ptr64 to     _PYOBJECT* 
   +0x008 am_aiter         : Ptr64 to Ptr64 to struct _PYOBJECT, 5 elements, 0x10 bytes
   +0x008 AsyncIter        : Ptr64 to     _PYOBJECT* 
   +0x010 am_next          : Ptr64 to Ptr64 to struct _PYOBJECT, 5 elements, 0x10 bytes
   +0x010 AsyncNext        : Ptr64 to     _PYOBJECT* 
0:000> dt -v Python!_PYTYPEOBJECT
struct _PYTYPEOBJECT, 101 elements, 0x188 bytes
   +0x000 ob_refcnt        : Int8B
   +0x000 ReferenceCount   : Int8B
   +0x000 RefCountEx       : union _PY_OBJECT_REFCOUNTEX, 7 elements, 0x8 bytes
   +0x008 ob_type          : Ptr64 to struct _PYTYPEOBJECT, 101 elements, 0x188 bytes
   +0x008 Type             : Ptr64 to struct _PYTYPEOBJECT, 101 elements, 0x188 bytes
   +0x010 ob_size          : Int8B
   +0x010 ObjectSize       : Int8B
   +0x018 tp_name          : Ptr64 to Char
   +0x018 Name             : Ptr64 to Char
   +0x020 tp_basicsize     : Int8B
   +0x020 BasicSize        : Int8B
   +0x028 tp_itemsize      : Int8B
   +0x028 ItemSize         : Int8B
   +0x030 tp_dealloc       : Ptr64 to Void
   +0x030 Dealloc          : Ptr64 to     void 
   +0x038 tp_print         : Ptr64 to Void
   +0x038 Print            : Ptr64 to Void
   +0x040 tp_getattr       : Ptr64 to Void
   +0x040 GetAttribute     : Ptr64 to Void
   +0x048 tp_setattr       : Ptr64 to Void
   +0x048 SetAttribute     : Ptr64 to Void
   +0x050 tp_compare       : Ptr64 to Int4B
   +0x050 tp_as_async      : Ptr64 to struct _PYASYNCMETHODS, 6 elements, 0x18 bytes
   +0x050 Compare          : Ptr64 to     int 
   +0x050 AsyncMethods     : Ptr64 to struct _PYASYNCMETHODS, 6 elements, 0x18 bytes
   +0x058 tp_repr          : Ptr64 to Void
   +0x058 Repr             : Ptr64 to Void
   +0x060 tp_as_number     : Ptr64 to Void
   +0x060 NumberMethods    : Ptr64 to Void
   +0x068 tp_as_sequence   : Ptr64 to Void
   +0x068 SequenceMethods  : Ptr64 to Void
   +0x070 tp_as_mapping    : Ptr64 to Void
   +0x070 MappingMethods   : Ptr64 to Void
   +0x078 tp_hash          : Ptr64 to Int4B
   +0x078 Hash             : Ptr64 to     long 
   +0x080 tp_call          : Ptr64 to Void
   +0x080 Call             : Ptr64 to Void
   +0x088 tp_str           : Ptr64 to Void
   +0x088 Str              : Ptr64 to Void
   +0x090 tp_getattro      : Ptr64 to Void
   +0x090 GetAttributeObject : Ptr64 to Void
   +0x098 tp_setattro      : Ptr64 to Void
   +0x098 SetAttributeObject : Ptr64 to Void
   +0x0a0 tp_as_buffer     : Ptr64 to struct _PYBUFFERPROCS, 4 elements, 0x10 bytes
   +0x0a0 BufferMethods    : Ptr64 to struct _PYBUFFERPROCS, 4 elements, 0x10 bytes
   +0x0a8 tp_flags         : Int4B
   +0x0a8 Flags            : Int4B
   +0x0b0 tp_doc           : Ptr64 to Char
   +0x0b0 Doc              : Ptr64 to Char
   +0x0b8 tp_traverse      : Ptr64 to Void
   +0x0b8 Traverse         : Ptr64 to Void
   +0x0c0 tp_clear         : Ptr64 to Void
   +0x0c0 Clear            : Ptr64 to Void
   +0x0c8 tp_richcompare   : Ptr64 to Ptr64 to struct _PYOBJECT, 5 elements, 0x10 bytes
   +0x0c8 RichCompare      : Ptr64 to     _PYOBJECT* 
   +0x0d0 tp_weaklistoffset : Int8B
   +0x0d0 WeakListOffset   : Int8B
   +0x0d8 tp_iter          : Ptr64 to Void
   +0x0d8 Iter             : Ptr64 to Void
   +0x0e0 tp_iternext      : Ptr64 to Void
   +0x0e0 IterNext         : Ptr64 to Void
   +0x0e8 tp_methods       : Ptr64 to struct _PYMETHODDEF, 15 elements, 0x20 bytes
   +0x0e8 Methods          : Ptr64 to struct _PYMETHODDEF, 15 elements, 0x20 bytes
   +0x0f0 tp_members       : Ptr64 to struct _PYMETHODDEF, 15 elements, 0x20 bytes
   +0x0f0 MemberMethods    : Ptr64 to struct _PYMETHODDEF, 15 elements, 0x20 bytes
   +0x0f8 tp_getset        : Ptr64 to struct _PYGETSETDEF, 10 elements, 0x28 bytes
   +0x0f8 GetSetMethods    : Ptr64 to struct _PYGETSETDEF, 10 elements, 0x28 bytes
   +0x100 tp_base          : Ptr64 to struct _PYTYPEOBJECT, 101 elements, 0x188 bytes
   +0x100 BaseType         : Ptr64 to struct _PYTYPEOBJECT, 101 elements, 0x188 bytes
   +0x108 tp_dict          : Ptr64 to struct _PYOBJECT, 5 elements, 0x10 bytes
   +0x108 Dict             : Ptr64 to struct _PYOBJECT, 5 elements, 0x10 bytes
   +0x110 tp_descr_get     : Ptr64 to Void
   +0x110 DescriptorGet    : Ptr64 to Void
   +0x118 tp_descr_set     : Ptr64 to Void
   +0x118 DescriptorSet    : Ptr64 to Void
   +0x120 tp_dictoffset    : Int8B
   +0x120 DictOffset       : Int8B
   +0x128 tp_init          : Ptr64 to Void
   +0x128 Init             : Ptr64 to Void
   +0x130 tp_alloc         : Ptr64 to Void
   +0x130 Alloc            : Ptr64 to Void
   +0x138 tp_new           : Ptr64 to Void
   +0x138 New              : Ptr64 to Void
   +0x140 tp_free          : Ptr64 to Void
   +0x140 Free             : Ptr64 to Void
   +0x148 tp_is_gc         : Ptr64 to Void
   +0x148 IsGC             : Ptr64 to Void
   +0x150 tp_bases         : Ptr64 to struct _PYOBJECT, 5 elements, 0x10 bytes
   +0x150 Bases            : Ptr64 to struct _PYOBJECT, 5 elements, 0x10 bytes
   +0x158 tp_mro           : Ptr64 to struct _PYOBJECT, 5 elements, 0x10 bytes
   +0x158 MethodResolutionOrder : Ptr64 to struct _PYOBJECT, 5 elements, 0x10 bytes
   +0x160 tp_cache         : Ptr64 to struct _PYOBJECT, 5 elements, 0x10 bytes
   +0x160 Cache            : Ptr64 to struct _PYOBJECT, 5 elements, 0x10 bytes
   +0x168 tp_subclasses    : Ptr64 to struct _PYOBJECT, 5 elements, 0x10 bytes
   +0x168 Subclasses       : Ptr64 to struct _PYOBJECT, 5 elements, 0x10 bytes
   +0x170 tp_weaklist      : Ptr64 to struct _PYOBJECT, 5 elements, 0x10 bytes
   +0x170 WeakList         : Ptr64 to struct _PYOBJECT, 5 elements, 0x10 bytes
   +0x178 tp_del           : Ptr64 to struct _PYOBJECT, 5 elements, 0x10 bytes
   +0x178 Del              : Ptr64 to Void
   +0x180 tp_version_tag   : Uint4B
   +0x180 VersionTag       : Uint4B
0:000> dt -v Python!_PYTYPEOBJECTEX
struct _PYTYPEOBJECTEX, 2 elements, 0x8 bytes
   +0x000 Object           : Ptr64 to struct _PYOBJECT, 5 elements, 0x10 bytes
   +0x000 Type             : Ptr64 to struct _PYTYPEOBJECT, 101 elements, 0x188 bytes
0:000> dt -v Python!_PYTUPLEOBJECT
struct _PYTUPLEOBJECT, 9 elements, 0x20 bytes
   +0x000 ob_refcnt        : Int8B
   +0x000 ReferenceCount   : Int8B
   +0x000 RefCountEx       : union _PY_OBJECT_REFCOUNTEX, 7 elements, 0x8 bytes
   +0x008 ob_type          : Ptr64 to struct _PYTYPEOBJECT, 101 elements, 0x188 bytes
   +0x008 Type             : Ptr64 to struct _PYTYPEOBJECT, 101 elements, 0x188 bytes
   +0x010 ob_size          : Int8B
   +0x010 ObjectSize       : Int8B
   +0x018 ob_item          : [1] Ptr64 to struct _PYOBJECT, 5 elements, 0x10 bytes
   +0x018 Item             : [1] Ptr64 to struct _PYOBJECT, 5 elements, 0x10 bytes
0:000> dt -v Python!_PYDICTENTRY25_32
struct _PYDICTENTRY25_32, 6 elements, 0x18 bytes
   +0x000 me_hash          : Int8B
   +0x000 Hash             : Int8B
   +0x008 me_key           : Ptr64 to struct _PYOBJECT, 5 elements, 0x10 bytes
   +0x008 Key              : Ptr64 to struct _PYOBJECT, 5 elements, 0x10 bytes
   +0x010 me_value         : Ptr64 to struct _PYOBJECT, 5 elements, 0x10 bytes
   +0x010 Value            : Ptr64 to struct _PYOBJECT, 5 elements, 0x10 bytes
0:000> dt -v Python!_PYDICTOBJECT25_32
struct _PYDICTOBJECT25_32, 17 elements, 0xf8 bytes
   +0x000 ob_refcnt        : Int8B
   +0x000 ReferenceCount   : Int8B
   +0x000 RefCountEx       : union _PY_OBJECT_REFCOUNTEX, 7 elements, 0x8 bytes
   +0x008 ob_type          : Ptr64 to struct _PYTYPEOBJECT, 101 elements, 0x188 bytes
   +0x008 Type             : Ptr64 to struct _PYTYPEOBJECT, 101 elements, 0x188 bytes
   +0x010 ma_fill          : Int8B
   +0x010 Fill             : Int8B
   +0x018 ma_used          : Int8B
   +0x018 Used             : Int8B
   +0x020 ma_mask          : Int8B
   +0x020 Mask             : Int8B
   +0x028 ma_table         : Ptr64 to struct _PYDICTENTRY25_32, 6 elements, 0x18 bytes
   +0x028 Table            : Ptr64 to struct _PYDICTENTRY25_32, 6 elements, 0x18 bytes
   +0x030 ma_lookup        : Ptr64 to struct _PYDICTENTRY25_32, 6 elements, 0x18 bytes
   +0x030 Lookup           : Ptr64 to struct _PYDICTENTRY25_32, 6 elements, 0x18 bytes
   +0x038 ma_smalltable    : [8] struct _PYDICTENTRY25_32, 6 elements, 0x18 bytes
   +0x038 SmallTable       : [8] struct _PYDICTENTRY25_32, 6 elements, 0x18 bytes
0:000> dt -v Python!_PYCFUNCTIONOBJECT25_34
struct _PYCFUNCTIONOBJECT25_34, 11 elements, 0x28 bytes
   +0x000 ob_refcnt        : Int8B
   +0x000 ReferenceCount   : Int8B
   +0x000 RefCountEx       : union _PY_OBJECT_REFCOUNTEX, 7 elements, 0x8 bytes
   +0x008 ob_type          : Ptr64 to struct _PYTYPEOBJECT, 101 elements, 0x188 bytes
   +0x008 Type             : Ptr64 to struct _PYTYPEOBJECT, 101 elements, 0x188 bytes
   +0x010 m_ml             : Ptr64 to struct _PYMETHODDEF, 15 elements, 0x20 bytes
   +0x010 MethodDef        : Ptr64 to struct _PYMETHODDEF, 15 elements, 0x20 bytes
   +0x018 m_self           : Ptr64 to struct _PYOBJECT, 5 elements, 0x10 bytes
   +0x018 Self             : Ptr64 to struct _PYOBJECT, 5 elements, 0x10 bytes
   +0x020 m_module         : Ptr64 to struct _PYOBJECT, 5 elements, 0x10 bytes
   +0x020 Module           : Ptr64 to struct _PYOBJECT, 5 elements, 0x10 bytes
0:000> dt -v Python!_PYCFUNCTIONOBJECT35_35
struct _PYCFUNCTIONOBJECT35_35, 13 elements, 0x30 bytes
   +0x000 ob_refcnt        : Int8B
   +0x000 ReferenceCount   : Int8B
   +0x000 RefCountEx       : union _PY_OBJECT_REFCOUNTEX, 7 elements, 0x8 bytes
   +0x008 ob_type          : Ptr64 to struct _PYTYPEOBJECT, 101 elements, 0x188 bytes
   +0x008 Type             : Ptr64 to struct _PYTYPEOBJECT, 101 elements, 0x188 bytes
   +0x010 m_ml             : Ptr64 to struct _PYMETHODDEF, 15 elements, 0x20 bytes
   +0x010 MethodDef        : Ptr64 to struct _PYMETHODDEF, 15 elements, 0x20 bytes
   +0x018 m_self           : Ptr64 to struct _PYOBJECT, 5 elements, 0x10 bytes
   +0x018 Self             : Ptr64 to struct _PYOBJECT, 5 elements, 0x10 bytes
   +0x020 m_module         : Ptr64 to struct _PYOBJECT, 5 elements, 0x10 bytes
   +0x020 Module           : Ptr64 to struct _PYOBJECT, 5 elements, 0x10 bytes
   +0x028 m_weakreflist    : Ptr64 to struct _PYOBJECT, 5 elements, 0x10 bytes
   +0x028 WeakRefList      : Ptr64 to struct _PYOBJECT, 5 elements, 0x10 bytes
0:000> dt -v Python!_PYTHREADSTATE25_27
struct _PYTHREADSTATE25_27, 42 elements, 0x98 bytes
   +0x000 next             : Ptr64 to struct _PYTHREADSTATE25_27, 42 elements, 0x98 bytes
   +0x000 Next             : Ptr64 to struct _PYTHREADSTATE25_27, 42 elements, 0x98 bytes
   +0x008 interp           : Ptr64 to struct _PYINTERPRETERSTATE, 0 elements, 0x0 bytes
   +0x008 Interpreter      : Ptr64 to struct _PYINTERPRETERSTATE, 0 elements, 0x0 bytes
   +0x010 frame            : Ptr64 to struct _PYFRAMEOBJECT, 29 elements, 0x70 bytes
   +0x010 Frame            : Ptr64 to struct _PYFRAMEOBJECT, 29 elements, 0x70 bytes
   +0x018 recursion_depth  : Int4B
   +0x018 RecursionDepth   : Int4B
   +0x01c tracing          : Int4B
   +0x01c Tracing          : Int4B
   +0x020 use_tracing      : Int4B
   +0x020 UseTracing       : Int4B
   +0x028 c_profilefunc    : Ptr64 to     int 
   +0x028 ProfileFunction  : Ptr64 to     int 
   +0x030 c_tracefunc      : Ptr64 to     int 
   +0x030 TraceFunction    : Ptr64 to     int 
   +0x038 c_profileobj     : Ptr64 to struct _PYOBJECT, 5 elements, 0x10 bytes
   +0x038 ProfileObject    : Ptr64 to struct _PYOBJECT, 5 elements, 0x10 bytes
   +0x040 c_traceobj       : Ptr64 to struct _PYOBJECT, 5 elements, 0x10 bytes
   +0x040 TraceObject      : Ptr64 to struct _PYOBJECT, 5 elements, 0x10 bytes
   +0x048 curexc_type      : Ptr64 to struct _PYOBJECT, 5 elements, 0x10 bytes
   +0x048 CurrentExceptionType : Ptr64 to struct _PYOBJECT, 5 elements, 0x10 bytes
   +0x050 curexc_value     : Ptr64 to struct _PYOBJECT, 5 elements, 0x10 bytes
   +0x050 CurrentExceptionValue : Ptr64 to struct _PYOBJECT, 5 elements, 0x10 bytes
   +0x058 curexc_traceback : Ptr64 to struct _PYOBJECT, 5 elements, 0x10 bytes
   +0x058 CurrentExceptionTraceback : Ptr64 to struct _PYOBJECT, 5 elements, 0x10 bytes
   +0x060 exc_type         : Ptr64 to struct _PYOBJECT, 5 elements, 0x10 bytes
   +0x060 ExceptionType    : Ptr64 to struct _PYOBJECT, 5 elements, 0x10 bytes
   +0x068 exc_value        : Ptr64 to struct _PYOBJECT, 5 elements, 0x10 bytes
   +0x068 ExceptionValue   : Ptr64 to struct _PYOBJECT, 5 elements, 0x10 bytes
   +0x070 exc_traceback    : Ptr64 to struct _PYOBJECT, 5 elements, 0x10 bytes
   +0x070 ExceptionTraceback : Ptr64 to struct _PYOBJECT, 5 elements, 0x10 bytes
   +0x078 dict             : Ptr64 to struct _PYOBJECT, 5 elements, 0x10 bytes
   +0x078 Dict             : Ptr64 to struct _PYOBJECT, 5 elements, 0x10 bytes
   +0x080 tick_counter     : Int4B
   +0x080 TickCounter      : Int4B
   +0x084 gilstate_counter : Int4B
   +0x084 GilstateCounter  : Int4B
   +0x088 async_exc        : Ptr64 to struct _PYOBJECT, 5 elements, 0x10 bytes
   +0x088 AsyncException   : Ptr64 to struct _PYOBJECT, 5 elements, 0x10 bytes
   +0x090 thread_id        : Int4B
   +0x090 ThreadId         : Int4B
0:000> dt -v Python!_PYTHREADSTATE30_33
struct _PYTHREADSTATE30_33, 46 elements, 0x98 bytes
   +0x000 next             : Ptr64 to struct _PYTHREADSTATE30_33, 46 elements, 0x98 bytes
   +0x000 Next             : Ptr64 to struct _PYTHREADSTATE30_33, 46 elements, 0x98 bytes
   +0x008 interp           : Ptr64 to struct _PYINTERPRETERSTATE, 0 elements, 0x0 bytes
   +0x008 Interpreter      : Ptr64 to struct _PYINTERPRETERSTATE, 0 elements, 0x0 bytes
   +0x010 frame            : Ptr64 to struct _PYFRAMEOBJECT, 29 elements, 0x70 bytes
   +0x010 Frame            : Ptr64 to struct _PYFRAMEOBJECT, 29 elements, 0x70 bytes
   +0x018 recursion_depth  : Int4B
   +0x018 RecursionDepth   : Int4B
   +0x01c overflowed       : Char
   +0x01c Overflowed       : Char
   +0x01d recursion_critical : Char
   +0x01d RecursionCritical : Char
   +0x020 tracing          : Int4B
   +0x020 Tracing          : Int4B
   +0x024 use_tracing      : Int4B
   +0x024 UseTracing       : Int4B
   +0x028 c_profilefunc    : Ptr64 to     int 
   +0x028 ProfileFunction  : Ptr64 to     int 
   +0x030 c_tracefunc      : Ptr64 to     int 
   +0x030 TraceFunction    : Ptr64 to     int 
   +0x038 c_profileobj     : Ptr64 to struct _PYOBJECT, 5 elements, 0x10 bytes
   +0x038 ProfileObject    : Ptr64 to struct _PYOBJECT, 5 elements, 0x10 bytes
   +0x040 c_traceobj       : Ptr64 to struct _PYOBJECT, 5 elements, 0x10 bytes
   +0x040 TraceObject      : Ptr64 to struct _PYOBJECT, 5 elements, 0x10 bytes
   +0x048 curexc_type      : Ptr64 to struct _PYOBJECT, 5 elements, 0x10 bytes
   +0x048 CurrentExceptionType : Ptr64 to struct _PYOBJECT, 5 elements, 0x10 bytes
   +0x050 curexc_value     : Ptr64 to struct _PYOBJECT, 5 elements, 0x10 bytes
   +0x050 CurrentExceptionValue : Ptr64 to struct _PYOBJECT, 5 elements, 0x10 bytes
   +0x058 curexc_traceback : Ptr64 to struct _PYOBJECT, 5 elements, 0x10 bytes
   +0x058 CurrentExceptionTraceback : Ptr64 to struct _PYOBJECT, 5 elements, 0x10 bytes
   +0x060 exc_type         : Ptr64 to struct _PYOBJECT, 5 elements, 0x10 bytes
   +0x060 ExceptionType    : Ptr64 to struct _PYOBJECT, 5 elements, 0x10 bytes
   +0x068 exc_value        : Ptr64 to struct _PYOBJECT, 5 elements, 0x10 bytes
   +0x068 ExceptionValue   : Ptr64 to struct _PYOBJECT, 5 elements, 0x10 bytes
   +0x070 exc_traceback    : Ptr64 to struct _PYOBJECT, 5 elements, 0x10 bytes
   +0x070 ExceptionTraceback : Ptr64 to struct _PYOBJECT, 5 elements, 0x10 bytes
   +0x078 dict             : Ptr64 to struct _PYOBJECT, 5 elements, 0x10 bytes
   +0x078 Dict             : Ptr64 to struct _PYOBJECT, 5 elements, 0x10 bytes
   +0x080 tick_counter     : Int4B
   +0x080 TickCounter      : Int4B
   +0x084 gilstate_counter : Int4B
   +0x084 GilstateCounter  : Int4B
   +0x088 async_exc        : Ptr64 to struct _PYOBJECT, 5 elements, 0x10 bytes
   +0x088 AsyncException   : Ptr64 to struct _PYOBJECT, 5 elements, 0x10 bytes
   +0x090 thread_id        : Int4B
   +0x090 ThreadId         : Int4B
0:000> dt -v Python!_PYTHREADSTATE34_35
struct _PYTHREADSTATE34_35, 48 elements, 0xa0 bytes
   +0x000 prev             : Ptr64 to struct _PYTHREADSTATE34_35, 48 elements, 0xa0 bytes
   +0x000 Prev             : Ptr64 to struct _PYTHREADSTATE34_35, 48 elements, 0xa0 bytes
   +0x008 next             : Ptr64 to struct _PYTHREADSTATE34_35, 48 elements, 0xa0 bytes
   +0x008 Next             : Ptr64 to struct _PYTHREADSTATE34_35, 48 elements, 0xa0 bytes
   +0x010 interp           : Ptr64 to struct _PYINTERPRETERSTATE, 0 elements, 0x0 bytes
   +0x010 Interpreter      : Ptr64 to struct _PYINTERPRETERSTATE, 0 elements, 0x0 bytes
   +0x018 frame            : Ptr64 to struct _PYFRAMEOBJECT, 29 elements, 0x70 bytes
   +0x018 Frame            : Ptr64 to struct _PYFRAMEOBJECT, 29 elements, 0x70 bytes
   +0x020 recursion_depth  : Int4B
   +0x020 RecursionDepth   : Int4B
   +0x024 overflowed       : Char
   +0x024 Overflowed       : Char
   +0x025 recursion_critical : Char
   +0x025 RecursionCritical : Char
   +0x028 tracing          : Int4B
   +0x028 Tracing          : Int4B
   +0x02c use_tracing      : Int4B
   +0x02c UseTracing       : Int4B
   +0x030 c_profilefunc    : Ptr64 to     int 
   +0x030 ProfileFunction  : Ptr64 to     int 
   +0x038 c_tracefunc      : Ptr64 to     int 
   +0x038 TraceFunction    : Ptr64 to     int 
   +0x040 c_profileobj     : Ptr64 to struct _PYOBJECT, 5 elements, 0x10 bytes
   +0x040 ProfileObject    : Ptr64 to struct _PYOBJECT, 5 elements, 0x10 bytes
   +0x048 c_traceobj       : Ptr64 to struct _PYOBJECT, 5 elements, 0x10 bytes
   +0x048 TraceObject      : Ptr64 to struct _PYOBJECT, 5 elements, 0x10 bytes
   +0x050 curexc_type      : Ptr64 to struct _PYOBJECT, 5 elements, 0x10 bytes
   +0x050 CurrentExceptionType : Ptr64 to struct _PYOBJECT, 5 elements, 0x10 bytes
   +0x058 curexc_value     : Ptr64 to struct _PYOBJECT, 5 elements, 0x10 bytes
   +0x058 CurrentExceptionValue : Ptr64 to struct _PYOBJECT, 5 elements, 0x10 bytes
   +0x060 curexc_traceback : Ptr64 to struct _PYOBJECT, 5 elements, 0x10 bytes
   +0x060 CurrentExceptionTraceback : Ptr64 to struct _PYOBJECT, 5 elements, 0x10 bytes
   +0x068 exc_type         : Ptr64 to struct _PYOBJECT, 5 elements, 0x10 bytes
   +0x068 ExceptionType    : Ptr64 to struct _PYOBJECT, 5 elements, 0x10 bytes
   +0x070 exc_value        : Ptr64 to struct _PYOBJECT, 5 elements, 0x10 bytes
   +0x070 ExceptionValue   : Ptr64 to struct _PYOBJECT, 5 elements, 0x10 bytes
   +0x078 exc_traceback    : Ptr64 to struct _PYOBJECT, 5 elements, 0x10 bytes
   +0x078 ExceptionTraceback : Ptr64 to struct _PYOBJECT, 5 elements, 0x10 bytes
   +0x080 dict             : Ptr64 to struct _PYOBJECT, 5 elements, 0x10 bytes
   +0x080 Dict             : Ptr64 to struct _PYOBJECT, 5 elements, 0x10 bytes
   +0x088 tick_counter     : Int4B
   +0x088 TickCounter      : Int4B
   +0x08c gilstate_counter : Int4B
   +0x08c GilstateCounter  : Int4B
   +0x090 async_exc        : Ptr64 to struct _PYOBJECT, 5 elements, 0x10 bytes
   +0x090 AsyncException   : Ptr64 to struct _PYOBJECT, 5 elements, 0x10 bytes
   +0x098 thread_id        : Int4B
   +0x098 ThreadId         : Int4B
0:000> dt -v Python!_PYINTOBJECT
struct _PYINTOBJECT, 7 elements, 0x18 bytes
   +0x000 ob_refcnt        : Int8B
   +0x000 ReferenceCount   : Int8B
   +0x000 RefCountEx       : union _PY_OBJECT_REFCOUNTEX, 7 elements, 0x8 bytes
   +0x008 ob_type          : Ptr64 to struct _PYTYPEOBJECT, 101 elements, 0x188 bytes
   +0x008 Type             : Ptr64 to struct _PYTYPEOBJECT, 101 elements, 0x188 bytes
   +0x010 ob_ival          : Int4B
   +0x010 Value            : Int4B
0:000> dt -v Python!_PYLONGOBJECT
struct _PYLONGOBJECT, 9 elements, 0x20 bytes
   +0x000 ob_refcnt        : Int8B
   +0x000 ReferenceCount   : Int8B
   +0x000 RefCountEx       : union _PY_OBJECT_REFCOUNTEX, 7 elements, 0x8 bytes
   +0x008 ob_type          : Ptr64 to struct _PYTYPEOBJECT, 101 elements, 0x188 bytes
   +0x008 Type             : Ptr64 to struct _PYTYPEOBJECT, 101 elements, 0x188 bytes
   +0x010 ob_size          : Int8B
   +0x010 ObjectSize       : Int8B
   +0x018 ob_digit         : [1] Uint4B
   +0x018 Digit            : [1] Uint4B
0:000> dt -v Python!_PY_HASH_SECRET
struct _PY_HASH_SECRET, 2 elements, 0x8 bytes
   +0x000 Prefix           : Int4B
   +0x004 Suffix           : Int4B
0:000> dt -v Python!_PYOBJECTEX
struct _PYOBJECTEX, 17 elements, 0x8 bytes
   +0x000 Object           : Ptr64 to struct _PYOBJECT, 5 elements, 0x10 bytes
   +0x000 VarObject        : Ptr64 to struct _PYVAROBJECT, 7 elements, 0x18 bytes
   +0x000 Type             : Ptr64 to struct _PYTYPEOBJECT, 101 elements, 0x188 bytes
   +0x000 Code25_27        : Ptr64 to struct _PYCODEOBJECT25_27, 34 elements, 0x70 bytes
   +0x000 Code30_32        : Ptr64 to struct _PYCODEOBJECT30_32, 37 elements, 0x80 bytes
   +0x000 Code33_35        : Ptr64 to struct _PYCODEOBJECT33_35, 39 elements, 0x88 bytes
   +0x000 Frame            : Ptr64 to struct _PYFRAMEOBJECT, 29 elements, 0x70 bytes
   +0x000 Frame25_33       : Ptr64 to struct _PYFRAMEOBJECT25_33, 41 elements, 0x180 bytes
   +0x000 Frame34_35       : Ptr64 to struct _PYFRAMEOBJECT34_35, 43 elements, 0x180 bytes
   +0x000 Long             : Ptr64 to struct _PYLONGOBJECT, 9 elements, 0x20 bytes
   +0x000 Int              : Ptr64 to struct _PYINTOBJECT, 7 elements, 0x18 bytes
   +0x000 Tuple            : Ptr64 to struct _PYTUPLEOBJECT, 9 elements, 0x20 bytes
   +0x000 Function         : Ptr64 to struct _PYFUNCTIONOBJECT, 14 elements, 0x28 bytes
   +0x000 Bytes            : Ptr64 to struct _PYBYTESOBJECT, 11 elements, 0x20 bytes
   +0x000 String           : Ptr64 to struct _PYSTRINGOBJECT, 13 elements, 0x28 bytes
   +0x000 Unicode          : Ptr64 to struct _PYUNICODEOBJECT, 11 elements, 0x28 bytes
   +0x000 Instance         : Ptr64 to struct _PYINSTANCEOBJECT, 8 elements, 0x28 bytes
0:000> dt -v Python!_LINE_NUMBER
struct _LINE_NUMBER, 4 elements, 0x2 bytes
   +0x000 Pair             : Wchar
   +0x000 Value            : [2] Char
   +0x000 ByteIncrement    : UChar
   +0x001 LineIncrement    : UChar
0:000> dt -v Python!_LINE_NUMBER_TABLE2
struct _LINE_NUMBER_TABLE2, 6 elements, 0x28 bytes
   +0x000 ReferenceCount   : Int8B
   +0x008 Type             : Ptr64 to struct _PYTYPEOBJECT, 101 elements, 0x188 bytes
   +0x010 ObjectSize       : Int8B
   +0x018 Hash             : Int4B
   +0x01c State            : Int4B
   +0x020 Table            : [1] struct _LINE_NUMBER, 4 elements, 0x2 bytes
0:000> dt -v Python!_LINE_NUMBER_TABLE3
struct _LINE_NUMBER_TABLE3, 5 elements, 0x20 bytes
   +0x000 ReferenceCount   : Int8B
   +0x008 Type             : Ptr64 to struct _PYTYPEOBJECT, 101 elements, 0x188 bytes
   +0x010 ObjectSize       : Int8B
   +0x018 Hash             : Int4B
   +0x01c Table            : [1] struct _LINE_NUMBER, 4 elements, 0x2 bytes
0:000> dt -v Python!_PYTHONFUNCTIONS
struct _PYTHONFUNCTIONS, 54 elements, 0x1b0 bytes
   +0x000 PySys_SetArgvA   : Ptr64 to     void 
   +0x008 PySys_SetArgvW   : Ptr64 to     void 
   +0x010 PySys_SetArgvExA : Ptr64 to     void 
   +0x018 PySys_SetArgvExW : Ptr64 to     void 
   +0x020 Py_SetProgramNameA : Ptr64 to     void 
   +0x028 Py_SetProgramNameW : Ptr64 to     void 
   +0x030 Py_GetProgramNameA : Ptr64 to     char* 
   +0x038 Py_GetProgramNameW : Ptr64 to     wchar_t* 
   +0x040 Py_SetPythonHomeA : Ptr64 to     void 
   +0x048 Py_SetPythonHomeW : Ptr64 to     void 
   +0x050 Py_MainA         : Ptr64 to     long 
   +0x058 Py_MainW         : Ptr64 to     long 
   +0x060 Py_GetPrefixA    : Ptr64 to     char* 
   +0x068 Py_GetPrefixW    : Ptr64 to     wchar_t* 
   +0x070 Py_GetExecPrefixA : Ptr64 to     char* 
   +0x078 Py_GetExecPrefixW : Ptr64 to     wchar_t* 
   +0x080 Py_GetProgramFullPathA : Ptr64 to     char* 
   +0x088 Py_GetProgramFullPathW : Ptr64 to     wchar_t* 
   +0x090 Py_Initialize    : Ptr64 to     void 
   +0x098 Py_InitializeEx  : Ptr64 to     void 
   +0x0a0 Py_IsInitialized : Ptr64 to     int 
   +0x0a8 Py_Finalize      : Ptr64 to     void 
   +0x0b0 Py_GetVersion    : Ptr64 to     char* 
   +0x0b8 PyDict_GetItemString : Ptr64 to     _PYOBJECT* 
   +0x0c0 PyFrame_GetLineNumber : Ptr64 to     long 
   +0x0c8 PyCode_Addr2Line : Ptr64 to     long 
   +0x0d0 PyEval_SetProfile : Ptr64 to     long 
   +0x0d8 PyEval_SetTrace  : Ptr64 to     long 
   +0x0e0 PyUnicode_AsUnicode : Ptr64 to     wchar_t* 
   +0x0e8 PyUnicode_GetLength : Ptr64 to     int64 
   +0x0f0 Py_IncRef        : Ptr64 to     void 
   +0x0f8 Py_DecRef        : Ptr64 to     void 
   +0x100 PyGILState_Ensure : Ptr64 to     _PYGILSTATE 
   +0x108 PyGILState_Release : Ptr64 to     void 
   +0x110 PyObject_Hash    : Ptr64 to     long 
   +0x118 PyObject_Compare : Ptr64 to     int 
   +0x120 PyMem_Malloc     : Ptr64 to     void* 
   +0x128 PyMem_Realloc    : Ptr64 to     void* 
   +0x130 PyMem_Free       : Ptr64 to     void 
   +0x138 PyObject_Malloc  : Ptr64 to     void* 
   +0x140 PyObject_Realloc : Ptr64 to     void* 
   +0x148 PyObject_Free    : Ptr64 to     void 
   +0x150 PyGC_Collect     : Ptr64 to     int64 
   +0x158 _PyObject_GC_Malloc : Ptr64 to     _PYOBJECT* 
   +0x160 _PyObject_GC_New : Ptr64 to     _PYOBJECT* 
   +0x168 _PyObject_GC_NewVar : Ptr64 to     _PYVAROBJECT* 
   +0x170 _PyObject_GC_Resize : Ptr64 to     _PYVAROBJECT* 
   +0x178 PyObject_GC_Track : Ptr64 to     void 
   +0x180 PyObject_GC_UnTrack : Ptr64 to     void 
   +0x188 PyObject_GC_Del  : Ptr64 to     void 
   +0x190 PyObject_Init    : Ptr64 to     _PYOBJECT* 
   +0x198 PyObject_InitVar : Ptr64 to     _PYVAROBJECT* 
   +0x1a0 _PyObject_New    : Ptr64 to     _PYOBJECT* 
   +0x1a8 _PyObject_NewVar : Ptr64 to     _PYVAROBJECT* 
0:000> dt -v Python!_PYTHONDATA
struct _PYTHONDATA, 16 elements, 0x80 bytes
   +0x000 _Py_NoneStruct   : struct _PYOBJECTEX, 17 elements, 0x8 bytes
   +0x008 _Py_TrueStruct   : struct _PYOBJECTEX, 17 elements, 0x8 bytes
   +0x010 _Py_FalseStruct  : struct _PYOBJECTEX, 17 elements, 0x8 bytes
   +0x018 _Py_ZeroStruct   : struct _PYOBJECTEX, 17 elements, 0x8 bytes
   +0x020 _Py_HashSecret   : struct _PY_HASH_SECRET, 2 elements, 0x8 bytes
   +0x028 PyString         : struct _PYTYPEOBJECTEX, 2 elements, 0x8 bytes
   +0x030 PyBytes          : struct _PYTYPEOBJECTEX, 2 elements, 0x8 bytes
   +0x038 PyCode           : struct _PYTYPEOBJECTEX, 2 elements, 0x8 bytes
   +0x040 PyDict           : struct _PYTYPEOBJECTEX, 2 elements, 0x8 bytes
   +0x048 PyTuple          : struct _PYTYPEOBJECTEX, 2 elements, 0x8 bytes
   +0x050 PyType           : struct _PYTYPEOBJECTEX, 2 elements, 0x8 bytes
   +0x058 PyFunction       : struct _PYTYPEOBJECTEX, 2 elements, 0x8 bytes
   +0x060 PyUnicode        : struct _PYTYPEOBJECTEX, 2 elements, 0x8 bytes
   +0x068 PyCFunction      : struct _PYTYPEOBJECTEX, 2 elements, 0x8 bytes
   +0x070 PyInstance       : struct _PYTYPEOBJECTEX, 2 elements, 0x8 bytes
   +0x078 PyModule         : struct _PYTYPEOBJECTEX, 2 elements, 0x8 bytes
0:000> dt -v Python!_PYTHONVERSION
struct _PYTHONVERSION, 4 elements, 0x10 bytes
   +0x000 VersionString    : Ptr64 to Char
   +0x008 MajorVersion     : Uint2B
   +0x00a MinorVersion     : Uint2B
   +0x00c PatchLevel       : Uint2B
0:000> dt -v Python!_PYTHON_ALLOCATORS
struct _PYTHON_ALLOCATORS, 14 elements, 0x6c8 bytes
   +0x000 SizeInBytes      : Uint4B
   +0x004 NumberOfAllocators : Uint4B
   +0x008 StringBuffer     : struct _ALLOCATOR, 28 elements, 0x90 bytes
   +0x098 PythonFunctionTable : struct _ALLOCATOR, 28 elements, 0x90 bytes
   +0x128 PythonFunctionTableEntry : struct _ALLOCATOR, 28 elements, 0x90 bytes
   +0x1b8 PythonPathTable  : struct _ALLOCATOR, 28 elements, 0x90 bytes
   +0x248 PythonPathTableEntry : struct _ALLOCATOR, 28 elements, 0x90 bytes
   +0x2d8 StringArray      : struct _ALLOCATOR, 28 elements, 0x90 bytes
   +0x368 StringTable      : struct _ALLOCATOR, 28 elements, 0x90 bytes
   +0x3f8 PythonModuleTable : struct _ALLOCATOR, 28 elements, 0x90 bytes
   +0x488 PythonModuleTableEntry : struct _ALLOCATOR, 28 elements, 0x90 bytes
   +0x518 LineTable        : struct _ALLOCATOR, 28 elements, 0x90 bytes
   +0x5a8 LineTableEntry   : struct _ALLOCATOR, 28 elements, 0x90 bytes
   +0x638 LineStringBuffer : struct _ALLOCATOR, 28 elements, 0x90 bytes
0:000> dt -v Python!_PYTHON_HASHED_STRING
struct _PYTHON_HASHED_STRING, 6 elements, 0x18 bytes
   +0x000 Atom             : Uint4B
   +0x004 Hash             : Int4B
   +0x008 String           : struct _STRING, 5 elements, 0x10 bytes
   +0x008 Length           : Uint2B
   +0x00a MaximumLength    : Uint2B
   +0x010 Buffer           : Ptr64 to Char
0:000> dt -v Python!_PYTHONEXFUNCTIONS
struct _PYTHONEXFUNCTIONS, 14 elements, 0x70 bytes
   +0x000 AllocateString   : Ptr64 to     int 
   +0x008 AllocateStringBuffer : Ptr64 to     int 
   +0x010 AllocateStringAndBuffer : Ptr64 to     int 
   +0x018 FreeString       : Ptr64 to     void 
   +0x020 FreeStringAndBuffer : Ptr64 to     void 
   +0x028 FreeStringBuffer : Ptr64 to     void 
   +0x030 FreeStringBufferDirect : Ptr64 to     void 
   +0x038 AllocateBuffer   : Ptr64 to     int 
   +0x040 FreeBuffer       : Ptr64 to     void 
   +0x048 RegisterFrame    : Ptr64 to     int 
   +0x050 SetPythonAllocators : Ptr64 to     int 
   +0x058 SetRegisterNewPathEntryCallback : Ptr64 to     int 
   +0x060 HashAndAtomizeAnsi : Ptr64 to     int 
   +0x068 InitializePythonRuntimeTables : Ptr64 to     int 
0:000> dt -v Python!_PYTHON_PATH_TABLE
struct _PYTHON_PATH_TABLE, 4 elements, 0x10 bytes
   +0x000 PrefixTable      : struct _PREFIX_TABLE, 4 elements, 0x10 bytes
   +0x000 NodeTypeCode     : Int2B
   +0x002 NameLength       : Int2B
   +0x008 NextPrefixTree   : Ptr64 to struct _PYTHON_PATH_TABLE_ENTRY, 50 elements, 0x400 bytes
0:000> dt -v Python!_PYTHON_PATH_TABLE_ENTRY
struct _PYTHON_PATH_TABLE_ENTRY, 50 elements, 0x400 bytes
   +0x000 PrefixTableEntry : struct _PREFIX_TABLE_ENTRY, 5 elements, 0x30 bytes
   +0x000 NodeTypeCode     : Int2B
   +0x002 PrefixNameLength : Int2B
   +0x004 PathEntryTypeFlags : Uint4B
   +0x004 IsModuleDirectory : Bitfield Pos 0, 1 Bit
   +0x004 IsNonModuleDirectory : Bitfield Pos 1, 1 Bit
   +0x004 IsFileSystemDirectory : Bitfield Pos 2, 1 Bit
   +0x004 IsFile           : Bitfield Pos 3, 1 Bit
   +0x004 IsClass          : Bitfield Pos 4, 1 Bit
   +0x004 IsFunction       : Bitfield Pos 5, 1 Bit
   +0x004 IsSpecial        : Bitfield Pos 6, 1 Bit
   +0x004 IsValid          : Bitfield Pos 7, 1 Bit
   +0x004 IsDll            : Bitfield Pos 8, 1 Bit
   +0x004 IsC              : Bitfield Pos 9, 1 Bit
   +0x004 IsBuiltin        : Bitfield Pos 10, 1 Bit
   +0x004 IsInitPy         : Bitfield Pos 11, 1 Bit
   +0x008 NextPrefixTree   : Ptr64 to struct _PYTHON_PATH_TABLE_ENTRY, 50 elements, 0x400 bytes
   +0x010 Links            : struct _RTL_SPLAY_LINKS, 3 elements, 0x18 bytes
   +0x010 Parent           : Ptr64 to struct _RTL_SPLAY_LINKS, 3 elements, 0x18 bytes
   +0x018 LeftChild        : Ptr64 to struct _RTL_SPLAY_LINKS, 3 elements, 0x18 bytes
   +0x020 RightChild       : Ptr64 to struct _RTL_SPLAY_LINKS, 3 elements, 0x18 bytes
   +0x028 Prefix           : Ptr64 to struct _STRING, 5 elements, 0x10 bytes
   +0x030 Path             : struct _STRING, 5 elements, 0x10 bytes
   +0x030 PathLength       : Uint2B
   +0x032 PathMaximumLength : Uint2B
   +0x034 Extension        : [4] Char
   +0x034 PathHash         : Int4B
   +0x038 PathBuffer       : Ptr64 to Char
   +0x040 FullName         : struct _STRING, 5 elements, 0x10 bytes
   +0x040 FullNameLength   : Uint2B
   +0x042 FullNameMaximumLength : Uint2B
   +0x044 FullNameHash     : Int4B
   +0x048 FullNameBuffer   : Ptr64 to Char
   +0x050 ModuleName       : struct _STRING, 5 elements, 0x10 bytes
   +0x050 ModuleNameLength : Uint2B
   +0x052 ModuleNameMaximumLength : Uint2B
   +0x054 ModuleNameHash   : Int4B
   +0x058 ModuleNameBuffer : Ptr64 to Char
   +0x060 Name             : struct _STRING, 5 elements, 0x10 bytes
   +0x060 NameLength       : Uint2B
   +0x062 NameMaximumLength : Uint2B
   +0x064 NameHash         : Int4B
   +0x068 NameBuffer       : Ptr64 to Char
   +0x070 ClassName        : struct _STRING, 5 elements, 0x10 bytes
   +0x070 ClassNameLength  : Uint2B
   +0x072 ClassNameMaximumLength : Uint2B
   +0x074 ClassNameHash    : Int4B
   +0x078 ClassNameBuffer  : Ptr64 to Char
   +0x080 File             : struct _RTL_FILE, 32 elements, 0x200 bytes
   +0x280 Reserved         : [384] UChar
0:000> dt -v Python!_PYTHON_FUNCTION
struct _PYTHON_FUNCTION, 23 elements, 0x7d0 bytes
   +0x000 PathEntry        : struct _PYTHON_PATH_TABLE_ENTRY, 50 elements, 0x400 bytes
   +0x400 ParentPathEntry  : Ptr64 to struct _PYTHON_PATH_TABLE_ENTRY, 50 elements, 0x400 bytes
   +0x408 Key              : Uint8B
   +0x410 CodeObject       : Ptr64 to struct _PYOBJECT, 5 elements, 0x10 bytes
   +0x410 Code25_27        : Ptr64 to struct _PYCODEOBJECT25_27, 34 elements, 0x70 bytes
   +0x410 Code30_32        : Ptr64 to struct _PYCODEOBJECT30_32, 37 elements, 0x80 bytes
   +0x410 Code33_35        : Ptr64 to struct _PYCODEOBJECT33_35, 39 elements, 0x88 bytes
   +0x418 PyCFunctionObject : Ptr64 to struct _PYCFUNCTIONOBJECT25_34, 11 elements, 0x28 bytes
   +0x418 PyCFunction25_34 : Ptr64 to struct _PYCFUNCTIONOBJECT25_34, 11 elements, 0x28 bytes
   +0x418 PyCFunction35_35 : Ptr64 to struct _PYCFUNCTIONOBJECT35_35, 13 elements, 0x30 bytes
   +0x420 MaxCallStackDepth : Uint4B
   +0x424 CallCount        : Uint4B
   +0x428 CodeLineNumbers  : Ptr64 to Uint2B
   +0x430 CodeObjectHash   : Int4B
   +0x434 FirstLineNumber  : Uint2B
   +0x436 NumberOfLines    : Uint2B
   +0x438 NumberOfCodeLines : Uint2B
   +0x43a SizeOfByteCodeInBytes : Uint2B
   +0x428 ModuleHandle     : Ptr64 to Void
   +0x440 ListEntry        : struct _LIST_ENTRY, 2 elements, 0x10 bytes
   +0x450 Signature        : Uint8B
   +0x458 HashEntry        : struct _RTL_DYNAMIC_HASH_TABLE_ENTRY, 2 elements, 0x18 bytes
   +0x470 Reserved         : [864] UChar
0:000> dt -v Python!_PYTHON_FUNCTION_TABLE_ENTRY
struct _PYTHON_FUNCTION_TABLE_ENTRY, 8 elements, 0x800 bytes
   +0x000 Links            : struct _RTL_SPLAY_LINKS, 3 elements, 0x18 bytes
   +0x000 Parent           : Ptr64 to struct _RTL_SPLAY_LINKS, 3 elements, 0x18 bytes
   +0x008 LeftChild        : Ptr64 to struct _RTL_SPLAY_LINKS, 3 elements, 0x18 bytes
   +0x010 RightChild       : Ptr64 to struct _RTL_SPLAY_LINKS, 3 elements, 0x18 bytes
   +0x018 ListEntry        : struct _LIST_ENTRY, 2 elements, 0x10 bytes
   +0x018 Flink            : Ptr64 to struct _LIST_ENTRY, 2 elements, 0x10 bytes
   +0x020 Blink            : Ptr64 to struct _LIST_ENTRY, 2 elements, 0x10 bytes
   +0x028 PythonFunction   : [2008] UChar
0:000> dt -v Python!_PYTHON_FUNCTION_TABLE
struct _PYTHON_FUNCTION_TABLE, 13 elements, 0x48 bytes
   +0x000 GenericTable     : struct _RTL_GENERIC_TABLE, 9 elements, 0x48 bytes
   +0x000 TableRoot        : Ptr64 to struct _RTL_SPLAY_LINKS, 3 elements, 0x18 bytes
   +0x008 InsertOrderList  : struct _LIST_ENTRY, 2 elements, 0x10 bytes
   +0x008 InsertOrderFlink : Ptr64 to struct _LIST_ENTRY, 2 elements, 0x10 bytes
   +0x010 InsertOrderBlink : Ptr64 to struct _LIST_ENTRY, 2 elements, 0x10 bytes
   +0x018 OrderedPointer   : Ptr64 to struct _LIST_ENTRY, 2 elements, 0x10 bytes
   +0x020 WhichOrderedElement : Uint4B
   +0x024 NumberGenericTableElements : Uint4B
   +0x028 CompareRoutine   : Ptr64 to     _RTL_GENERIC_COMPARE_RESULTS 
   +0x030 AllocateRoutine  : Ptr64 to     void* 
   +0x038 FreeRoutine      : Ptr64 to     void 
   +0x040 TableContext     : Ptr64 to Void
   +0x040 Python           : Ptr64 to struct _PYTHON, 120 elements, 0xb20 bytes
0:000> dt -v Python!_PYTHON_MODULE_TABLE
struct _PYTHON_MODULE_TABLE, 4 elements, 0x10 bytes
   +0x000 PrefixTable      : struct _PREFIX_TABLE, 4 elements, 0x10 bytes
   +0x000 NodeTypeCode     : Int2B
   +0x002 NameLength       : Int2B
   +0x008 NextPrefixTree   : Ptr64 to struct _PYTHON_MODULE_TABLE_ENTRY, 17 elements, 0x80 bytes
0:000> dt -v Python!_PYTHON_MODULE_TABLE_ENTRY
struct _PYTHON_MODULE_TABLE_ENTRY, 17 elements, 0x80 bytes
   +0x000 PrefixTableEntry : struct _PREFIX_TABLE_ENTRY, 5 elements, 0x30 bytes
   +0x000 NodeTypeCode     : Int2B
   +0x002 PrefixNameLength : Int2B
   +0x004 Padding1         : Uint4B
   +0x008 NextPrefixTree   : Ptr64 to struct _PYTHON_MODULE_TABLE_ENTRY, 17 elements, 0x80 bytes
   +0x010 Links            : struct _RTL_SPLAY_LINKS, 3 elements, 0x18 bytes
   +0x010 Parent           : Ptr64 to struct _RTL_SPLAY_LINKS, 3 elements, 0x18 bytes
   +0x018 LeftChild        : Ptr64 to struct _RTL_SPLAY_LINKS, 3 elements, 0x18 bytes
   +0x020 RightChild       : Ptr64 to struct _RTL_SPLAY_LINKS, 3 elements, 0x18 bytes
   +0x028 Prefix           : Ptr64 to struct _STRING, 5 elements, 0x10 bytes
   +0x030 HashTableEntry   : struct _RTL_DYNAMIC_HASH_TABLE_ENTRY, 2 elements, 0x18 bytes
   +0x030 Linkage          : struct _LIST_ENTRY, 2 elements, 0x10 bytes
   +0x040 Signature        : Uint8B
   +0x048 ParentModuleEntry : Ptr64 to struct _PYTHON_MODULE_TABLE_ENTRY, 17 elements, 0x80 bytes
   +0x050 FunctionListHead : struct _LIST_ENTRY, 2 elements, 0x10 bytes
   +0x060 SubmoduleListHead : struct _LIST_ENTRY, 2 elements, 0x10 bytes
   +0x070 SubmoduleListEntry : struct _LIST_ENTRY, 2 elements, 0x10 bytes
0:000> dt -v Python!_PYTHONEXRUNTIME
struct _PYTHONEXRUNTIME, 10 elements, 0x710 bytes
   +0x000 HeapHandle       : Ptr64 to Void
   +0x008 ModuleTable      : Ptr64 to struct _PYTHON_MODULE_TABLE, 4 elements, 0x10 bytes
   +0x010 PathTable        : Ptr64 to struct _PYTHON_PATH_TABLE, 4 elements, 0x10 bytes
   +0x018 FunctionTable    : Ptr64 to struct _PYTHON_FUNCTION_TABLE, 13 elements, 0x48 bytes
   +0x020 FunctionTableCompareRoutine : Ptr64 to     _RTL_GENERIC_COMPARE_RESULTS 
   +0x028 FunctionTableAllocateRoutine : Ptr64 to     void* 
   +0x030 FunctionTableFreeRoutine : Ptr64 to     void 
   +0x038 ThreadpoolCallbackEnvironment : Ptr64 to struct _TP_CALLBACK_ENVIRON_V3, 10 elements, 0x48 bytes
   +0x040 CancellationThreadpoolCallbackEnvironment : Ptr64 to struct _TP_CALLBACK_ENVIRON_V3, 10 elements, 0x48 bytes
   +0x048 Allocators       : struct _PYTHON_ALLOCATORS, 14 elements, 0x6c8 bytes
0:000> dt -v Python!_PYTHON_PATH_TABLE_ENTRY_OFFSETS
struct _PYTHON_PATH_TABLE_ENTRY_OFFSETS, 36 elements, 0x48 bytes
   +0x000 Size             : Uint2B
   +0x002 NumberOfFields   : Uint2B
   +0x004 NodeTypeCodeOffset : Uint2B
   +0x006 PrefixNameLengthOffset : Uint2B
   +0x008 PathEntryTypeOffset : Uint2B
   +0x00a NextPrefixTreeOffset : Uint2B
   +0x00c LinksOffset      : Uint2B
   +0x00e LinksParentOffset : Uint2B
   +0x010 LinksLeftChildOffset : Uint2B
   +0x012 LinksRightChildOffset : Uint2B
   +0x014 PrefixOffset     : Uint2B
   +0x016 PathOffset       : Uint2B
   +0x018 PathLengthOffset : Uint2B
   +0x01a PathMaximumLengthOffset : Uint2B
   +0x01c PathAtomOffset   : Uint2B
   +0x01e PathBufferOffset : Uint2B
   +0x020 FullNameOffset   : Uint2B
   +0x022 FullNameLengthOffset : Uint2B
   +0x024 FullNameMaximumLengthOffset : Uint2B
   +0x026 FullNameAtomOffset : Uint2B
   +0x028 FullNameBufferOffset : Uint2B
   +0x02a ModuleNameOffset : Uint2B
   +0x02c ModuleNameLengthOffset : Uint2B
   +0x02e ModuleNameMaximumLengthOffset : Uint2B
   +0x030 ModuleNameAtomOffset : Uint2B
   +0x032 ModuleNameBufferOffset : Uint2B
   +0x034 NameOffset       : Uint2B
   +0x036 NameLengthOffset : Uint2B
   +0x038 NameMaximumLengthOffset : Uint2B
   +0x03a NameAtomOffset   : Uint2B
   +0x03c NameBufferOffset : Uint2B
   +0x03e ClassNameOffset  : Uint2B
   +0x040 ClassNameLengthOffset : Uint2B
   +0x042 ClassNameMaximumLengthOffset : Uint2B
   +0x044 ClassNameAtomOffset : Uint2B
   +0x046 ClassNameBufferOffset : Uint2B
0:000> dt -v Python!_PYTHON_FUNCTION_OFFSETS
struct _PYTHON_FUNCTION_OFFSETS, 7 elements, 0xe bytes
   +0x000 Size             : Uint2B
   +0x002 NumberOfFields   : Uint2B
   +0x004 PathEntryOffset  : Uint2B
   +0x006 ParentPathEntryOffset : Uint2B
   +0x008 KeyOffset        : Uint2B
   +0x00a CodeObjectOffset : Uint2B
   +0x00c PyCFunctionObjectOffset : Uint2B
0:000> dt -v Python!_PYTHONOBJECTOFFSETS
struct _PYTHONOBJECTOFFSETS, 2 elements, 0x10 bytes
   +0x000 PyCodeObjectOffsets : Ptr64 to struct _PYCODEOBJECTOFFSETS, 32 elements, 0x20 bytes
   +0x008 PyFrameObjectOffsets : Ptr64 to struct _PYFRAMEOBJECTOFFSETS, 16 elements, 0x10 bytes
0:000> dt -v Python!_PYTHONEX_OFFSETS
struct _PYTHONEX_OFFSETS, 2 elements, 0x10 bytes
   +0x000 PythonPathTableEntryOffsets : Ptr64 to struct _PYTHON_PATH_TABLE_ENTRY_OFFSETS, 36 elements, 0x48 bytes
   +0x008 PythonFunctionOffsets : Ptr64 to struct _PYTHON_FUNCTION_OFFSETS, 7 elements, 0xe bytes
0:000> dt -v Python!_PYTHONEXDATA
struct _PYTHONEXDATA, 2 elements, 0x4 bytes
   +0x000 IsDebug          : UChar
   +0x002 FilenameStringObjectOffsetFromCodeObject : Uint2B
0:000> dt -v Python!_PYTHON
struct _PYTHON, 120 elements, 0xb20 bytes
   +0x000 Size             : Uint4B
   +0x008 PythonModule     : Ptr64 to struct HINSTANCE__, 1 elements, 0x4 bytes
   +0x010 PythonExModule   : Ptr64 to struct HINSTANCE__, 1 elements, 0x4 bytes
   +0x018 Rtl              : Ptr64 to struct _RTL, 483 elements, 0x1020 bytes
   +0x020 RegisterNewPathEntry : Ptr64 to     int 
   +0x028 RegisterNewPathEntryContext : Ptr64 to Void
   +0x030 PythonFunctions  : struct _PYTHONFUNCTIONS, 54 elements, 0x1b0 bytes
   +0x030 PySys_SetArgvA   : Ptr64 to     void 
   +0x038 PySys_SetArgvW   : Ptr64 to     void 
   +0x040 PySys_SetArgvExA : Ptr64 to     void 
   +0x048 PySys_SetArgvExW : Ptr64 to     void 
   +0x050 Py_SetProgramNameA : Ptr64 to     void 
   +0x058 Py_SetProgramNameW : Ptr64 to     void 
   +0x060 Py_GetProgramNameA : Ptr64 to     char* 
   +0x068 Py_GetProgramNameW : Ptr64 to     wchar_t* 
   +0x070 Py_SetPythonHomeA : Ptr64 to     void 
   +0x078 Py_SetPythonHomeW : Ptr64 to     void 
   +0x080 Py_MainA         : Ptr64 to     long 
   +0x088 Py_MainW         : Ptr64 to     long 
   +0x090 Py_GetPrefixA    : Ptr64 to     char* 
   +0x098 Py_GetPrefixW    : Ptr64 to     wchar_t* 
   +0x0a0 Py_GetExecPrefixA : Ptr64 to     char* 
   +0x0a8 Py_GetExecPrefixW : Ptr64 to     wchar_t* 
   +0x0b0 Py_GetProgramFullPathA : Ptr64 to     char* 
   +0x0b8 Py_GetProgramFullPathW : Ptr64 to     wchar_t* 
   +0x0c0 Py_Initialize    : Ptr64 to     void 
   +0x0c8 Py_InitializeEx  : Ptr64 to     void 
   +0x0d0 Py_IsInitialized : Ptr64 to     int 
   +0x0d8 Py_Finalize      : Ptr64 to     void 
   +0x0e0 Py_GetVersion    : Ptr64 to     char* 
   +0x0e8 PyDict_GetItemString : Ptr64 to     _PYOBJECT* 
   +0x0f0 PyFrame_GetLineNumber : Ptr64 to     long 
   +0x0f8 PyCode_Addr2Line : Ptr64 to     long 
   +0x100 PyEval_SetProfile : Ptr64 to     long 
   +0x108 PyEval_SetTrace  : Ptr64 to     long 
   +0x110 PyUnicode_AsUnicode : Ptr64 to     wchar_t* 
   +0x118 PyUnicode_GetLength : Ptr64 to     int64 
   +0x120 Py_IncRef        : Ptr64 to     void 
   +0x128 Py_DecRef        : Ptr64 to     void 
   +0x130 PyGILState_Ensure : Ptr64 to     _PYGILSTATE 
   +0x138 PyGILState_Release : Ptr64 to     void 
   +0x140 PyObject_Hash    : Ptr64 to     long 
   +0x148 PyObject_Compare : Ptr64 to     int 
   +0x150 PyMem_Malloc     : Ptr64 to     void* 
   +0x158 PyMem_Realloc    : Ptr64 to     void* 
   +0x160 PyMem_Free       : Ptr64 to     void 
   +0x168 PyObject_Malloc  : Ptr64 to     void* 
   +0x170 PyObject_Realloc : Ptr64 to     void* 
   +0x178 PyObject_Free    : Ptr64 to     void 
   +0x180 PyGC_Collect     : Ptr64 to     int64 
   +0x188 _PyObject_GC_Malloc : Ptr64 to     _PYOBJECT* 
   +0x190 _PyObject_GC_New : Ptr64 to     _PYOBJECT* 
   +0x198 _PyObject_GC_NewVar : Ptr64 to     _PYVAROBJECT* 
   +0x1a0 _PyObject_GC_Resize : Ptr64 to     _PYVAROBJECT* 
   +0x1a8 PyObject_GC_Track : Ptr64 to     void 
   +0x1b0 PyObject_GC_UnTrack : Ptr64 to     void 
   +0x1b8 PyObject_GC_Del  : Ptr64 to     void 
   +0x1c0 PyObject_Init    : Ptr64 to     _PYOBJECT* 
   +0x1c8 PyObject_InitVar : Ptr64 to     _PYVAROBJECT* 
   +0x1d0 _PyObject_New    : Ptr64 to     _PYOBJECT* 
   +0x1d8 _PyObject_NewVar : Ptr64 to     _PYVAROBJECT* 
   +0x1e0 PythonData       : struct _PYTHONDATA, 16 elements, 0x80 bytes
   +0x1e0 _Py_NoneStruct   : struct _PYOBJECTEX, 17 elements, 0x8 bytes
   +0x1e8 _Py_TrueStruct   : struct _PYOBJECTEX, 17 elements, 0x8 bytes
   +0x1f0 _Py_FalseStruct  : struct _PYOBJECTEX, 17 elements, 0x8 bytes
   +0x1f8 _Py_ZeroStruct   : struct _PYOBJECTEX, 17 elements, 0x8 bytes
   +0x200 _Py_HashSecret   : struct _PY_HASH_SECRET, 2 elements, 0x8 bytes
   +0x208 PyString         : struct _PYTYPEOBJECTEX, 2 elements, 0x8 bytes
   +0x210 PyBytes          : struct _PYTYPEOBJECTEX, 2 elements, 0x8 bytes
   +0x218 PyCode           : struct _PYTYPEOBJECTEX, 2 elements, 0x8 bytes
   +0x220 PyDict           : struct _PYTYPEOBJECTEX, 2 elements, 0x8 bytes
   +0x228 PyTuple          : struct _PYTYPEOBJECTEX, 2 elements, 0x8 bytes
   +0x230 PyType           : struct _PYTYPEOBJECTEX, 2 elements, 0x8 bytes
   +0x238 PyFunction       : struct _PYTYPEOBJECTEX, 2 elements, 0x8 bytes
   +0x240 PyUnicode        : struct _PYTYPEOBJECTEX, 2 elements, 0x8 bytes
   +0x248 PyCFunction      : struct _PYTYPEOBJECTEX, 2 elements, 0x8 bytes
   +0x250 PyInstance       : struct _PYTYPEOBJECTEX, 2 elements, 0x8 bytes
   +0x258 PyModule         : struct _PYTYPEOBJECTEX, 2 elements, 0x8 bytes
   +0x260 PythonVersion    : struct _PYTHONVERSION, 4 elements, 0x10 bytes
   +0x260 VersionString    : Ptr64 to Char
   +0x268 MajorVersion     : Uint2B
   +0x26a MinorVersion     : Uint2B
   +0x26c PatchLevel       : Uint2B
   +0x270 PythonExFunctions : struct _PYTHONEXFUNCTIONS, 14 elements, 0x70 bytes
   +0x270 AllocateString   : Ptr64 to     int 
   +0x278 AllocateStringBuffer : Ptr64 to     int 
   +0x280 AllocateStringAndBuffer : Ptr64 to     int 
   +0x288 FreeString       : Ptr64 to     void 
   +0x290 FreeStringAndBuffer : Ptr64 to     void 
   +0x298 FreeStringBuffer : Ptr64 to     void 
   +0x2a0 FreeStringBufferDirect : Ptr64 to     void 
   +0x2a8 AllocateBuffer   : Ptr64 to     int 
   +0x2b0 FreeBuffer       : Ptr64 to     void 
   +0x2b8 RegisterFrame    : Ptr64 to     int 
   +0x2c0 SetPythonAllocators : Ptr64 to     int 
   +0x2c8 SetRegisterNewPathEntryCallback : Ptr64 to     int 
   +0x2d0 HashAndAtomizeAnsi : Ptr64 to     int 
   +0x2d8 InitializePythonRuntimeTables : Ptr64 to     int 
   +0x2e0 PythonExData     : struct _PYTHONEXDATA, 2 elements, 0x4 bytes
   +0x2e0 IsDebug          : UChar
   +0x2e2 FilenameStringObjectOffsetFromCodeObject : Uint2B
   +0x2e8 PythonObjectOffsets : struct _PYTHONOBJECTOFFSETS, 2 elements, 0x10 bytes
   +0x2e8 PyCodeObjectOffsets : Ptr64 to struct _PYCODEOBJECTOFFSETS, 32 elements, 0x20 bytes
   +0x2f0 PyFrameObjectOffsets : Ptr64 to struct _PYFRAMEOBJECTOFFSETS, 16 elements, 0x10 bytes
   +0x2f8 PythonExOffsets  : struct _PYTHONEX_OFFSETS, 2 elements, 0x10 bytes
   +0x2f8 PythonPathTableEntryOffsets : Ptr64 to struct _PYTHON_PATH_TABLE_ENTRY_OFFSETS, 36 elements, 0x48 bytes
   +0x300 PythonFunctionOffsets : Ptr64 to struct _PYTHON_FUNCTION_OFFSETS, 7 elements, 0xe bytes
   +0x308 PythonExRuntime  : struct _PYTHONEXRUNTIME, 10 elements, 0x710 bytes
   +0x308 HeapHandle       : Ptr64 to Void
   +0x310 ModuleTable      : Ptr64 to struct _PYTHON_MODULE_TABLE, 4 elements, 0x10 bytes
   +0x318 PathTable        : Ptr64 to struct _PYTHON_PATH_TABLE, 4 elements, 0x10 bytes
   +0x320 FunctionTable    : Ptr64 to struct _PYTHON_FUNCTION_TABLE, 13 elements, 0x48 bytes
   +0x328 FunctionTableCompareRoutine : Ptr64 to     _RTL_GENERIC_COMPARE_RESULTS 
   +0x330 FunctionTableAllocateRoutine : Ptr64 to     void* 
   +0x338 FunctionTableFreeRoutine : Ptr64 to     void 
   +0x340 ThreadpoolCallbackEnvironment : Ptr64 to struct _TP_CALLBACK_ENVIRON_V3, 10 elements, 0x48 bytes
   +0x348 CancellationThreadpoolCallbackEnvironment : Ptr64 to struct _TP_CALLBACK_ENVIRON_V3, 10 elements, 0x48 bytes
   +0x350 Allocators       : struct _PYTHON_ALLOCATORS, 14 elements, 0x6c8 bytes
   +0xa18 NumberOfCacheElements : Uint2B
   +0xa20 CodeObjectCache  : [32] Ptr64 to struct _PYOBJECT, 5 elements, 0x10 bytes
0:000> dt -v PythonTracer!_PYTHON_TRACE_EVENT1
*** WARNING: Unable to verify checksum for S:\Source\tracer\x64\Debug\PythonTracer.dll
struct _PYTHON_TRACE_EVENT1, 28 elements, 0x80 bytes
   +0x000 Timestamp        : union _LARGE_INTEGER, 4 elements, 0x8 bytes
   +0x008 Function         : Ptr64 to struct _PYTHON_FUNCTION, 23 elements, 0x7d0 bytes
   +0x010 WorkingSetSize   : Uint8B
   +0x018 PageFaultCount   : Uint8B
   +0x020 CommittedSize    : Uint8B
   +0x028 ReadTransferCount : Uint8B
   +0x030 WriteTransferCount : Uint8B
   +0x038 HandleCount      : Uint4B
   +0x03c ThreadId         : Uint4B
   +0x040 ElapsedMicroseconds : Uint4B
   +0x044 WorkingSetDelta  : Int4B
   +0x048 CommittedDelta   : Int4B
   +0x04c ReadTransferDelta : Uint4B
   +0x050 WriteTransferDelta : Uint4B
   +0x054 CodeObjectHash   : Uint4B
   +0x058 FunctionHash     : Uint4B
   +0x05c PathHash         : Uint4B
   +0x060 FullNameHash     : Uint4B
   +0x064 ModuleNameHash   : Uint4B
   +0x068 ClassNameHash    : Uint4B
   +0x06c NameHash         : Uint4B
   +0x070 EventTraitsEx    : union _PYTHON_EVENT_TRAITS_EX, 10 elements, 0x4 bytes
   +0x074 HandleDelta      : Int2B
   +0x076 PageFaultDelta   : Uint2B
   +0x078 LineNumber       : Uint2B
   +0x07a FirstLineNumber  : Uint2B
   +0x07c NumberOfLines    : Uint2B
   +0x07e NumberOfCodeLines : Uint2B
0:000> dt -v PythonTracer!_PYTHON_TRACE_EVENT2
struct _PYTHON_TRACE_EVENT2, 1 elements, 0x8 bytes
   +0x000 Function         : Ptr64 to struct _PYTHON_FUNCTION, 23 elements, 0x7d0 bytes
0:000> dt -v PythonTracer!_PYTHON_CALL_STACK_ENTRY
struct _PYTHON_CALL_STACK_ENTRY, 8 elements, 0x100 bytes
   +0x000 CallStackListEntry : struct _LIST_ENTRY, 2 elements, 0x10 bytes
   +0x010 FunctionListEntry : struct _LIST_ENTRY, 2 elements, 0x10 bytes
   +0x020 Function         : Ptr64 to struct _PYTHON_FUNCTION, 23 elements, 0x7d0 bytes
   +0x028 EnterTimestamp   : union _LARGE_INTEGER, 4 elements, 0x8 bytes
   +0x030 ReturnTimestamp  : union _LARGE_INTEGER, 4 elements, 0x8 bytes
   +0x038 Padding1         : Uint8B
   +0x040 Padding2         : [8] Uint8B
   +0x080 Padding3         : [16] Uint8B
0:000> dt -v PythonTracer!_PYTHON_TRACER_RUNTIME_PARAMETERS
struct _PYTHON_TRACER_RUNTIME_PARAMETERS, 2 elements, 0x8 bytes
   +0x000 TraceEventType   : Uint4B
   +0x004 CallbackWorkerType : Uint4B
0:000> dt -v PythonTracer!_EVENT_TYPE
struct _EVENT_TYPE, 6 elements, 0x8 bytes
   +0x000 EventType        : Uint4B
   +0x004 IsCall           : Bitfield Pos 0, 1 Bit
   +0x004 IsReturn         : Bitfield Pos 1, 1 Bit
   +0x004 IsLine           : Bitfield Pos 2, 1 Bit
   +0x004 IsException      : Bitfield Pos 3, 1 Bit
   +0x004 IsC              : Bitfield Pos 4, 1 Bit
0:000> dt -v PythonTracer!_PYTHON_TRACE_CONTEXT
struct _PYTHON_TRACE_CONTEXT, 63 elements, 0x320 bytes
   +0x000 Size             : Uint4B
   +0x004 Flags            : union _PYTHON_TRACE_CONTEXT_FLAGS, 13 elements, 0x4 bytes
   +0x008 RuntimeParameters : struct _PYTHON_TRACER_RUNTIME_PARAMETERS, 2 elements, 0x8 bytes
   +0x010 RuntimeState     : union _PYTHON_TRACER_RUNTIME_STATE, 5 elements, 0x4 bytes
   +0x018 Rtl              : Ptr64 to struct _RTL, 483 elements, 0x1020 bytes
   +0x020 Python           : Ptr64 to struct _PYTHON, 120 elements, 0xb20 bytes
   +0x028 TraceContext     : Ptr64 to struct _TRACE_CONTEXT, 73 elements, 0x520 bytes
   +0x030 CallbackWorker   : Ptr64 to     int 
   +0x038 TraceEventFunction : Ptr64 to     int 
   +0x040 UserData         : Ptr64 to Void
   +0x048 Allocator        : Ptr64 to struct _ALLOCATOR, 28 elements, 0x90 bytes
   +0x050 SystemTime       : struct _SYSTEMTIME, 8 elements, 0x10 bytes
   +0x060 RunHistoryRegistryKey : Ptr64 to struct HKEY__, 1 elements, 0x4 bytes
   +0x068 Depth            : Uint8B
   +0x070 MaxDepth         : union _ULARGE_INTEGER, 4 elements, 0x8 bytes
   +0x078 FramesTraced     : Uint8B
   +0x080 FramesSkipped    : Uint8B
   +0x088 Counters         : [7] Uint8B
   +0x088 NumberOfPythonCalls : Uint8B
   +0x090 NumberOfPythonExceptions : Uint8B
   +0x098 NumberOfPythonLines : Uint8B
   +0x0a0 NumberOfPythonReturns : Uint8B
   +0x0a8 NumberOfCCalls   : Uint8B
   +0x0b0 NumberOfCExceptions : Uint8B
   +0x0b8 NumberOfCReturns : Uint8B
   +0x0c0 SkipFrames       : Uint4B
   +0x0c4 LastError        : Uint4B
   +0x0c8 EventType        : Enum _PYTHON_TRACE_EVENT_TYPE,  6 total enums

   +0x0d0 Frequency        : union _LARGE_INTEGER, 4 elements, 0x8 bytes
   +0x0d8 Multiplicand     : union _LARGE_INTEGER, 4 elements, 0x8 bytes
   +0x0e0 StartTimestamp   : union _LARGE_INTEGER, 4 elements, 0x8 bytes
   +0x0e8 StopTimestamp    : union _LARGE_INTEGER, 4 elements, 0x8 bytes
   +0x0f0 LastTimestamp    : union _LARGE_INTEGER, 4 elements, 0x8 bytes
   +0x0f8 ThisTimestamp    : union _LARGE_INTEGER, 4 elements, 0x8 bytes
   +0x100 MaxNoneRefCount  : union _LARGE_INTEGER, 4 elements, 0x8 bytes
   +0x108 MaxTrueRefCount  : union _LARGE_INTEGER, 4 elements, 0x8 bytes
   +0x110 MaxZeroRefCount  : union _LARGE_INTEGER, 4 elements, 0x8 bytes
   +0x118 MaxFalseRefCount : union _LARGE_INTEGER, 4 elements, 0x8 bytes
   +0x120 ModuleFilterStringTable : Ptr64 to struct _STRING_TABLE, 16 elements, 0x200 bytes
   +0x128 ModuleFilterPrefixTree : struct _PREFIX_TABLE, 4 elements, 0x10 bytes
   +0x138 Start            : Ptr64 to     int 
   +0x140 Stop             : Ptr64 to     int 
   +0x148 EnableMemoryTracing : Ptr64 to     void 
   +0x150 DisableMemoryTracing : Ptr64 to     void 
   +0x158 EnableIoCountersTracing : Ptr64 to     void 
   +0x160 DisableIoCountersTracing : Ptr64 to     void 
   +0x168 EnableHandleCountTracing : Ptr64 to     void 
   +0x170 DisableHandleCountTracing : Ptr64 to     void 
   +0x178 AddModuleName    : Ptr64 to     int 
   +0x180 SetModuleNamesStringTable : Ptr64 to     int 
   +0x188 SetSystemTimeForRunHistory : Ptr64 to     int 
   +0x190 SaveMaxCountsAtExitEntry : Ptr64 to struct _RTL_ATEXIT_ENTRY, 0 elements, 0x0 bytes
   +0x198 SaveCountsToRunHistoryAtExitEntry : Ptr64 to struct _RTL_ATEXIT_ENTRY, 0 elements, 0x0 bytes
   +0x1a0 SavePerformanceMetricsAtExitEntry : Ptr64 to struct _RTL_ATEXIT_ENTRY, 0 elements, 0x0 bytes
   +0x1a8 BitmapAllocator  : struct _ALLOCATOR, 28 elements, 0x90 bytes
   +0x238 UnicodeStringBufferAllocator : struct _ALLOCATOR, 28 elements, 0x90 bytes
   +0x2c8 ThreadpoolCallbackEnvironment : Ptr64 to struct _TP_CALLBACK_ENVIRON_V3, 10 elements, 0x48 bytes
   +0x2d0 CancellationThreadpoolCallbackEnvironment : Ptr64 to struct _TP_CALLBACK_ENVIRON_V3, 10 elements, 0x48 bytes
   +0x2d8 CallStackListHead : struct _LIST_ENTRY, 2 elements, 0x10 bytes
   +0x2f0 NewPythonPathTableEntryListHead : union _SLIST_HEADER, 3 elements, 0x10 bytes
   +0x300 NewPythonPathTableEntryWork : Ptr64 to struct _TP_WORK, 0 elements, 0x0 bytes
   +0x308 ActiveNewPythonPathTableEntryCallbacks : Uint4B
   +0x310 ThreadpoolCleanupGroup : Ptr64 to struct _TP_CLEANUP_GROUP, 0 elements, 0x0 bytes
0:000> dt -v PythonTracerInjection!_PYTHON_TRACER_INJECTION_BREAKPOINT
*** WARNING: Unable to verify checksum for S:\Source\tracer\x64\Debug\PythonTracerInjection.dll
struct _PYTHON_TRACER_INJECTION_BREAKPOINT, 1 elements, 0x88 bytes
   +0x000 InjectionBreakpoint : struct _TRACER_INJECTION_BREAKPOINT, 22 elements, 0x88 bytes
0:000> dt -v PythonTracerInjection!_PYTHON_TRACER_INJECTION_CONTEXT
struct _PYTHON_TRACER_INJECTION_CONTEXT, 7 elements, 0x900 bytes
   +0x000 InjectionContext : struct _TRACER_INJECTION_CONTEXT, 15 elements, 0x60 bytes
   +0x060 InitialBreakpoints : union _PYTHON_TRACER_INJECTION_INITIAL_BREAKPOINTS, 17 elements, 0x880 bytes
   +0x8e0 PythonThreadHandle : Ptr64 to Void
   +0x8e8 PythonThreadId   : Uint4B
   +0x8ec PythonThreadExitCode : Uint4B
   +0x8f0 RemotePythonProcessHandle : Ptr64 to Void
   +0x8f8 PythonDllModule  : Ptr64 to struct HINSTANCE__, 1 elements, 0x4 bytes
0:000> dt -v PythonTracerInjection!_PYTHON_TRACER_INJECTED_CONTEXT
struct _PYTHON_TRACER_INJECTED_CONTEXT, 5 elements, 0x20 bytes
   +0x000 OutputDebugStringA : Ptr64 to     void 
   +0x008 ParentProcessId  : Uint4B
   +0x00c ParentThreadId   : Uint4B
   +0x010 SuspendedMainThreadId : Uint4B
   +0x018 PythonDllModule  : Ptr64 to struct HINSTANCE__, 1 elements, 0x4 bytes
0:000> dt -v Rtl!_ATEXITEX_FLAGS
*** WARNING: Unable to verify checksum for S:\Source\tracer\x64\Debug\Rtl.dll
struct _ATEXITEX_FLAGS, 1 elements, 0x4 bytes
   +0x000 SuppressExceptions : Bitfield Pos 0, 1 Bit
0:000> dt -v Rtl!_CU_DEVICE_ATTRIBUTES
struct _CU_DEVICE_ATTRIBUTES, 91 elements, 0x16c bytes
   +0x000 MaxThreadsPerBlock : Uint4B
   +0x004 MaxBlockDimX     : Uint4B
   +0x008 MaxBlockDimY     : Uint4B
   +0x00c MaxBlockDimZ     : Uint4B
   +0x010 MaxGridDimX      : Uint4B
   +0x014 MaxGridDimY      : Uint4B
   +0x018 MaxGridDimZ      : Uint4B
   +0x01c MaxSharedMemoryPerBlock : Uint4B
   +0x020 TotalConstantMemory : Uint4B
   +0x024 WarpSize         : Uint4B
   +0x028 MaxPitch         : Uint4B
   +0x02c MaxRegistersPerBlock : Uint4B
   +0x030 ClockRate        : Uint4B
   +0x034 TextureAlignment : Uint4B
   +0x038 GpuOverlap       : Uint4B
   +0x03c MultiprocessorCount : Uint4B
   +0x040 KernelExecTimeout : Uint4B
   +0x044 Integrated       : Uint4B
   +0x048 CanMapHostMemory : Uint4B
   +0x04c ComputeMode      : Uint4B
   +0x050 MaximumTexture1DWidth : Uint4B
   +0x054 MaximumTexture2DWidth : Uint4B
   +0x058 MaximumTexture2DHeight : Uint4B
   +0x05c MaximumTexture3DWidth : Uint4B
   +0x060 MaximumTexture3DHeight : Uint4B
   +0x064 MaximumTexture3DDepth : Uint4B
   +0x068 MaximumTexture2DArrayWidth : Uint4B
   +0x06c MaximumTexture2DArrayHeight : Uint4B
   +0x070 MaximumTexture2DArrayNumslices : Uint4B
   +0x074 SurfaceAlignment : Uint4B
   +0x078 ConcurrentKernels : Uint4B
   +0x07c EccEnabled       : Uint4B
   +0x080 PciBusId         : Uint4B
   +0x084 PciDeviceId      : Uint4B
   +0x088 TccDriver        : Uint4B
   +0x08c MemoryClockRate  : Uint4B
   +0x090 GlobalMemoryBusWidth : Uint4B
   +0x094 L2CacheSize      : Uint4B
   +0x098 MaxThreadsPerMultiprocessor : Uint4B
   +0x09c AsyncEngineCount : Uint4B
   +0x0a0 UnifiedAddressing : Uint4B
   +0x0a4 MaximumTexture1DLayeredWidth : Uint4B
   +0x0a8 MaximumTexture1DLayeredLayers : Uint4B
   +0x0ac CanTex2DGather   : Uint4B
   +0x0b0 MaximumTexture2DGatherWidth : Uint4B
   +0x0b4 MaximumTexture2DGatherHeight : Uint4B
   +0x0b8 MaximumTexture3DWidthAlternate : Uint4B
   +0x0bc MaximumTexture3DHeightAlternate : Uint4B
   +0x0c0 MaximumTexture3DDepthAlternate : Uint4B
   +0x0c4 PciDomainId      : Uint4B
   +0x0c8 TexturePitchAlignment : Uint4B
   +0x0cc MaximumTexturecubemapWidth : Uint4B
   +0x0d0 MaximumTexturecubemapLayeredWidth : Uint4B
   +0x0d4 MaximumTexturecubemapLayeredLayers : Uint4B
   +0x0d8 MaximumSurface1DWidth : Uint4B
   +0x0dc MaximumSurface2DWidth : Uint4B
   +0x0e0 MaximumSurface2DHeight : Uint4B
   +0x0e4 MaximumSurface3DWidth : Uint4B
   +0x0e8 MaximumSurface3DHeight : Uint4B
   +0x0ec MaximumSurface3DDepth : Uint4B
   +0x0f0 MaximumSurface1DLayeredWidth : Uint4B
   +0x0f4 MaximumSurface1DLayeredLayers : Uint4B
   +0x0f8 MaximumSurface2DLayeredWidth : Uint4B
   +0x0fc MaximumSurface2DLayeredHeight : Uint4B
   +0x100 MaximumSurface2DLayeredLayers : Uint4B
   +0x104 MaximumSurfacecubemapWidth : Uint4B
   +0x108 MaximumSurfacecubemapLayeredWidth : Uint4B
   +0x10c MaximumSurfacecubemapLayeredLayers : Uint4B
   +0x110 MaximumTexture1DLinearWidth : Uint4B
   +0x114 MaximumTexture2DLinearWidth : Uint4B
   +0x118 MaximumTexture2DLinearHeight : Uint4B
   +0x11c MaximumTexture2DLinearPitch : Uint4B
   +0x120 MaximumTexture2DMipmappedWidth : Uint4B
   +0x124 MaximumTexture2DMipmappedHeight : Uint4B
   +0x128 ComputeCapabilityMajor : Uint4B
   +0x12c ComputeCapabilityMinor : Uint4B
   +0x130 MaximumTexture1DMipmappedWidth : Uint4B
   +0x134 StreamPrioritiesSupported : Uint4B
   +0x138 GlobalL1CacheSupported : Uint4B
   +0x13c LocalL1CacheSupported : Uint4B
   +0x140 MaxSharedMemoryPerMultiprocessor : Uint4B
   +0x144 MaxRegistersPerMultiprocessor : Uint4B
   +0x148 ManagedMemory    : Uint4B
   +0x14c MultiGpuBoard    : Uint4B
   +0x150 MultiGpuBoardGroupId : Uint4B
   +0x154 HostNativeAtomicSupported : Uint4B
   +0x158 SingleToDoublePrecisionPerfRatio : Uint4B
   +0x15c PageableMemoryAccess : Uint4B
   +0x160 ConcurrentManagedAccess : Uint4B
   +0x164 ComputePreemptionSupported : Uint4B
   +0x168 CanUseHostPointerForRegisteredMem : Uint4B
0:000> dt -v Rtl!_CU_FUNCTIONS
struct _CU_FUNCTIONS, 53 elements, 0x1a8 bytes
   +0x000 Init             : Ptr64 to     _CU_RESULT 
   +0x008 GetErrorName     : Ptr64 to     _CU_RESULT 
   +0x010 GetErrorString   : Ptr64 to     _CU_RESULT 
   +0x018 DeviceGet        : Ptr64 to     _CU_RESULT 
   +0x020 DeviceGetCount   : Ptr64 to     _CU_RESULT 
   +0x028 DeviceGetName    : Ptr64 to     _CU_RESULT 
   +0x030 DeviceGetTotalMem : Ptr64 to     _CU_RESULT 
   +0x038 DeviceComputeCapability : Ptr64 to     _CU_RESULT 
   +0x040 DeviceGetAttribute : Ptr64 to     _CU_RESULT 
   +0x048 CtxCreate        : Ptr64 to     _CU_RESULT 
   +0x050 CtxDestroy       : Ptr64 to     _CU_RESULT 
   +0x058 CtxPushCurrent   : Ptr64 to     _CU_RESULT 
   +0x060 CtxPopCurrent    : Ptr64 to     _CU_RESULT 
   +0x068 CtxSetCurrent    : Ptr64 to     _CU_RESULT 
   +0x070 CtxGetCurrent    : Ptr64 to     _CU_RESULT 
   +0x078 CtxGetDevice     : Ptr64 to     _CU_RESULT 
   +0x080 CtxSynchronize   : Ptr64 to     _CU_RESULT 
   +0x088 CtxGetStreamPriorityRange : Ptr64 to     _CU_RESULT 
   +0x090 ModuleLoad       : Ptr64 to     _CU_RESULT 
   +0x098 ModuleUnload     : Ptr64 to     _CU_RESULT 
   +0x0a0 ModuleLoadDataEx : Ptr64 to     _CU_RESULT 
   +0x0a8 ModuleGetFunction : Ptr64 to     _CU_RESULT 
   +0x0b0 ModuleGetGlobal  : Ptr64 to     _CU_RESULT 
   +0x0b8 StreamCreate     : Ptr64 to     _CU_RESULT 
   +0x0c0 StreamCreateWithPriority : Ptr64 to     _CU_RESULT 
   +0x0c8 StreamDestroy    : Ptr64 to     _CU_RESULT 
   +0x0d0 StreamQuery      : Ptr64 to     _CU_RESULT 
   +0x0d8 StreamSynchronize : Ptr64 to     _CU_RESULT 
   +0x0e0 StreamAddCallback : Ptr64 to     _CU_RESULT 
   +0x0e8 StreamAttachMemAsync : Ptr64 to     _CU_RESULT 
   +0x0f0 StreamWaitEvent  : Ptr64 to     _CU_RESULT 
   +0x0f8 StreamWaitValue32 : Ptr64 to     _CU_RESULT 
   +0x100 StreamWriteValue32 : Ptr64 to     _CU_RESULT 
   +0x108 StreamBatchMemOp : Ptr64 to     _CU_RESULT 
   +0x110 EventCreate      : Ptr64 to     _CU_RESULT 
   +0x118 EventDestroy     : Ptr64 to     _CU_RESULT 
   +0x120 EventElapsedTime : Ptr64 to     _CU_RESULT 
   +0x128 EventQuery       : Ptr64 to     _CU_RESULT 
   +0x130 EventRecord      : Ptr64 to     _CU_RESULT 
   +0x138 EventSynchronize : Ptr64 to     _CU_RESULT 
   +0x140 MemAlloc         : Ptr64 to     _CU_RESULT 
   +0x148 MemFree          : Ptr64 to     _CU_RESULT 
   +0x150 MemHostAlloc     : Ptr64 to     _CU_RESULT 
   +0x158 MemPrefetchAsync : Ptr64 to     _CU_RESULT 
   +0x160 MemHostGetDevicePointer : Ptr64 to     _CU_RESULT 
   +0x168 MemHostRegister  : Ptr64 to     _CU_RESULT 
   +0x170 MemHostUnregister : Ptr64 to     _CU_RESULT 
   +0x178 MemFreeHost      : Ptr64 to     _CU_RESULT 
   +0x180 MemcpyHtoD       : Ptr64 to     _CU_RESULT 
   +0x188 MemcpyDtoH       : Ptr64 to     _CU_RESULT 
   +0x190 MemcpyHtoDAsync  : Ptr64 to     _CU_RESULT 
   +0x198 MemcpyDtoHAsync  : Ptr64 to     _CU_RESULT 
   +0x1a0 LaunchKernel     : Ptr64 to     _CU_RESULT 
0:000> dt -v Rtl!_CU
struct _CU, 58 elements, 0x1b8 bytes
   +0x000 SizeOfStruct     : Uint4B
   +0x004 Flags            : union _CU_FLAGS, 3 elements, 0x4 bytes
   +0x008 NumberOfFunctions : Uint4B
   +0x00c Unused           : Uint4B
   +0x010 Functions        : struct _CU_FUNCTIONS, 53 elements, 0x1a8 bytes
   +0x010 Init             : Ptr64 to     _CU_RESULT 
   +0x018 GetErrorName     : Ptr64 to     _CU_RESULT 
   +0x020 GetErrorString   : Ptr64 to     _CU_RESULT 
   +0x028 DeviceGet        : Ptr64 to     _CU_RESULT 
   +0x030 DeviceGetCount   : Ptr64 to     _CU_RESULT 
   +0x038 DeviceGetName    : Ptr64 to     _CU_RESULT 
   +0x040 DeviceGetTotalMem : Ptr64 to     _CU_RESULT 
   +0x048 DeviceComputeCapability : Ptr64 to     _CU_RESULT 
   +0x050 DeviceGetAttribute : Ptr64 to     _CU_RESULT 
   +0x058 CtxCreate        : Ptr64 to     _CU_RESULT 
   +0x060 CtxDestroy       : Ptr64 to     _CU_RESULT 
   +0x068 CtxPushCurrent   : Ptr64 to     _CU_RESULT 
   +0x070 CtxPopCurrent    : Ptr64 to     _CU_RESULT 
   +0x078 CtxSetCurrent    : Ptr64 to     _CU_RESULT 
   +0x080 CtxGetCurrent    : Ptr64 to     _CU_RESULT 
   +0x088 CtxGetDevice     : Ptr64 to     _CU_RESULT 
   +0x090 CtxSynchronize   : Ptr64 to     _CU_RESULT 
   +0x098 CtxGetStreamPriorityRange : Ptr64 to     _CU_RESULT 
   +0x0a0 ModuleLoad       : Ptr64 to     _CU_RESULT 
   +0x0a8 ModuleUnload     : Ptr64 to     _CU_RESULT 
   +0x0b0 ModuleLoadDataEx : Ptr64 to     _CU_RESULT 
   +0x0b8 ModuleGetFunction : Ptr64 to     _CU_RESULT 
   +0x0c0 ModuleGetGlobal  : Ptr64 to     _CU_RESULT 
   +0x0c8 StreamCreate     : Ptr64 to     _CU_RESULT 
   +0x0d0 StreamCreateWithPriority : Ptr64 to     _CU_RESULT 
   +0x0d8 StreamDestroy    : Ptr64 to     _CU_RESULT 
   +0x0e0 StreamQuery      : Ptr64 to     _CU_RESULT 
   +0x0e8 StreamSynchronize : Ptr64 to     _CU_RESULT 
   +0x0f0 StreamAddCallback : Ptr64 to     _CU_RESULT 
   +0x0f8 StreamAttachMemAsync : Ptr64 to     _CU_RESULT 
   +0x100 StreamWaitEvent  : Ptr64 to     _CU_RESULT 
   +0x108 StreamWaitValue32 : Ptr64 to     _CU_RESULT 
   +0x110 StreamWriteValue32 : Ptr64 to     _CU_RESULT 
   +0x118 StreamBatchMemOp : Ptr64 to     _CU_RESULT 
   +0x120 EventCreate      : Ptr64 to     _CU_RESULT 
   +0x128 EventDestroy     : Ptr64 to     _CU_RESULT 
   +0x130 EventElapsedTime : Ptr64 to     _CU_RESULT 
   +0x138 EventQuery       : Ptr64 to     _CU_RESULT 
   +0x140 EventRecord      : Ptr64 to     _CU_RESULT 
   +0x148 EventSynchronize : Ptr64 to     _CU_RESULT 
   +0x150 MemAlloc         : Ptr64 to     _CU_RESULT 
   +0x158 MemFree          : Ptr64 to     _CU_RESULT 
   +0x160 MemHostAlloc     : Ptr64 to     _CU_RESULT 
   +0x168 MemPrefetchAsync : Ptr64 to     _CU_RESULT 
   +0x170 MemHostGetDevicePointer : Ptr64 to     _CU_RESULT 
   +0x178 MemHostRegister  : Ptr64 to     _CU_RESULT 
   +0x180 MemHostUnregister : Ptr64 to     _CU_RESULT 
   +0x188 MemFreeHost      : Ptr64 to     _CU_RESULT 
   +0x190 MemcpyHtoD       : Ptr64 to     _CU_RESULT 
   +0x198 MemcpyDtoH       : Ptr64 to     _CU_RESULT 
   +0x1a0 MemcpyHtoDAsync  : Ptr64 to     _CU_RESULT 
   +0x1a8 MemcpyDtoHAsync  : Ptr64 to     _CU_RESULT 
   +0x1b0 LaunchKernel     : Ptr64 to     _CU_RESULT 
0:000> dt -v Rtl!_DBGHELP_FUNCTIONSX
struct _DBGHELP_FUNCTIONSX, 175 elements, 0x578 bytes
   +0x000 EnumDirTree      : Ptr64 to     int 
   +0x008 EnumDirTreeW     : Ptr64 to     int 
   +0x010 EnumerateLoadedModules64 : Ptr64 to     int 
   +0x018 EnumerateLoadedModules : Ptr64 to     int 
   +0x020 EnumerateLoadedModulesEx : Ptr64 to     int 
   +0x028 EnumerateLoadedModulesExW : Ptr64 to     int 
   +0x030 EnumerateLoadedModulesW64 : Ptr64 to     int 
   +0x038 FindFileInPath   : Ptr64 to     int 
   +0x040 FindFileInSearchPath : Ptr64 to     int 
   +0x048 GetSymLoadError  : Ptr64 to     unsigned long 
   +0x050 GetTimestampForLoadedLibrary : Ptr64 to     unsigned long 
   +0x058 MakeSureDirectoryPathExists : Ptr64 to     int 
   +0x060 RangeMapAddPeImageSections : Ptr64 to     int 
   +0x068 RangeMapRead     : Ptr64 to     int 
   +0x070 RangeMapRemove   : Ptr64 to     int 
   +0x078 RangeMapWrite    : Ptr64 to     int 
   +0x080 ReportSymbolLoadSummary : Ptr64 to     int 
   +0x088 SearchTreeForFile : Ptr64 to     int 
   +0x090 SearchTreeForFileW : Ptr64 to     int 
   +0x098 StackWalk64      : Ptr64 to     int 
   +0x0a0 StackWalkEx      : Ptr64 to     int 
   +0x0a8 StackWalk        : Ptr64 to     int 
   +0x0b0 SymAddrIncludeInlineTrace : Ptr64 to     unsigned long 
   +0x0b8 SymAddSourceStreamA : Ptr64 to     int 
   +0x0c0 SymAddSourceStream : Ptr64 to     int 
   +0x0c8 SymAddSourceStreamW : Ptr64 to     int 
   +0x0d0 SymAddSymbol     : Ptr64 to     int 
   +0x0d8 SymAddSymbolW    : Ptr64 to     int 
   +0x0e0 SymCleanup       : Ptr64 to     int 
   +0x0e8 SymCompareInlineTrace : Ptr64 to     unsigned long 
   +0x0f0 SymDeleteSymbol  : Ptr64 to     int 
   +0x0f8 SymDeleteSymbolW : Ptr64 to     int 
   +0x100 SymEnumerateModules64 : Ptr64 to     int 
   +0x108 SymEnumerateModules : Ptr64 to     int 
   +0x110 SymEnumerateModulesW64 : Ptr64 to     int 
   +0x118 SymEnumerateSymbols64 : Ptr64 to     int 
   +0x120 SymEnumerateSymbols : Ptr64 to     int 
   +0x128 SymEnumerateSymbolsW64 : Ptr64 to     int 
   +0x130 SymEnumerateSymbolsW : Ptr64 to     int 
   +0x138 SymEnumLines     : Ptr64 to     int 
   +0x140 SymEnumLinesW    : Ptr64 to     int 
   +0x148 SymEnumProcesses : Ptr64 to     int 
   +0x150 SymEnumSourceFiles : Ptr64 to     int 
   +0x158 SymEnumSourceFilesW : Ptr64 to     int 
   +0x160 SymEnumSourceFileTokens : Ptr64 to     int 
   +0x168 SymEnumSourceLines : Ptr64 to     int 
   +0x170 SymEnumSourceLinesW : Ptr64 to     int 
   +0x178 SymEnumSymbolsEx : Ptr64 to     int 
   +0x180 SymEnumSymbolsExW : Ptr64 to     int 
   +0x188 SymEnumSymbolsForAddr : Ptr64 to     int 
   +0x190 SymEnumSymbolsForAddrW : Ptr64 to     int 
   +0x198 SymEnumSymbols   : Ptr64 to     int 
   +0x1a0 SymEnumSymbolsW  : Ptr64 to     int 
   +0x1a8 SymEnumSym       : Ptr64 to     int 
   +0x1b0 SymEnumTypesByName : Ptr64 to     int 
   +0x1b8 SymEnumTypesByNameW : Ptr64 to     int 
   +0x1c0 SymEnumTypes     : Ptr64 to     int 
   +0x1c8 SymEnumTypesW    : Ptr64 to     int 
   +0x1d0 SymFindFileInPath : Ptr64 to     int 
   +0x1d8 SymFindFileInPathW : Ptr64 to     int 
   +0x1e0 SymFromAddr      : Ptr64 to     int 
   +0x1e8 SymFromAddrW     : Ptr64 to     int 
   +0x1f0 SymFromIndex     : Ptr64 to     int 
   +0x1f8 SymFromIndexW    : Ptr64 to     int 
   +0x200 SymFromInlineContext : Ptr64 to     int 
   +0x208 SymFromInlineContextW : Ptr64 to     int 
   +0x210 SymFromName      : Ptr64 to     int 
   +0x218 SymFromNameW     : Ptr64 to     int 
   +0x220 SymFromToken     : Ptr64 to     int 
   +0x228 SymFromTokenW    : Ptr64 to     int 
   +0x230 SymGetFileLineOffsets64 : Ptr64 to     unsigned long 
   +0x238 SymGetLineFromAddr64 : Ptr64 to     int 
   +0x240 SymGetLineFromAddr : Ptr64 to     int 
   +0x248 SymGetLineFromAddrW64 : Ptr64 to     int 
   +0x250 SymGetLineFromAddrW : Ptr64 to     int 
   +0x258 SymGetLineFromInlineContext : Ptr64 to     int 
   +0x260 SymGetLineFromInlineContextW : Ptr64 to     int 
   +0x268 SymGetLineFromName64 : Ptr64 to     int 
   +0x270 SymGetLineFromName : Ptr64 to     int 
   +0x278 SymGetLineFromNameW64 : Ptr64 to     int 
   +0x280 SymGetLineNext64 : Ptr64 to     int 
   +0x288 SymGetLineNext   : Ptr64 to     int 
   +0x290 SymGetLineNextW64 : Ptr64 to     int 
   +0x298 SymGetLineNextW  : Ptr64 to     int 
   +0x2a0 SymGetLinePrev64 : Ptr64 to     int 
   +0x2a8 SymGetLinePrev   : Ptr64 to     int 
   +0x2b0 SymGetLinePrevW64 : Ptr64 to     int 
   +0x2b8 SymGetLinePrevW  : Ptr64 to     int 
   +0x2c0 SymGetModuleBase : Ptr64 to     unsigned long 
   +0x2c8 SymGetModuleInfo64 : Ptr64 to     int 
   +0x2d0 SymGetModuleInfo : Ptr64 to     int 
   +0x2d8 SymGetModuleInfoW64 : Ptr64 to     int 
   +0x2e0 SymGetModuleInfoW : Ptr64 to     int 
   +0x2e8 SymGetOmaps      : Ptr64 to     int 
   +0x2f0 SymGetOptions    : Ptr64 to     unsigned long 
   +0x2f8 SymGetScope      : Ptr64 to     int 
   +0x300 SymGetScopeW     : Ptr64 to     int 
   +0x308 SymGetSearchPath : Ptr64 to     int 
   +0x310 SymGetSearchPathW : Ptr64 to     int 
   +0x318 SymGetSourceFileFromToken : Ptr64 to     int 
   +0x320 SymGetSourceFileFromTokenW : Ptr64 to     int 
   +0x328 SymGetSourceFile : Ptr64 to     int 
   +0x330 SymGetSourceFileToken : Ptr64 to     int 
   +0x338 SymGetSourceFileTokenW : Ptr64 to     int 
   +0x340 SymGetSourceFileW : Ptr64 to     int 
   +0x348 SymGetSourceVarFromToken : Ptr64 to     int 
   +0x350 SymGetSourceVarFromTokenW : Ptr64 to     int 
   +0x358 SymGetSymbolFile : Ptr64 to     int 
   +0x360 SymGetSymbolFileW : Ptr64 to     int 
   +0x368 SymGetSymFromAddr64 : Ptr64 to     int 
   +0x370 SymGetSymFromAddr : Ptr64 to     int 
   +0x378 SymGetSymFromName64 : Ptr64 to     int 
   +0x380 SymGetSymFromName : Ptr64 to     int 
   +0x388 SymGetSymNext64  : Ptr64 to     int 
   +0x390 SymGetSymNext    : Ptr64 to     int 
   +0x398 SymGetSymNextW64 : Ptr64 to     int 
   +0x3a0 SymGetSymNextW   : Ptr64 to     int 
   +0x3a8 SymGetSymPrev64  : Ptr64 to     int 
   +0x3b0 SymGetSymPrev    : Ptr64 to     int 
   +0x3b8 SymGetSymPrevW64 : Ptr64 to     int 
   +0x3c0 SymGetSymPrevW   : Ptr64 to     int 
   +0x3c8 SymGetTypeFromName : Ptr64 to     int 
   +0x3d0 SymGetTypeFromNameW : Ptr64 to     int 
   +0x3d8 SymGetTypeInfoEx : Ptr64 to     int 
   +0x3e0 SymGetTypeInfo   : Ptr64 to     int 
   +0x3e8 SymGetUnwindInfo : Ptr64 to     int 
   +0x3f0 SymInitialize    : Ptr64 to     int 
   +0x3f8 SymInitializeW   : Ptr64 to     int 
   +0x400 SymLoadModule    : Ptr64 to     unsigned long 
   +0x408 SymMatchFileName : Ptr64 to     int 
   +0x410 SymMatchFileNameW : Ptr64 to     int 
   +0x418 SymMatchStringA  : Ptr64 to     int 
   +0x420 SymMatchString   : Ptr64 to     int 
   +0x428 SymMatchStringW  : Ptr64 to     int 
   +0x430 SymNext          : Ptr64 to     int 
   +0x438 SymNextW         : Ptr64 to     int 
   +0x440 SymPrev          : Ptr64 to     int 
   +0x448 SymPrevW         : Ptr64 to     int 
   +0x450 SymQueryInlineTrace : Ptr64 to     int 
   +0x458 SymRefreshModuleList : Ptr64 to     int 
   +0x460 SymRegisterCallback64 : Ptr64 to     int 
   +0x468 SymRegisterCallback : Ptr64 to     int 
   +0x470 SymRegisterCallbackW64 : Ptr64 to     int 
   +0x478 SymRegisterFunctionEntryCallback64 : Ptr64 to     int 
   +0x480 SymRegisterFunctionEntryCallback : Ptr64 to     int 
   +0x488 SymSearch        : Ptr64 to     int 
   +0x490 SymSearchW       : Ptr64 to     int 
   +0x498 SymSetContext    : Ptr64 to     int 
   +0x4a0 SymSetOptions    : Ptr64 to     unsigned long 
   +0x4a8 SymSetParentWindow : Ptr64 to     int 
   +0x4b0 SymSetScopeFromAddr : Ptr64 to     int 
   +0x4b8 SymSetScopeFromIndex : Ptr64 to     int 
   +0x4c0 SymSetScopeFromInlineContext : Ptr64 to     int 
   +0x4c8 SymSetSearchPath : Ptr64 to     int 
   +0x4d0 SymSetSearchPathW : Ptr64 to     int 
   +0x4d8 SymSrvGetFileIndexes : Ptr64 to     int 
   +0x4e0 SymSrvGetFileIndexesW : Ptr64 to     int 
   +0x4e8 SymSrvGetFileIndexInfo : Ptr64 to     int 
   +0x4f0 SymSrvGetFileIndexInfoW : Ptr64 to     int 
   +0x4f8 SymSrvGetFileIndexString : Ptr64 to     int 
   +0x500 SymSrvGetFileIndexStringW : Ptr64 to     int 
   +0x508 SymSrvIsStore    : Ptr64 to     int 
   +0x510 SymSrvIsStoreW   : Ptr64 to     int 
   +0x518 SymUnDName64     : Ptr64 to     int 
   +0x520 SymUnDName       : Ptr64 to     int 
   +0x528 SymUnloadModule64 : Ptr64 to     int 
   +0x530 SymUnloadModule  : Ptr64 to     int 
   +0x538 UndecorateSymbolName : Ptr64 to     unsigned long 
   +0x540 UndecorateSymbolNameW : Ptr64 to     unsigned long 
   +0x548 UnmapDebugInformation : Ptr64 to     int 
   +0x550 ImageNtHeader    : Ptr64 to     _IMAGE_NT_HEADERS64* 
   +0x558 ImageDirectoryEntryToData : Ptr64 to     void* 
   +0x560 ImageDirectoryEntryToDataEx : Ptr64 to     void* 
   +0x568 ImageRvaToSection : Ptr64 to     _IMAGE_SECTION_HEADER* 
   +0x570 ImageRvaToV      : Ptr64 to     void* 
0:000> dt -v Rtl!_INJECTION_FUNCTIONS
struct _INJECTION_FUNCTIONS, 37 elements, 0x128 bytes
   +0x000 RtlAddFunctionTable : Ptr64 to     unsigned char 
   +0x008 LoadLibraryExW   : Ptr64 to     HINSTANCE__* 
   +0x010 GetProcAddress   : Ptr64 to     <function>* 
   +0x018 GetLastError     : Ptr64 to     unsigned long 
   +0x020 SetLastError     : Ptr64 to     void 
   +0x028 SetEvent         : Ptr64 to     int 
   +0x030 ResetEvent       : Ptr64 to     int 
   +0x038 GetThreadContext : Ptr64 to     int 
   +0x040 SetThreadContext : Ptr64 to     int 
   +0x048 SuspendThread    : Ptr64 to     unsigned long 
   +0x050 ResumeThread     : Ptr64 to     unsigned long 
   +0x058 OpenEventW       : Ptr64 to     void* 
   +0x060 CloseHandle      : Ptr64 to     int 
   +0x068 SignalObjectAndWait : Ptr64 to     unsigned long 
   +0x070 WaitForSingleObject : Ptr64 to     unsigned long 
   +0x078 WaitForSingleObjectEx : Ptr64 to     unsigned long 
   +0x080 OutputDebugStringA : Ptr64 to     void 
   +0x088 OutputDebugStringW : Ptr64 to     void 
   +0x090 NtQueueApcThread : Ptr64 to     long 
   +0x098 NtTestAlert      : Ptr64 to     long 
   +0x0a0 QueueUserAPC     : Ptr64 to     unsigned long 
   +0x0a8 SleepEx          : Ptr64 to     unsigned long 
   +0x0b0 ExitThread       : Ptr64 to     void 
   +0x0b8 GetExitCodeThread : Ptr64 to     int 
   +0x0c0 DeviceIoControl  : Ptr64 to     int 
   +0x0c8 GetModuleHandleW : Ptr64 to     HINSTANCE__* 
   +0x0d0 CreateFileW      : Ptr64 to     void* 
   +0x0d8 CreateFileMappingW : Ptr64 to     void* 
   +0x0e0 OpenFileMappingW : Ptr64 to     void* 
   +0x0e8 MapViewOfFileEx  : Ptr64 to     void* 
   +0x0f0 MapViewOfFileExNuma : Ptr64 to     void* 
   +0x0f8 FlushViewOfFile  : Ptr64 to     int 
   +0x100 UnmapViewOfFileEx : Ptr64 to     int 
   +0x108 VirtualAllocEx   : Ptr64 to     void* 
   +0x110 VirtualFreeEx    : Ptr64 to     int 
   +0x118 VirtualProtectEx : Ptr64 to     int 
   +0x120 VirtualQueryEx   : Ptr64 to     unsigned int64 
0:000> dt -v Rtl!_INJECTION_OBJECT_HEADER
struct _INJECTION_OBJECT_HEADER, 6 elements, 0x28 bytes
   +0x000 Type             : union _INJECTION_OBJECT_TYPE, 6 elements, 0x4 bytes
   +0x004 Flags            : union _INJECTION_OBJECT_FLAGS, 3 elements, 0x4 bytes
   +0x008 Name             : struct _UNICODE_STRING, 5 elements, 0x10 bytes
   +0x018 Handle           : Ptr64 to Void
   +0x020 DesiredAccess    : Uint4B
   +0x024 InheritHandle    : Uint4B
0:000> dt -v Rtl!_INJECTION_OBJECT_EVENT
struct _INJECTION_OBJECT_EVENT, 6 elements, 0x28 bytes
   +0x000 Type             : union _INJECTION_OBJECT_TYPE, 6 elements, 0x4 bytes
   +0x004 Flags            : union _INJECTION_OBJECT_EVENT_FLAGS, 7 elements, 0x4 bytes
   +0x008 Name             : struct _UNICODE_STRING, 5 elements, 0x10 bytes
   +0x018 Handle           : Ptr64 to Void
   +0x020 DesiredAccess    : Uint4B
   +0x024 InheritHandle    : Uint4B
0:000> dt -v Rtl!_INJECTION_OBJECT_FILE_MAPPING
struct _INJECTION_OBJECT_FILE_MAPPING, 19 elements, 0x80 bytes
   +0x000 Type             : union _INJECTION_OBJECT_TYPE, 6 elements, 0x4 bytes
   +0x004 Flags            : union _INJECTION_OBJECT_FILE_MAPPING_FLAGS, 3 elements, 0x4 bytes
   +0x008 Name             : struct _UNICODE_STRING, 5 elements, 0x10 bytes
   +0x018 Handle           : Ptr64 to Void
   +0x020 DesiredAccess    : Uint4B
   +0x024 InheritHandle    : Uint4B
   +0x028 ShareMode        : Uint4B
   +0x02c CreationDisposition : Uint4B
   +0x030 FlagsAndAttributes : Uint4B
   +0x034 AllocationType   : Uint4B
   +0x038 PageProtection   : Uint4B
   +0x03c PreferredNumaNode : Uint4B
   +0x040 FileOffset       : union _LARGE_INTEGER, 4 elements, 0x8 bytes
   +0x048 MappingSize      : union _LARGE_INTEGER, 4 elements, 0x8 bytes
   +0x050 PreferredBaseAddress : Ptr64 to Void
   +0x058 BaseAddress      : Ptr64 to Void
   +0x060 Path             : struct _UNICODE_STRING, 5 elements, 0x10 bytes
   +0x070 FileHandle       : Ptr64 to Void
   +0x078 Padding          : Ptr64 to Void
0:000> dt -v Rtl!_INJECTION_OBJECT_BASE
struct _INJECTION_OBJECT_BASE, 7 elements, 0x80 bytes
   +0x000 Type             : union _INJECTION_OBJECT_TYPE, 6 elements, 0x4 bytes
   +0x004 Flags            : union _INJECTION_OBJECT_FLAGS, 3 elements, 0x4 bytes
   +0x008 Name             : struct _UNICODE_STRING, 5 elements, 0x10 bytes
   +0x018 Handle           : Ptr64 to Void
   +0x020 DesiredAccess    : Uint4B
   +0x024 InheritHandle    : Uint4B
   +0x028 Padding          : [11] Uint8B
0:000> dt -v Rtl!_INJECTION_OBJECTS
struct _INJECTION_OBJECTS, 9 elements, 0x80 bytes
   +0x000 SizeOfStruct     : Uint2B
   +0x002 SizeOfInjectionObjectInBytes : Uint2B
   +0x004 NumberOfObjects  : Uint4B
   +0x008 TotalAllocSizeInBytes : Uint4B
   +0x00c Flags            : union _INJECTION_OBJECTS_FLAGS, 3 elements, 0x4 bytes
   +0x010 Objects          : Ptr64 to union _INJECTION_OBJECT, 9 elements, 0x80 bytes
   +0x018 ModuleHandle     : Ptr64 to Void
   +0x020 FunctionPointer  : Ptr64 to     int64 
   +0x028 Padding          : [11] Uint8B
0:000> dt -v Rtl!_INJECTION_THUNK_CONTEXT
struct _INJECTION_THUNK_CONTEXT, 10 elements, 0x188 bytes
   +0x000 Flags            : union _INJECTION_THUNK_FLAGS, 7 elements, 0x4 bytes
   +0x004 EntryCount       : Uint2B
   +0x006 UserDataOffset   : Uint2B
   +0x008 FunctionTable    : Ptr64 to struct _IMAGE_RUNTIME_FUNCTION_ENTRY, 4 elements, 0xc bytes
   +0x010 BaseCodeAddress  : Ptr64 to Void
   +0x018 InjectionObjects : Ptr64 to struct _INJECTION_OBJECTS, 9 elements, 0x80 bytes
   +0x020 ModulePath       : struct _UNICODE_STRING, 5 elements, 0x10 bytes
   +0x030 FunctionName     : struct _STRING, 5 elements, 0x10 bytes
   +0x040 UserApc          : struct _APC, 4 elements, 0x20 bytes
   +0x060 Functions        : struct _INJECTION_FUNCTIONS, 37 elements, 0x128 bytes
0:000> dt -v Rtl!_ALLOCATOR
struct _ALLOCATOR, 28 elements, 0x90 bytes
   +0x000 Context          : Ptr64 to Void
   +0x000 ctx              : Ptr64 to Void
   +0x000 Allocator        : Ptr64 to struct _ALLOCATOR, 28 elements, 0x90 bytes
   +0x008 Malloc           : Ptr64 to     void* 
   +0x008 malloc           : Ptr64 to     void* 
   +0x010 Calloc           : Ptr64 to     void* 
   +0x010 calloc           : Ptr64 to     void* 
   +0x018 Realloc          : Ptr64 to     void* 
   +0x018 realloc          : Ptr64 to     void* 
   +0x020 Free             : Ptr64 to     void 
   +0x020 free             : Ptr64 to     void 
   +0x028 FreePointer      : Ptr64 to     void 
   +0x030 Initialize       : Ptr64 to     unsigned char 
   +0x038 Destroy          : Ptr64 to     void 
   +0x040 Context2         : Ptr64 to Void
   +0x040 HeapHandle       : Ptr64 to Void
   +0x040 TraceStore       : Ptr64 to struct _TRACE_STORE, 0 elements, 0x0 bytes
   +0x048 Parent           : Ptr64 to struct _ALLOCATOR, 28 elements, 0x90 bytes
   +0x050 TryMalloc        : Ptr64 to     void* 
   +0x058 TryCalloc        : Ptr64 to     void* 
   +0x060 MallocWithTimestamp : Ptr64 to     void* 
   +0x068 CallocWithTimestamp : Ptr64 to     void* 
   +0x070 TryMallocWithTimestamp : Ptr64 to     void* 
   +0x078 TryCallocWithTimestamp : Ptr64 to     void* 
   +0x080 ThreadId         : Uint4B
   +0x084 TlsIndex         : Uint4B
   +0x088 Flags            : union _ALLOCATOR_FLAGS, 6 elements, 0x4 bytes
   +0x08c NumberOfThreads  : Uint4B
0:000> dt -v Rtl!_STRING
struct _STRING, 5 elements, 0x10 bytes
   +0x000 Length           : Uint2B
   +0x002 MaximumLength    : Uint2B
   +0x004 Hash             : Int4B
   +0x004 Offset           : Int4B
   +0x008 Buffer           : Ptr64 to Char
0:000> dt -v Rtl!_UNICODE_STRING
struct _UNICODE_STRING, 5 elements, 0x10 bytes
   +0x000 Length           : Uint2B
   +0x002 MaximumLength    : Uint2B
   +0x004 Hash             : Int4B
   +0x004 Offset           : Int4B
   +0x008 Buffer           : Ptr64 to Wchar
0:000> dt -v Rtl!_LINKED_STRING
struct _LINKED_STRING, 8 elements, 0x20 bytes
   +0x000 ListEntry        : struct _LIST_ENTRY, 2 elements, 0x10 bytes
   +0x010 Length           : Uint2B
   +0x012 MaximumLength    : Uint2B
   +0x014 Hash             : Int4B
   +0x018 Buffer           : Ptr64 to Char
   +0x018 WideBuffer       : Ptr64 to Wchar
   +0x010 String           : struct _STRING, 5 elements, 0x10 bytes
   +0x010 Unicode          : struct _UNICODE_STRING, 5 elements, 0x10 bytes
0:000> dt -v Rtl!_RTL_BITMAP
struct _RTL_BITMAP, 2 elements, 0x10 bytes
   +0x000 SizeOfBitMap     : Uint4B
   +0x008 Buffer           : Ptr64 to Uint4B
0:000> dt -v Rtl!_RTL_BITMAP_RUN
struct _RTL_BITMAP_RUN, 2 elements, 0x8 bytes
   +0x000 StartingIndex    : Uint4B
   +0x004 NumberOfBits     : Uint4B
0:000> dt -v Rtl!_RTL_HEAP_PARAMETERS
struct _RTL_HEAP_PARAMETERS, 11 elements, 0x60 bytes
   +0x000 Length           : Uint4B
   +0x008 SegmentReserve   : Uint8B
   +0x010 SegmentCommit    : Uint8B
   +0x018 DeCommitFreeBlockThreshold : Uint8B
   +0x020 DeCommitTotalFreeThreshold : Uint8B
   +0x028 MaximumAllocationSize : Uint8B
   +0x030 VirtualMemoryThreshold : Uint8B
   +0x038 InitialCommit    : Uint8B
   +0x040 InitialReserve   : Uint8B
   +0x048 CommitRoutine    : Ptr64 to     long 
   +0x050 Reserved         : [2] Uint8B
0:000> dt -v Rtl!_UNWIND_CODE
struct _UNWIND_CODE, 3 elements, 0x2 bytes
   +0x000 PrologOffset     : UChar
   +0x001 UnwindOpCode     : Bitfield Pos 0, 4 Bits
   +0x001 UnwindOpInfo     : Bitfield Pos 4, 4 Bits
0:000> dt -v Rtl!_UNWIND_CODE_EX
struct _UNWIND_CODE_EX, 6 elements, 0x6 bytes
   +0x000 PrologOffset     : UChar
   +0x001 UnwindOpCode     : Bitfield Pos 0, 4 Bits
   +0x001 UnwindOpInfo     : Bitfield Pos 4, 4 Bits
   +0x001 Code             : Enum _UWOP_UNWIND_CODE,  11 total enums

   +0x001 _UnwindOpCode    : Bitfield Pos 0, 4 Bits
   +0x002 Reg              : Enum _UWOP_UNWIND_OPREG,  16 total enums

0:000> dt -v Rtl!_UNWIND_INFO
struct _UNWIND_INFO, 13 elements, 0x14 bytes
   +0x000 Version          : Bitfield Pos 0, 3 Bits
   +0x000 Flags            : Bitfield Pos 3, 5 Bits
   +0x001 SizeOfProlog     : UChar
   +0x002 CountOfCodes     : UChar
   +0x003 FrameRegister    : Bitfield Pos 0, 4 Bits
   +0x003 FrameOffset      : Bitfield Pos 4, 4 Bits
   +0x004 UnwindCode       : [2] struct _UNWIND_CODE, 3 elements, 0x2 bytes
   +0x008 ExceptionHandler : Uint4B
   +0x00c ExceptionData    : [1] Uint4B
   +0x008 FunctionStartAddress : Uint4B
   +0x00c FunctionEndAddress : Uint4B
   +0x010 UnwindInfoAddress : Uint4B
   +0x008 RuntimeFunction  : struct _IMAGE_RUNTIME_FUNCTION_ENTRY, 4 elements, 0xc bytes
0:000> dt -v Rtl!_UNWIND_SCOPE_RECORD
struct _UNWIND_SCOPE_RECORD, 4 elements, 0x10 bytes
   +0x000 BeginAddress     : Uint4B
   +0x004 EndAddress       : Uint4B
   +0x008 HandlerAddress   : Uint4B
   +0x00c JumpTarget       : Uint4B
0:000> dt -v Rtl!_UNWIND_SCOPE_TABLE
struct _UNWIND_SCOPE_TABLE, 2 elements, 0x14 bytes
   +0x000 Count            : Uint4B
   +0x004 ScopeRecord      : [1] struct _UNWIND_SCOPE_RECORD, 4 elements, 0x10 bytes
0:000> dt -v Rtl!_UNWIND_INFO4
struct _UNWIND_INFO4, 13 elements, 0x18 bytes
   +0x000 Version          : Bitfield Pos 0, 3 Bits
   +0x000 Flags            : Bitfield Pos 3, 5 Bits
   +0x001 SizeOfProlog     : UChar
   +0x002 CountOfCodes     : UChar
   +0x003 FrameRegister    : Bitfield Pos 0, 4 Bits
   +0x003 FrameOffset      : Bitfield Pos 4, 4 Bits
   +0x004 UnwindCode       : [4] struct _UNWIND_CODE, 3 elements, 0x2 bytes
   +0x00c ExceptionHandler : Uint4B
   +0x010 ExceptionData    : [1] Uint4B
   +0x00c FunctionStartAddress : Uint4B
   +0x010 FunctionEndAddress : Uint4B
   +0x014 UnwindInfoAddress : Uint4B
   +0x00c RuntimeFunction  : struct _IMAGE_RUNTIME_FUNCTION_ENTRY, 4 elements, 0xc bytes
0:000> dt -v Rtl!_UNWIND_INFO6
struct _UNWIND_INFO6, 13 elements, 0x1c bytes
   +0x000 Version          : Bitfield Pos 0, 3 Bits
   +0x000 Flags            : Bitfield Pos 3, 5 Bits
   +0x001 SizeOfProlog     : UChar
   +0x002 CountOfCodes     : UChar
   +0x003 FrameRegister    : Bitfield Pos 0, 4 Bits
   +0x003 FrameOffset      : Bitfield Pos 4, 4 Bits
   +0x004 UnwindCode       : [6] struct _UNWIND_CODE, 3 elements, 0x2 bytes
   +0x010 ExceptionHandler : Uint4B
   +0x014 ExceptionData    : [1] Uint4B
   +0x010 FunctionStartAddress : Uint4B
   +0x014 FunctionEndAddress : Uint4B
   +0x018 UnwindInfoAddress : Uint4B
   +0x010 RuntimeFunction  : struct _IMAGE_RUNTIME_FUNCTION_ENTRY, 4 elements, 0xc bytes
0:000> dt -v Rtl!_UNWIND_INFO8
struct _UNWIND_INFO8, 13 elements, 0x20 bytes
   +0x000 Version          : Bitfield Pos 0, 3 Bits
   +0x000 Flags            : Bitfield Pos 3, 5 Bits
   +0x001 SizeOfProlog     : UChar
   +0x002 CountOfCodes     : UChar
   +0x003 FrameRegister    : Bitfield Pos 0, 4 Bits
   +0x003 FrameOffset      : Bitfield Pos 4, 4 Bits
   +0x004 UnwindCode       : [8] struct _UNWIND_CODE, 3 elements, 0x2 bytes
   +0x014 ExceptionHandler : Uint4B
   +0x018 ExceptionData    : [1] Uint4B
   +0x014 FunctionStartAddress : Uint4B
   +0x018 FunctionEndAddress : Uint4B
   +0x01c UnwindInfoAddress : Uint4B
   +0x014 RuntimeFunction  : struct _IMAGE_RUNTIME_FUNCTION_ENTRY, 4 elements, 0xc bytes
0:000> dt -v Rtl!_RUNTIME_FUNCTION_EX
struct _RUNTIME_FUNCTION_EX, 7 elements, 0x28 bytes
   +0x000 BeginAddress     : Ptr64 to Void
   +0x008 EndAddress       : Ptr64 to Void
   +0x010 UnwindInfo       : Ptr64 to struct _UNWIND_INFO, 13 elements, 0x14 bytes
   +0x010 UnwindInfoEx     : Ptr64 to union _UNWIND_INFO_EX, 7 elements, 0x20 bytes
   +0x010 UnwindData       : Ptr64 to Void
   +0x018 HandlerFunction  : Ptr64 to Void
   +0x020 ScopeTable       : Ptr64 to struct _UNWIND_SCOPE_TABLE, 2 elements, 0x14 bytes
0:000> dt -v Rtl!_PEB_LDR_DATA
struct _PEB_LDR_DATA, 7 elements, 0x48 bytes
   +0x000 Length           : Uint4B
   +0x004 Initialized      : UChar
   +0x008 SsHandle         : Ptr64 to Void
   +0x010 InLoadOrderModuleList : struct _LIST_ENTRY, 2 elements, 0x10 bytes
   +0x020 InMemoryOrderModuleList : struct _LIST_ENTRY, 2 elements, 0x10 bytes
   +0x030 InInitializationOrderModuleList : struct _LIST_ENTRY, 2 elements, 0x10 bytes
   +0x040 EntryInProgress  : Ptr64 to Void
0:000> dt -v Rtl!_LDR_DATA_TABLE_ENTRY
struct _LDR_DATA_TABLE_ENTRY, 17 elements, 0x88 bytes
   +0x000 InLoadOrderModuleList : struct _LIST_ENTRY, 2 elements, 0x10 bytes
   +0x010 InMemoryOrderLinks : struct _LIST_ENTRY, 2 elements, 0x10 bytes
   +0x020 InInitializationOrderModuleList : struct _LIST_ENTRY, 2 elements, 0x10 bytes
   +0x030 DllBase          : Ptr64 to Void
   +0x038 EntryPoint       : Ptr64 to Void
   +0x040 SizeOfImage      : Uint4B
   +0x040 _Padding         : Ptr64 to Void
   +0x048 FullDllName      : struct _UNICODE_STRING, 5 elements, 0x10 bytes
   +0x058 BaseDllName      : struct _UNICODE_STRING, 5 elements, 0x10 bytes
   +0x068 Flags            : Uint4B
   +0x06c LoadCount        : Uint2B
   +0x06e TlsIndex         : Uint2B
   +0x070 HashLinks        : struct _LIST_ENTRY, 2 elements, 0x10 bytes
   +0x070 SectionPointer   : Ptr64 to Void
   +0x078 CheckSum         : Uint4B
   +0x080 TimeDateStamp    : Uint4B
   +0x080 LoadedImports    : Ptr64 to Void
0:000> dt -v Rtl!_LDR_DLL_LOADED_NOTIFICATION_DATA
struct _LDR_DLL_LOADED_NOTIFICATION_DATA, 5 elements, 0x28 bytes
   +0x000 Flags            : Uint4B
   +0x008 FullDllName      : Ptr64 to struct _UNICODE_STRING, 5 elements, 0x10 bytes
   +0x010 BaseDllName      : Ptr64 to struct _UNICODE_STRING, 5 elements, 0x10 bytes
   +0x018 DllBase          : Ptr64 to Void
   +0x020 SizeOfImage      : Uint4B
0:000> dt -v Rtl!_LDR_DLL_UNLOADED_NOTIFICATION_DATA
struct _LDR_DLL_UNLOADED_NOTIFICATION_DATA, 5 elements, 0x28 bytes
   +0x000 Flags            : Uint4B
   +0x008 FullDllName      : Ptr64 to struct _UNICODE_STRING, 5 elements, 0x10 bytes
   +0x010 BaseDllName      : Ptr64 to struct _UNICODE_STRING, 5 elements, 0x10 bytes
   +0x018 DllBase          : Ptr64 to Void
   +0x020 SizeOfImage      : Uint4B
0:000> dt -v Rtl!_RTL_USER_PROCESS_PARAMETERS
struct _RTL_USER_PROCESS_PARAMETERS, 4 elements, 0x80 bytes
   +0x000 Reserved1        : [16] UChar
   +0x010 Reserved2        : [10] Ptr64 to Void
   +0x060 ImagePathName    : struct _UNICODE_STRING, 5 elements, 0x10 bytes
   +0x070 CommandLine      : struct _UNICODE_STRING, 5 elements, 0x10 bytes
0:000> dt -v Rtl!_PEB_FREE_BLOCK
struct _PEB_FREE_BLOCK, 2 elements, 0x10 bytes
   +0x000 Next             : Ptr64 to struct _PEB_FREE_BLOCK, 2 elements, 0x10 bytes
   +0x008 Size             : Uint4B
0:000> dt -v Rtl!_PEB
struct _PEB, 72 elements, 0x358 bytes
   +0x000 InheritedAddressSpace : UChar
   +0x001 ReadImageFileExecOptions : UChar
   +0x002 BeingDebugged    : UChar
   +0x003 BitField         : UChar
   +0x003 ImageUsesLargePages : Bitfield Pos 0, 1 Bit
   +0x003 SpareBits        : Bitfield Pos 1, 7 Bits
   +0x008 Mutant           : Ptr64 to Void
   +0x010 ImageBaseAddress : Ptr64 to Void
   +0x018 Ldr              : Ptr64 to struct _PEB_LDR_DATA, 7 elements, 0x48 bytes
   +0x020 ProcessParameters : Ptr64 to struct _RTL_USER_PROCESS_PARAMETERS, 4 elements, 0x80 bytes
   +0x028 SubSystemData    : Ptr64 to Void
   +0x030 ProcessHeap      : Ptr64 to Void
   +0x038 FastPebLock      : Ptr64 to struct _RTL_CRITICAL_SECTION, 6 elements, 0x28 bytes
   +0x040 AtlThunkSListPtr : Ptr64 to Void
   +0x048 SparePtr2        : Ptr64 to Void
   +0x050 EnvironmentUpdateCount : Uint4B
   +0x058 KernelCallbackTable : Ptr64 to Void
   +0x060 SystemReserved   : [1] Uint4B
   +0x064 SpareUlong       : Uint4B
   +0x068 FreeList         : Ptr64 to struct _PEB_FREE_BLOCK, 2 elements, 0x10 bytes
   +0x070 TlsExpansionCounter : Uint4B
   +0x078 TlsBitmap        : Ptr64 to Void
   +0x080 TlsBitmapBits    : [2] Uint4B
   +0x088 ReadOnlySharedMemoryBase : Ptr64 to Void
   +0x090 ReadOnlySharedMemoryHeap : Ptr64 to Void
   +0x098 ReadOnlyStaticServerData : Ptr64 to Ptr64 to Void
   +0x0a0 AnsiCodePageData : Ptr64 to Void
   +0x0a8 OemCodePageData  : Ptr64 to Void
   +0x0b0 UnicodeCaseTableData : Ptr64 to Void
   +0x0b8 NumberOfProcessors : Uint4B
   +0x0bc NtGlobalFlag     : Uint4B
   +0x0c0 CriticalSectionTimeout : union _LARGE_INTEGER, 4 elements, 0x8 bytes
   +0x0c8 HeapSegmentReserve : Uint8B
   +0x0d0 HeapSegmentCommit : Uint8B
   +0x0d8 HeapDeCommitTotalFreeThreshold : Uint8B
   +0x0e0 HeapDeCommitFreeBlockThreshold : Uint8B
   +0x0e8 NumberOfHeaps    : Uint4B
   +0x0ec MaximumNumberOfHeaps : Uint4B
   +0x0f0 ProcessHeaps     : Ptr64 to Ptr64 to Void
   +0x0f8 GdiSharedHandleTable : Ptr64 to Void
   +0x100 ProcessStarterHelper : Ptr64 to Void
   +0x108 GdiDCAttributeList : Uint4B
   +0x110 LoaderLock       : Ptr64 to struct _RTL_CRITICAL_SECTION, 6 elements, 0x28 bytes
   +0x118 OSMajorVersion   : Uint4B
   +0x11c OSMinorVersion   : Uint4B
   +0x120 OSBuildNumber    : Uint2B
   +0x122 OSCSDVersion     : Uint2B
   +0x124 OSPlatformId     : Uint4B
   +0x128 ImageSubsystem   : Uint4B
   +0x12c ImageSubsystemMajorVersion : Uint4B
   +0x130 ImageSubsystemMinorVersion : Uint4B
   +0x138 ImageProcessAffinityMask : Uint8B
   +0x140 GdiHandleBuffer  : [60] Uint4B
   +0x230 PostProcessInitRoutine : Ptr64 to     void 
   +0x238 TlsExpansionBitmap : Ptr64 to Void
   +0x240 TlsExpansionBitmapBits : [32] Uint4B
   +0x2c0 SessionId        : Uint4B
   +0x2c8 AppCompatFlags   : union _ULARGE_INTEGER, 4 elements, 0x8 bytes
   +0x2d0 AppCompatFlagsUser : union _ULARGE_INTEGER, 4 elements, 0x8 bytes
   +0x2d8 pShimData        : Ptr64 to Void
   +0x2e0 AppCompatInfo    : Ptr64 to Void
   +0x2e8 CSDVersion       : struct _UNICODE_STRING, 5 elements, 0x10 bytes
   +0x2f8 ActivationContextData : Ptr64 to struct _ACTIVATION_CONTEXT_DATA, 0 elements, 0x0 bytes
   +0x300 ProcessAssemblyStorageMap : Ptr64 to struct _ASSEMBLY_STORAGE_MAP, 0 elements, 0x0 bytes
   +0x308 SystemDefaultActivationContextData : Ptr64 to struct _ACTIVATION_CONTEXT_DATA, 0 elements, 0x0 bytes
   +0x310 SystemAssemblyStorageMap : Ptr64 to struct _ASSEMBLY_STORAGE_MAP, 0 elements, 0x0 bytes
   +0x318 MinimumStackCommit : Uint8B
   +0x320 FlsCallback      : Ptr64 to Ptr64 to Void
   +0x328 FlsListHead      : struct _LIST_ENTRY, 2 elements, 0x10 bytes
   +0x338 FlsBitmap        : Ptr64 to Void
   +0x340 FlsBitmapBits    : [4] Uint4B
   +0x350 FlsHighIndex     : Uint4B
0:000> dt -v Rtl!_ACTIVATION_CONTEXT_STACK
struct _ACTIVATION_CONTEXT_STACK, 5 elements, 0x28 bytes
   +0x000 ActiveFrame      : Ptr64 to struct _RTL_ACTIVATION_CONTEXT_STACK_FRAME, 0 elements, 0x0 bytes
   +0x008 FrameListCache   : struct _LIST_ENTRY, 2 elements, 0x10 bytes
   +0x018 Flags            : Uint4B
   +0x01c NextCookieSequenceNumber : Uint4B
   +0x020 StackId          : Uint4B
0:000> dt -v Rtl!_TEB_ACTIVE_FRAME_CONTEXT
struct _TEB_ACTIVE_FRAME_CONTEXT, 2 elements, 0x10 bytes
   +0x000 Flags            : Uint4B
   +0x008 FrameName        : Ptr64 to Char
0:000> dt -v Rtl!_TEB_ACTIVE_FRAME_CONTEXT_EX
struct _TEB_ACTIVE_FRAME_CONTEXT_EX, 2 elements, 0x18 bytes
   +0x000 BasicContext     : struct _TEB_ACTIVE_FRAME_CONTEXT, 2 elements, 0x10 bytes
   +0x010 SourceLocation   : Ptr64 to Char
0:000> dt -v Rtl!_TEB_ACTIVE_FRAME
struct _TEB_ACTIVE_FRAME, 3 elements, 0x18 bytes
   +0x000 Flags            : Uint4B
   +0x008 Previous         : Ptr64 to struct _TEB_ACTIVE_FRAME, 3 elements, 0x18 bytes
   +0x010 Context          : Ptr64 to struct _TEB_ACTIVE_FRAME_CONTEXT, 2 elements, 0x10 bytes
0:000> dt -v Rtl!_TEB_ACTIVE_FRAME_EX
struct _TEB_ACTIVE_FRAME_EX, 2 elements, 0x20 bytes
   +0x000 BasicFrame       : struct _TEB_ACTIVE_FRAME, 3 elements, 0x18 bytes
   +0x018 ExtensionIdentifier : Ptr64 to Void
0:000> dt -v Rtl!_CLIENT_ID
struct _CLIENT_ID, 2 elements, 0x10 bytes
   +0x000 ProcessId        : Ptr64 to Void
   +0x008 ThreadId         : Ptr64 to Void
0:000> dt -v Rtl!_GDI_TEB_BATCH
struct _GDI_TEB_BATCH, 3 elements, 0x4e8 bytes
   +0x000 Offset           : Uint4B
   +0x008 HDC              : Uint8B
   +0x010 Buffer           : [310] Uint4B
0:000> dt -v Rtl!_TEB
struct _TEB, 73 elements, 0x17d8 bytes
   +0x000 NtTib            : struct _NT_TIB, 8 elements, 0x38 bytes
   +0x038 EnvironmentPointer : Ptr64 to Void
   +0x040 ClientId         : struct _CLIENT_ID, 2 elements, 0x10 bytes
   +0x050 ActiveRpcHandle  : Ptr64 to Void
   +0x058 ThreadLocalStoragePointer : Ptr64 to Void
   +0x060 ProcessEnvironmentBlock : Ptr64 to struct _PEB, 72 elements, 0x358 bytes
   +0x068 LastErrorValue   : Uint4B
   +0x06c CountOfOwnedCriticalSections : Uint4B
   +0x070 CsrClientThread  : Ptr64 to Void
   +0x078 Win32ThreadInfo  : Ptr64 to Void
   +0x080 User32Reserved   : [26] Uint4B
   +0x0e8 UserReserved     : [5] Uint4B
   +0x100 WOW32Reserved    : Ptr64 to Void
   +0x108 CurrentLocale    : Uint4B
   +0x10c FpSoftwareStatusRegister : Uint4B
   +0x110 SystemReserved1  : [54] Ptr64 to Void
   +0x2c0 ExceptionCode    : Int4B
   +0x2c8 ActivationContextStackPointer : Ptr64 to struct _ACTIVATION_CONTEXT_STACK, 5 elements, 0x28 bytes
   +0x2d0 SpareBytes1      : [28] UChar
   +0x2f0 GdiTebBatch      : struct _GDI_TEB_BATCH, 3 elements, 0x4e8 bytes
   +0x7d8 RealClientId     : struct _CLIENT_ID, 2 elements, 0x10 bytes
   +0x7e8 GdiCachedProcessHandle : Ptr64 to Void
   +0x7f0 GdiClientPID     : Uint4B
   +0x7f4 GdiClientTID     : Uint4B
   +0x7f8 GdiThreadLocalInfo : Ptr64 to Void
   +0x800 Win32ClientInfo  : [62] Uint8B
   +0x9f0 glDispatchTable  : [233] Ptr64 to Void
   +0x1138 glReserved1      : [29] Uint8B
   +0x1220 glReserved2      : Ptr64 to Void
   +0x1228 glSectionInfo    : Ptr64 to Void
   +0x1230 glSection        : Ptr64 to Void
   +0x1238 glTable          : Ptr64 to Void
   +0x1240 glCurrentRC      : Ptr64 to Void
   +0x1248 glContext        : Ptr64 to Void
   +0x1250 LastStatusValue  : Uint4B
   +0x1258 StaticUnicodeString : struct _UNICODE_STRING, 5 elements, 0x10 bytes
   +0x1268 StaticUnicodeBuffer : [261] Wchar
   +0x1478 DeallocationStack : Ptr64 to Void
   +0x1480 TlsSlots         : [64] Ptr64 to Void
   +0x1680 TlsLinks         : struct _LIST_ENTRY, 2 elements, 0x10 bytes
   +0x1690 Vdm              : Ptr64 to Void
   +0x1698 ReservedForNtRpc : Ptr64 to Void
   +0x16a0 DbgSsReserved    : [2] Ptr64 to Void
   +0x16b0 HardErrorMode    : Uint4B
   +0x16b8 Instrumentation  : [14] Ptr64 to Void
   +0x1728 SubProcessTag    : Ptr64 to Void
   +0x1730 EtwTraceData     : Ptr64 to Void
   +0x1738 WinSockData      : Ptr64 to Void
   +0x1740 GdiBatchCount    : Uint4B
   +0x1744 InDbgPrint       : UChar
   +0x1745 FreeStackOnTermination : UChar
   +0x1746 HasFiberData     : UChar
   +0x1747 IdealProcessor   : UChar
   +0x1748 GuaranteedStackBytes : Uint4B
   +0x1750 ReservedForPerf  : Ptr64 to Void
   +0x1758 ReservedForOle   : Ptr64 to Void
   +0x1760 WaitingOnLoaderLock : Uint4B
   +0x1768 SparePointer1    : Uint8B
   +0x1770 SoftPatchPtr1    : Uint8B
   +0x1778 SoftPatchPtr2    : Uint8B
   +0x1780 TlsExpansionSlots : Ptr64 to Ptr64 to Void
   +0x1788 DeallocationBStore : Ptr64 to Void
   +0x1790 BStoreLimit      : Ptr64 to Void
   +0x1798 ImpersonationLocale : Uint4B
   +0x179c IsImpersonating  : Uint4B
   +0x17a0 NlsCache         : Ptr64 to Void
   +0x17a8 pShimData        : Ptr64 to Void
   +0x17b0 HeapVirtualAffinity : Uint4B
   +0x17b8 CurrentTransactionHandle : Ptr64 to Void
   +0x17c0 ActiveFrame      : Ptr64 to struct _TEB_ACTIVE_FRAME, 3 elements, 0x18 bytes
   +0x17c8 FlsData          : Ptr64 to Void
   +0x17d0 SafeThunkCall    : UChar
   +0x17d1 BooleanSpare     : [3] UChar
0:000> dt -v Rtl!_INITIAL_TEB
struct _INITIAL_TEB, 4 elements, 0x28 bytes
   +0x000 OldInitialTeb    : struct <unnamed-tag>, 2 elements, 0x10 bytes
   +0x010 StackBase        : Ptr64 to Void
   +0x018 StackLimit       : Ptr64 to Void
   +0x020 StackAllocationBase : Ptr64 to Void
0:000> dt -v Rtl!_THREAD_BASIC_INFORMATION
struct _THREAD_BASIC_INFORMATION, 6 elements, 0x30 bytes
   +0x000 ExitStatus       : Int4B
   +0x008 TebBaseAddress   : Ptr64 to struct _TEB, 73 elements, 0x17d8 bytes
   +0x010 ClientId         : struct _CLIENT_ID, 2 elements, 0x10 bytes
   +0x020 AffinityMask     : Uint8B
   +0x028 Priority         : Int4B
   +0x02c BasePriority     : Int4B
0:000> dt -v Rtl!_PROCESS_BASIC_INFORMATION
struct _PROCESS_BASIC_INFORMATION, 6 elements, 0x30 bytes
   +0x000 ExitStatus       : Int4B
   +0x008 PebBaseAddress   : Ptr64 to struct _PEB, 72 elements, 0x358 bytes
   +0x010 AffinityMask     : Uint8B
   +0x018 BasePriority     : Int4B
   +0x020 UniqueProcessId  : Uint8B
   +0x028 InheritedFromUniqueProcessId : Uint8B
0:000> dt -v Rtl!_OBJECT_ATTRIBUTES
struct _OBJECT_ATTRIBUTES, 6 elements, 0x30 bytes
   +0x000 Length           : Uint4B
   +0x008 RootDirectory    : Ptr64 to Void
   +0x010 ObjectName       : Ptr64 to struct _UNICODE_STRING, 5 elements, 0x10 bytes
   +0x018 Attributes       : Uint4B
   +0x020 SecurityDescriptor : Ptr64 to Void
   +0x028 SecurityQualityOfService : Ptr64 to Void
0:000> dt -v Rtl!_SYSTEM_TIMER_FUNCTION
struct _SYSTEM_TIMER_FUNCTION, 2 elements, 0x10 bytes
   +0x000 GetSystemTimePreciseAsFileTime : Ptr64 to     void 
   +0x008 NtQuerySystemTime : Ptr64 to     long 
0:000> dt -v Rtl!_ATEXITEX_FLAGS
struct _ATEXITEX_FLAGS, 1 elements, 0x4 bytes
   +0x000 SuppressExceptions : Bitfield Pos 0, 1 Bit
0:000> dt -v Rtl!_APC
struct _APC, 4 elements, 0x20 bytes
   +0x000 Routine          : Ptr64 to     void 
   +0x008 Argument1        : Ptr64 to Void
   +0x010 Argument2        : Ptr64 to Void
   +0x018 Argument3        : Ptr64 to Void
0:000> dt -v Rtl!_RTL_SPLAY_LINKS
struct _RTL_SPLAY_LINKS, 3 elements, 0x18 bytes
   +0x000 Parent           : Ptr64 to struct _RTL_SPLAY_LINKS, 3 elements, 0x18 bytes
   +0x008 LeftChild        : Ptr64 to struct _RTL_SPLAY_LINKS, 3 elements, 0x18 bytes
   +0x010 RightChild       : Ptr64 to struct _RTL_SPLAY_LINKS, 3 elements, 0x18 bytes
0:000> dt -v Rtl!_TABLE_ENTRY_HEADER
struct _TABLE_ENTRY_HEADER, 3 elements, 0x30 bytes
   +0x000 SplayLinks       : struct _RTL_SPLAY_LINKS, 3 elements, 0x18 bytes
   +0x018 ListEntry        : struct _LIST_ENTRY, 2 elements, 0x10 bytes
   +0x028 UserData         : Int8B
0:000> dt -v Rtl!_TABLE_ENTRY_HEADER_HEADER
struct _TABLE_ENTRY_HEADER_HEADER, 2 elements, 0x28 bytes
   +0x000 SplayLinks       : struct _RTL_SPLAY_LINKS, 3 elements, 0x18 bytes
   +0x018 ListEntry        : struct _LIST_ENTRY, 2 elements, 0x10 bytes
0:000> dt -v Rtl!_RTL_GENERIC_TABLE
struct _RTL_GENERIC_TABLE, 9 elements, 0x48 bytes
   +0x000 TableRoot        : Ptr64 to struct _RTL_SPLAY_LINKS, 3 elements, 0x18 bytes
   +0x008 InsertOrderList  : struct _LIST_ENTRY, 2 elements, 0x10 bytes
   +0x018 OrderedPointer   : Ptr64 to struct _LIST_ENTRY, 2 elements, 0x10 bytes
   +0x020 WhichOrderedElement : Uint4B
   +0x024 NumberGenericTableElements : Uint4B
   +0x028 CompareRoutine   : Ptr64 to     _RTL_GENERIC_COMPARE_RESULTS 
   +0x030 AllocateRoutine  : Ptr64 to     void* 
   +0x038 FreeRoutine      : Ptr64 to     void 
   +0x040 TableContext     : Ptr64 to Void
0:000> dt -v Rtl!_RTL_BALANCED_LINKS
struct _RTL_BALANCED_LINKS, 6 elements, 0x20 bytes
   +0x000 Parent           : Ptr64 to struct _RTL_BALANCED_LINKS, 6 elements, 0x20 bytes
   +0x008 LeftChild        : Ptr64 to struct _RTL_BALANCED_LINKS, 6 elements, 0x20 bytes
   +0x010 RightChild       : Ptr64 to struct _RTL_BALANCED_LINKS, 6 elements, 0x20 bytes
   +0x018 Balance          : Char
   +0x019 Reserved         : [3] UChar
   +0x01c Padding          : Uint4B
0:000> dt -v Rtl!_RTL_AVL_TABLE
struct _RTL_AVL_TABLE, 13 elements, 0x68 bytes
   +0x000 BalancedRoot     : struct _RTL_BALANCED_LINKS, 6 elements, 0x20 bytes
   +0x020 OrderedPointer   : Ptr64 to Void
   +0x028 WhichOrderedElement : Uint4B
   +0x02c NumberGenericTableElements : Uint4B
   +0x030 DepthOfTree      : Uint4B
   +0x034 Unused1          : Uint4B
   +0x038 RestartKey       : Ptr64 to struct _RTL_BALANCED_LINKS, 6 elements, 0x20 bytes
   +0x040 DeleteCount      : Uint4B
   +0x044 Unused2          : Uint4B
   +0x048 CompareRoutine   : Ptr64 to     _RTL_GENERIC_COMPARE_RESULTS 
   +0x050 AllocateRoutine  : Ptr64 to     void* 
   +0x058 FreeRoutine      : Ptr64 to     void 
   +0x060 TableContext     : Ptr64 to Void
0:000> dt -v Rtl!_RTL_DYNAMIC_HASH_TABLE_ENTRY
struct _RTL_DYNAMIC_HASH_TABLE_ENTRY, 2 elements, 0x18 bytes
   +0x000 Linkage          : struct _LIST_ENTRY, 2 elements, 0x10 bytes
   +0x010 Signature        : Uint8B
0:000> dt -v Rtl!_RTL_DYNAMIC_HASH_TABLE_CONTEXT
struct _RTL_DYNAMIC_HASH_TABLE_CONTEXT, 3 elements, 0x18 bytes
   +0x000 ChainHead        : Ptr64 to struct _LIST_ENTRY, 2 elements, 0x10 bytes
   +0x008 PrevLinkage      : Ptr64 to struct _LIST_ENTRY, 2 elements, 0x10 bytes
   +0x010 Signature        : Uint8B
0:000> dt -v Rtl!_RTL_DYNAMIC_HASH_TABLE_ENUMERATOR
struct _RTL_DYNAMIC_HASH_TABLE_ENUMERATOR, 5 elements, 0x28 bytes
   +0x000 HashEntry        : struct _RTL_DYNAMIC_HASH_TABLE_ENTRY, 2 elements, 0x18 bytes
   +0x000 CurEntry         : Ptr64 to struct _LIST_ENTRY, 2 elements, 0x10 bytes
   +0x018 ChainHead        : Ptr64 to struct _LIST_ENTRY, 2 elements, 0x10 bytes
   +0x020 BucketIndex      : Uint4B
   +0x024 Padding1         : Uint4B
0:000> dt -v Rtl!_RTL_DYNAMIC_HASH_TABLE
struct _RTL_DYNAMIC_HASH_TABLE, 9 elements, 0x28 bytes
   +0x000 Flags            : Uint4B
   +0x004 Shift            : Uint4B
   +0x008 TableSize        : Uint4B
   +0x00c Pivot            : Uint4B
   +0x010 DivisorMask      : Uint4B
   +0x014 NumEntries       : Uint4B
   +0x018 NonEmptyBuckets  : Uint4B
   +0x01c NumEnumerators   : Uint4B
   +0x020 Directory        : Ptr64 to Void
0:000> dt -v Rtl!_PREFIX_TABLE_ENTRY
struct _PREFIX_TABLE_ENTRY, 5 elements, 0x30 bytes
   +0x000 NodeTypeCode     : Int2B
   +0x002 NameLength       : Int2B
   +0x008 NextPrefixTree   : Ptr64 to struct _PREFIX_TABLE_ENTRY, 5 elements, 0x30 bytes
   +0x010 Links            : struct _RTL_SPLAY_LINKS, 3 elements, 0x18 bytes
   +0x028 Prefix           : Ptr64 to struct _STRING, 5 elements, 0x10 bytes
0:000> dt -v Rtl!_PREFIX_TABLE
struct _PREFIX_TABLE, 4 elements, 0x10 bytes
   +0x000 NodeTypeCode     : Int2B
   +0x002 NameLength       : Int2B
   +0x004 Unused           : Uint4B
   +0x008 NextPrefixTree   : Ptr64 to struct _PREFIX_TABLE_ENTRY, 5 elements, 0x30 bytes
0:000> dt -v Rtl!_UNICODE_PREFIX_TABLE_ENTRY
struct _UNICODE_PREFIX_TABLE_ENTRY, 7 elements, 0x38 bytes
   +0x000 NodeTypeCode     : Int2B
   +0x002 NameLength       : Int2B
   +0x004 Unused1          : Uint4B
   +0x008 NextPrefixTree   : Ptr64 to struct _UNICODE_PREFIX_TABLE_ENTRY, 7 elements, 0x38 bytes
   +0x010 CaseMatch        : Ptr64 to struct _UNICODE_PREFIX_TABLE_ENTRY, 7 elements, 0x38 bytes
   +0x018 Links            : struct _RTL_SPLAY_LINKS, 3 elements, 0x18 bytes
   +0x030 Prefix           : Ptr64 to struct _UNICODE_STRING, 5 elements, 0x10 bytes
0:000> dt -v Rtl!_UNICODE_PREFIX_TABLE
struct _UNICODE_PREFIX_TABLE, 5 elements, 0x18 bytes
   +0x000 NodeTypeCode     : Int2B
   +0x002 NameLength       : Int2B
   +0x004 Unused           : Uint4B
   +0x008 NextPrefixTree   : Ptr64 to struct _UNICODE_PREFIX_TABLE_ENTRY, 7 elements, 0x38 bytes
   +0x010 LastNextEntry    : Ptr64 to struct _UNICODE_PREFIX_TABLE_ENTRY, 7 elements, 0x38 bytes
0:000> dt -v Rtl!_RTL_BITMAP_EX
struct _RTL_BITMAP_EX, 2 elements, 0x10 bytes
   +0x000 SizeOfBitMap     : Uint8B
   +0x008 Buffer           : Ptr64 to Uint8B
0:000> dt -v Rtl!_RTL_SPARSE_BITMAP_RANGE
struct _RTL_SPARSE_BITMAP_RANGE, 3 elements, 0x20 bytes
   +0x000 Lock             : struct _RTL_SRWLOCK, 1 elements, 0x8 bytes
   +0x008 Next             : struct _SINGLE_LIST_ENTRY, 1 elements, 0x8 bytes
   +0x010 RangeBitmap      : struct _RTL_BITMAP, 2 elements, 0x10 bytes
0:000> dt -v Rtl!_RTL_SPARSE_BITMAP_CTX
struct _RTL_SPARSE_BITMAP_CTX, 17 elements, 0x50 bytes
   +0x000 Lock             : struct _RTL_SRWLOCK, 1 elements, 0x8 bytes
   +0x008 BitmapRanges     : Ptr64 to Ptr64 to struct _RTL_SPARSE_BITMAP_RANGE, 3 elements, 0x20 bytes
   +0x010 RangeArrayCommitStatus : struct _RTL_BITMAP, 2 elements, 0x10 bytes
   +0x020 AllocationRoutine : Ptr64 to     void* 
   +0x028 FreeRoutine      : Ptr64 to     void 
   +0x030 RangeCount       : Uint4B
   +0x034 RangeIndexLimit  : Uint4B
   +0x038 RangeCountMax    : Uint4B
   +0x03c RangeMetadataOffset : Uint4B
   +0x040 MetadataSizePerBit : Uint4B
   +0x044 Padding1         : Uint4B
   +0x048 Flags            : union _RTL_SPARSE_BITMAP_CTX_FLAGS, 6 elements, 0x4 bytes
   +0x048 DefaultBitsSet   : Bitfield Pos 0, 1 Bit
   +0x048 SparseRangeArray : Bitfield Pos 1, 1 Bit
   +0x048 NoInternalLocking : Bitfield Pos 2, 1 Bit
   +0x048 SpareFlags       : Bitfield Pos 3, 29 Bits
   +0x04c Padding2         : Uint4B
0:000> dt -v Rtl!_RTL_PATH_LINK
struct _RTL_PATH_LINK, 6 elements, 0x50 bytes
   +0x000 Type             : Enum _RTL_PATH_LINK_TYPE,  5 total enums

   +0x004 Padding1         : [3] Uint4B
   +0x010 ListEntry        : struct _LIST_ENTRY, 2 elements, 0x10 bytes
   +0x010 SListEntry       : struct _SLIST_ENTRY, 1 elements, 0x10 bytes
   +0x010 PrefixTableEntry : struct _UNICODE_PREFIX_TABLE_ENTRY, 7 elements, 0x38 bytes
   +0x010 HashTableEntry   : struct _RTL_DYNAMIC_HASH_TABLE_ENTRY, 2 elements, 0x18 bytes
0:000> dt -v Rtl!_RTL_TEXT_FILE
struct _RTL_TEXT_FILE, 11 elements, 0x50 bytes
   +0x000 StructSizeInBytes : Uint4B
   +0x004 NumberOfLines    : Uint4B
   +0x008 Lines            : Ptr64 to struct _STRING, 5 elements, 0x10 bytes
   +0x010 CarriageReturnBitmap : Ptr64 to struct _RTL_BITMAP, 2 elements, 0x10 bytes
   +0x018 LineFeedBitmap   : Ptr64 to struct _RTL_BITMAP, 2 elements, 0x10 bytes
   +0x020 LineEndingBitmap : Ptr64 to struct _RTL_BITMAP, 2 elements, 0x10 bytes
   +0x028 LineBitmap       : Ptr64 to struct _RTL_BITMAP, 2 elements, 0x10 bytes
   +0x030 WhitespaceBitmap : Ptr64 to struct _RTL_BITMAP, 2 elements, 0x10 bytes
   +0x038 TabBitmap        : Ptr64 to struct _RTL_BITMAP, 2 elements, 0x10 bytes
   +0x040 IndentBitmap     : Ptr64 to struct _RTL_BITMAP, 2 elements, 0x10 bytes
   +0x048 TrailingWhitespaceBitmap : Ptr64 to struct _RTL_BITMAP, 2 elements, 0x10 bytes
0:000> dt -v Rtl!_RTL_IMAGE_FILE
struct _RTL_IMAGE_FILE, 10 elements, 0x40 bytes
   +0x000 PreferredBaseAddress : Ptr64 to Void
   +0x008 BaseAddress      : Ptr64 to Void
   +0x010 EntryPoint       : Ptr64 to Void
   +0x018 SizeOfImage      : Uint4B
   +0x01c HeaderSum        : Uint4B
   +0x020 CheckSum         : Uint4B
   +0x024 Timestamp        : Uint4B
   +0x028 PdbPath          : Ptr64 to struct _RTL_PATH, 18 elements, 0xc0 bytes
   +0x030 ModuleHandle     : Ptr64 to struct HINSTANCE__, 1 elements, 0x4 bytes
   +0x038 ModuleInfo       : Ptr64 to struct _IMAGEHLP_MODULEW64, 25 elements, 0xcc0 bytes
0:000> dt -v Rtl!_RTLFUNCTIONS
struct _RTLFUNCTIONS, 178 elements, 0x590 bytes
   +0x000 RtlCharToInteger : Ptr64 to     long 
   +0x008 RtlInitializeGenericTable : Ptr64 to     void 
   +0x010 RtlInsertElementGenericTable : Ptr64 to     void* 
   +0x018 RtlInsertElementGenericTableFull : Ptr64 to     void* 
   +0x020 RtlDeleteElementGenericTable : Ptr64 to     unsigned char 
   +0x028 RtlLookupElementGenericTable : Ptr64 to     void* 
   +0x030 RtlLookupElementGenericTableFull : Ptr64 to     void* 
   +0x038 RtlEnumerateGenericTable : Ptr64 to     void* 
   +0x040 RtlEnumerateGenericTableWithoutSplaying : Ptr64 to     void* 
   +0x048 RtlGetElementGenericTable : Ptr64 to     void* 
   +0x050 RtlNumberGenericTableElements : Ptr64 to     void* 
   +0x058 RtlIsGenericTableEmpty : Ptr64 to     unsigned char 
   +0x060 RtlInitializeGenericTableAvl : Ptr64 to     void 
   +0x068 RtlInsertElementGenericTableAvl : Ptr64 to     void* 
   +0x070 RtlInsertElementGenericTableFullAvl : Ptr64 to     void* 
   +0x078 RtlDeleteElementGenericTableAvl : Ptr64 to     unsigned char 
   +0x080 RtlLookupElementGenericTableAvl : Ptr64 to     void* 
   +0x088 RtlLookupElementGenericTableFullAvl : Ptr64 to     void* 
   +0x090 RtlEnumerateGenericTableAvl : Ptr64 to     void* 
   +0x098 RtlEnumerateGenericTableWithoutSplayingAvl : Ptr64 to     void* 
   +0x0a0 RtlLookupFirstMatchingElementGenericTableAvl : Ptr64 to     void* 
   +0x0a8 RtlEnumerateGenericTableLikeADirectory : Ptr64 to     void* 
   +0x0b0 RtlGetElementGenericTableAvl : Ptr64 to     void* 
   +0x0b8 RtlNumberGenericTableElementsAvl : Ptr64 to     void* 
   +0x0c0 RtlIsGenericTableEmptyAvl : Ptr64 to     unsigned char 
   +0x0c8 PfxInitialize    : Ptr64 to     void 
   +0x0d0 PfxInsertPrefix  : Ptr64 to     unsigned char 
   +0x0d8 PfxRemovePrefix  : Ptr64 to     void 
   +0x0e0 PfxFindPrefix    : Ptr64 to     _PREFIX_TABLE_ENTRY* 
   +0x0e8 RtlPrefixString  : Ptr64 to     unsigned char 
   +0x0f0 RtlPrefixUnicodeString : Ptr64 to     unsigned char 
   +0x0f8 RtlCreateHashTable : Ptr64 to     unsigned char 
   +0x100 RtlDeleteHashTable : Ptr64 to     void 
   +0x108 RtlInsertEntryHashTable : Ptr64 to     unsigned char 
   +0x110 RtlRemoveEntryHashTable : Ptr64 to     unsigned char 
   +0x118 RtlLookupEntryHashTable : Ptr64 to     _RTL_DYNAMIC_HASH_TABLE_ENTRY* 
   +0x120 RtlGetNextEntryHashTable : Ptr64 to     _RTL_DYNAMIC_HASH_TABLE_ENTRY* 
   +0x128 RtlEnumerateEntryHashTable : Ptr64 to     _RTL_DYNAMIC_HASH_TABLE_ENTRY* 
   +0x130 RtlEndEnumerationHashTable : Ptr64 to     void 
   +0x138 RtlInitWeakEnumerationHashTable : Ptr64 to     unsigned char 
   +0x140 RtlWeaklyEnumerateEntryHashTable : Ptr64 to     _RTL_DYNAMIC_HASH_TABLE_ENTRY* 
   +0x148 RtlEndWeakEnumerationHashTable : Ptr64 to     void 
   +0x150 RtlExpandHashTable : Ptr64 to     unsigned char 
   +0x158 RtlContractHashTable : Ptr64 to     unsigned char 
   +0x160 RtlInitializeBitMap : Ptr64 to     void 
   +0x168 RtlClearBit      : Ptr64 to     void 
   +0x170 RtlSetBit        : Ptr64 to     void 
   +0x178 RtlTestBit       : Ptr64 to     unsigned char 
   +0x180 RtlClearAllBits  : Ptr64 to     void 
   +0x188 RtlSetAllBits    : Ptr64 to     void 
   +0x190 RtlFindClearBits : Ptr64 to     unsigned long 
   +0x198 RtlFindSetBits   : Ptr64 to     unsigned long 
   +0x1a0 RtlFindClearBitsAndSet : Ptr64 to     unsigned long 
   +0x1a8 RtlFindSetBitsAndClear : Ptr64 to     unsigned long 
   +0x1b0 RtlClearBits     : Ptr64 to     void 
   +0x1b8 RtlSetBits       : Ptr64 to     void 
   +0x1c0 RtlFindClearRuns : Ptr64 to     unsigned long 
   +0x1c8 RtlFindLongestRunClear : Ptr64 to     unsigned long 
   +0x1d0 RtlNumberOfClearBits : Ptr64 to     unsigned long 
   +0x1d8 RtlNumberOfSetBits : Ptr64 to     unsigned long 
   +0x1e0 RtlAreBitsClear  : Ptr64 to     unsigned char 
   +0x1e8 RtlAreBitsSet    : Ptr64 to     unsigned char 
   +0x1f0 RtlFindFirstRunClear : Ptr64 to     unsigned long 
   +0x1f8 RtlFindNextForwardRunClear : Ptr64 to     unsigned long 
   +0x200 RtlFindLastBackwardRunClear : Ptr64 to     unsigned long 
   +0x208 RtlInitializeUnicodePrefix : Ptr64 to     void 
   +0x210 RtlInsertUnicodePrefix : Ptr64 to     unsigned char 
   +0x218 RtlRemoveUnicodePrefix : Ptr64 to     void 
   +0x220 RtlFindUnicodePrefix : Ptr64 to     _UNICODE_PREFIX_TABLE_ENTRY* 
   +0x228 RtlNextUnicodePrefix : Ptr64 to     _UNICODE_PREFIX_TABLE_ENTRY* 
   +0x230 RtlCopyUnicodeString : Ptr64 to     void 
   +0x238 RtlInitString    : Ptr64 to     void 
   +0x240 RtlCopyString    : Ptr64 to     void 
   +0x248 RtlAppendUnicodeToString : Ptr64 to     long 
   +0x250 RtlAppendUnicodeStringToString : Ptr64 to     long 
   +0x258 RtlUnicodeStringToAnsiSize : Ptr64 to     unsigned long 
   +0x260 RtlUnicodeStringToAnsiString : Ptr64 to     long 
   +0x268 RtlEqualString   : Ptr64 to     unsigned char 
   +0x270 RtlEqualUnicodeString : Ptr64 to     unsigned char 
   +0x278 RtlCompareString : Ptr64 to     long 
   +0x280 RtlCompareMemory : Ptr64 to     unsigned int64 
   +0x288 RtlPrefetchMemoryNonTemporal : Ptr64 to     void 
   +0x290 RtlMoveMemory    : Ptr64 to     void 
   +0x298 RtlCopyMemory    : Ptr64 to     void* 
   +0x2a0 RtlCopyMappedMemory : Ptr64 to     long 
   +0x2a8 RtlFillMemory    : Ptr64 to     void* 
   +0x2b0 RtlLocalTimeToSystemTime : Ptr64 to     unsigned char 
   +0x2b8 RtlTimeToSecondsSince1970 : Ptr64 to     unsigned char 
   +0x2c0 bsearch          : Ptr64 to     void* 
   +0x2c8 qsort            : Ptr64 to     void 
   +0x2d0 memset           : Ptr64 to     void* 
   +0x2d8 MmGetMaximumFileSectionSize : Ptr64 to     void* 
   +0x2e0 K32GetProcessMemoryInfo : Ptr64 to     int 
   +0x2e8 K32GetPerformanceInfo : Ptr64 to     int 
   +0x2f0 GetProcessIoCounters : Ptr64 to     int 
   +0x2f8 GetProcessHandleCount : Ptr64 to     int 
   +0x300 K32InitializeProcessForWsWatch : Ptr64 to     int 
   +0x308 K32GetWsChanges  : Ptr64 to     int 
   +0x310 K32GetWsChangesEx : Ptr64 to     int 
   +0x318 K32QueryWorkingSet : Ptr64 to     int 
   +0x320 K32QueryWorkingSetEx : Ptr64 to     int 
   +0x328 ZwQueryInformationProcess : Ptr64 to     long 
   +0x330 LdrRegisterDllNotification : Ptr64 to     long 
   +0x338 LdrUnregisterDllNotification : Ptr64 to     long 
   +0x340 LdrLockLoaderLock : Ptr64 to     long 
   +0x348 LdrUnlockLoaderLock : Ptr64 to     long 
   +0x350 ZwAllocateVirtualMemory : Ptr64 to     long 
   +0x358 ZwFreeVirtualMemory : Ptr64 to     long 
   +0x360 AllocateUserPhysicalPages : Ptr64 to     int 
   +0x368 AllocateUserPhysicalPagesNuma : Ptr64 to     int 
   +0x370 MapUserPhysicalPages : Ptr64 to     int 
   +0x378 MapUserPhysicalPagesScatter : Ptr64 to     int 
   +0x380 FreeUserPhysicalPages : Ptr64 to     int 
   +0x388 RtlCreateHeap    : Ptr64 to     void* 
   +0x390 RtlDestroyHeap   : Ptr64 to     void* 
   +0x398 RtlAllocateHeap  : Ptr64 to     void* 
   +0x3a0 RtlFreeHeap      : Ptr64 to     unsigned char 
   +0x3a8 RtlCaptureStackBackTrace : Ptr64 to     unsigned short 
   +0x3b0 RtlPcToFileHeader : Ptr64 to     void* 
   +0x3b8 RtlLookupFunctionEntry : Ptr64 to     _IMAGE_RUNTIME_FUNCTION_ENTRY* 
   +0x3c0 RtlAddFunctionTable : Ptr64 to     unsigned char 
   +0x3c8 RtlDeleteFunctionTable : Ptr64 to     unsigned char 
   +0x3d0 RtlInstallFunctionTableCallback : Ptr64 to     unsigned char 
   +0x3d8 RtlAddGrowableFunctionTable : Ptr64 to     unsigned long 
   +0x3e0 RtlGrowFunctionTable : Ptr64 to     void 
   +0x3e8 RtlDeleteGrowableFunctionTable : Ptr64 to     void 
   +0x3f0 ZwCreateSection  : Ptr64 to     long 
   +0x3f8 ZwMapViewOfSection : Ptr64 to     long 
   +0x400 ZwUnmapViewOfSection : Ptr64 to     long 
   +0x408 ZwCreateProcess  : Ptr64 to     long 
   +0x410 ZwCreateProcessEx : Ptr64 to     long 
   +0x418 ZwCreateThread   : Ptr64 to     long 
   +0x420 ZwOpenThread     : Ptr64 to     long 
   +0x428 ZwTerminateThread : Ptr64 to     long 
   +0x430 NtQueueApcThread : Ptr64 to     long 
   +0x438 NtTestAlert      : Ptr64 to     long 
   +0x440 SearchPathW      : Ptr64 to     unsigned long 
   +0x448 CreateToolhelp32Snapshot : Ptr64 to     void* 
   +0x450 LoadLibraryA     : Ptr64 to     HINSTANCE__* 
   +0x458 LoadLibraryW     : Ptr64 to     HINSTANCE__* 
   +0x460 LoadLibraryExW   : Ptr64 to     HINSTANCE__* 
   +0x468 GetProcAddress   : Ptr64 to     <function>* 
   +0x470 CloseHandle      : Ptr64 to     int 
   +0x478 OpenEventA       : Ptr64 to     void* 
   +0x480 OpenEventW       : Ptr64 to     void* 
   +0x488 GetLastError     : Ptr64 to     unsigned long 
   +0x490 SetLastError     : Ptr64 to     void 
   +0x498 SetEvent         : Ptr64 to     int 
   +0x4a0 ResetEvent       : Ptr64 to     int 
   +0x4a8 SuspendThread    : Ptr64 to     unsigned long 
   +0x4b0 ResumeThread     : Ptr64 to     unsigned long 
   +0x4b8 GetThreadContext : Ptr64 to     int 
   +0x4c0 SetThreadContext : Ptr64 to     int 
   +0x4c8 WaitForSingleObject : Ptr64 to     unsigned long 
   +0x4d0 WaitForSingleObjectEx : Ptr64 to     unsigned long 
   +0x4d8 SignalObjectAndWait : Ptr64 to     unsigned long 
   +0x4e0 SleepEx          : Ptr64 to     unsigned long 
   +0x4e8 ExitThread       : Ptr64 to     void 
   +0x4f0 GetExitCodeThread : Ptr64 to     int 
   +0x4f8 TerminateThread  : Ptr64 to     int 
   +0x500 QueueUserAPC     : Ptr64 to     unsigned long 
   +0x508 DeviceIoControl  : Ptr64 to     int 
   +0x510 GetModuleHandleA : Ptr64 to     HINSTANCE__* 
   +0x518 GetModuleHandleW : Ptr64 to     HINSTANCE__* 
   +0x520 CreateFileW      : Ptr64 to     void* 
   +0x528 CreateFileMappingW : Ptr64 to     void* 
   +0x530 OpenFileMappingW : Ptr64 to     void* 
   +0x538 MapViewOfFileEx  : Ptr64 to     void* 
   +0x540 FlushViewOfFile  : Ptr64 to     int 
   +0x548 UnmapViewOfFileEx : Ptr64 to     int 
   +0x550 VirtualAllocEx   : Ptr64 to     void* 
   +0x558 VirtualFreeEx    : Ptr64 to     int 
   +0x560 VirtualProtectEx : Ptr64 to     int 
   +0x568 VirtualQueryEx   : Ptr64 to     unsigned int64 
   +0x570 DebugActiveProcessStop : Ptr64 to     int 
   +0x578 DebugSetProcessKillOnExit : Ptr64 to     int 
   +0x580 Thread32First    : Ptr64 to     int 
   +0x588 Thread32Next     : Ptr64 to     int 
0:000> dt -v Rtl!_BITMAP_INDEX
struct _BITMAP_INDEX, 5 elements, 0x30 bytes
   +0x000 NumberOfUniqueChars : Uint2B
   +0x002 Alignment        : Uint2B
   +0x008 Forward          : struct _RTL_BITMAP, 2 elements, 0x10 bytes
   +0x018 Reverse          : struct _RTL_BITMAP, 2 elements, 0x10 bytes
   +0x028 Char             : [8] Char
0:000> dt -v Rtl!_STRINGEX
struct _STRINGEX, 6 elements, 0x48 bytes
   +0x000 NumberOfBitmapIndexes : Uint2B
   +0x008 String           : struct _STRING, 5 elements, 0x10 bytes
   +0x008 Length           : Uint2B
   +0x00a MaximumLength    : Uint2B
   +0x010 Buffer           : Ptr64 to Char
   +0x018 BitmapIndexes    : [1] struct _BITMAP_INDEX, 5 elements, 0x30 bytes
0:000> dt -v Rtl!_PAGE_COPY_TYPE
struct _PAGE_COPY_TYPE, 5 elements, 0x4 bytes
   +0x000 Movsb            : Bitfield Pos 0, 1 Bit
   +0x000 Movsw            : Bitfield Pos 1, 1 Bit
   +0x000 Movsq            : Bitfield Pos 2, 1 Bit
   +0x000 Avx2C            : Bitfield Pos 3, 1 Bit
   +0x000 Avx2NonTemporal  : Bitfield Pos 4, 1 Bit
0:000> dt -v Rtl!_DLL_NOTIFICATION_DATA
struct _DLL_NOTIFICATION_DATA, 5 elements, 0x20 bytes
   +0x000 LoaderDataTableEntry : Ptr64 to struct _LDR_DATA_TABLE_ENTRY, 17 elements, 0x88 bytes
   +0x008 NotificationData : Ptr64 to union _LDR_DLL_NOTIFICATION_DATA, 2 elements, 0x28 bytes
   +0x010 NumberOfStackBackTraceFrames : Uint4B
   +0x014 StackBackTraceHash : Uint4B
   +0x018 StackBackTrace   : Ptr64 to Void
0:000> dt -v Rtl!_DLL_NOTIFICATION_FLAGS
struct _DLL_NOTIFICATION_FLAGS, 1 elements, 0x4 bytes
   +0x000 Unused           : Bitfield Pos 0, 1 Bit
0:000> dt -v Rtl!_RTLEXFUNCTIONS
struct _RTLEXFUNCTIONS, 61 elements, 0x1e8 bytes
   +0x000 DestroyRtl       : Ptr64 to     void 
   +0x008 ArgvWToArgvA     : Ptr64 to     int 
   +0x010 CopyPagesMovsq   : Ptr64 to     void 
   +0x018 CopyPagesAvx2    : Ptr64 to     void 
   +0x020 CopyPagesMovsq_C : Ptr64 to     void 
   +0x028 CopyPagesAvx2_C  : Ptr64 to     void 
   +0x030 CopyToMemoryMappedMemory : Ptr64 to     void* 
   +0x038 CreateBitmapIndexForString : Ptr64 to     int 
   +0x040 CreateBitmapIndexForUnicodeString : Ptr64 to     int 
   +0x048 CurrentDirectoryToRtlPath : Ptr64 to     _RTL_PATH* 
   +0x050 CurrentDirectoryToUnicodeString : Ptr64 to     _UNICODE_STRING* 
   +0x058 DestroyPathEnvironmentVariable : Ptr64 to     void 
   +0x060 DestroyRtlPath   : Ptr64 to     int 
   +0x068 DisableCreateSymbolicLinkPrivilege : Ptr64 to     int 
   +0x070 DisableDebugPrivilege : Ptr64 to     int 
   +0x078 DisableIncreaseWorkingSetPrivilege : Ptr64 to     int 
   +0x080 DisableLockMemoryPrivilege : Ptr64 to     int 
   +0x088 DisableManageVolumePrivilege : Ptr64 to     int 
   +0x090 DisablePrivilege : Ptr64 to     int 
   +0x098 DisableProfileSingleProcessPrivilege : Ptr64 to     int 
   +0x0a0 DisableSystemProfilePrivilege : Ptr64 to     int 
   +0x0a8 EnableCreateSymbolicLinkPrivilege : Ptr64 to     int 
   +0x0b0 EnableDebugPrivilege : Ptr64 to     int 
   +0x0b8 EnableIncreaseWorkingSetPrivilege : Ptr64 to     int 
   +0x0c0 EnableLockMemoryPrivilege : Ptr64 to     int 
   +0x0c8 EnableManageVolumePrivilege : Ptr64 to     int 
   +0x0d0 EnablePrivilege  : Ptr64 to     int 
   +0x0d8 EnableProfileSingleProcessPrivilege : Ptr64 to     int 
   +0x0e0 EnableSystemProfilePrivilege : Ptr64 to     int 
   +0x0e8 FilesExistA      : Ptr64 to     int 
   +0x0f0 FilesExistW      : Ptr64 to     int 
   +0x0f8 FindCharsInString : Ptr64 to     int 
   +0x100 FindCharsInUnicodeString : Ptr64 to     int 
   +0x108 GetModuleRtlPath : Ptr64 to     int 
   +0x110 InitializeRtlFile : Ptr64 to     int 
   +0x118 LoadFile         : Ptr64 to     int 
   +0x120 LoadDbgEng       : Ptr64 to     int 
   +0x128 LoadDbgHelp      : Ptr64 to     int 
   +0x130 LoadPathEnvironmentVariable : Ptr64 to     _PATH_ENV_VAR* 
   +0x138 LoadShlwapi      : Ptr64 to     int 
   +0x140 PrefaultPages    : Ptr64 to     int 
   +0x148 RegisterDllNotification : Ptr64 to     int 
   +0x150 RtlCheckBit      : Ptr64 to     unsigned char 
   +0x158 RtlInitializeSplayLinks : Ptr64 to     void 
   +0x160 RtlInsertAsLeftChild : Ptr64 to     void 
   +0x168 RtlInsertAsRightChild : Ptr64 to     void 
   +0x170 RtlIsLeftChild   : Ptr64 to     unsigned char 
   +0x178 RtlIsRightChild  : Ptr64 to     unsigned char 
   +0x180 RtlIsRoot        : Ptr64 to     unsigned char 
   +0x188 RtlLeftChild     : Ptr64 to     _RTL_SPLAY_LINKS* 
   +0x190 RtlParent        : Ptr64 to     _RTL_SPLAY_LINKS* 
   +0x198 RtlRightChild    : Ptr64 to     _RTL_SPLAY_LINKS* 
   +0x1a0 SetPrivilege     : Ptr64 to     int 
   +0x1a8 StringToExistingRtlPath : Ptr64 to     int 
   +0x1b0 StringToRtlPath  : Ptr64 to     int 
   +0x1b8 TestExceptionHandler : Ptr64 to     int 
   +0x1c0 UnicodeStringToExistingRtlPath : Ptr64 to     int 
   +0x1c8 UnicodeStringToRtlPath : Ptr64 to     int 
   +0x1d0 UnregisterDllNotification : Ptr64 to     int 
   +0x1d8 WriteEnvVarToRegistry : Ptr64 to     int 
   +0x1e0 WriteRegistryString : Ptr64 to     int 
0:000> dt -v Rtl!_SHLWAPI_FUNCTIONS
struct _SHLWAPI_FUNCTIONS, 1 elements, 0x8 bytes
   +0x000 PathCanonicalizeA : Ptr64 to     int 
0:000> dt -v Rtl!_SYMINFO
struct _SYMINFO, 15 elements, 0x58 bytes
   +0x000 SizeOfStruct     : Uint4B
   +0x004 TypeIndex        : Enum SYM_TYPE,  10 total enums

   +0x008 Reserved         : [2] Uint8B
   +0x018 Index            : Uint4B
   +0x01c Size             : Uint4B
   +0x020 ModBase          : Uint8B
   +0x028 Flags            : Enum _SYMFLAG,  21 total enums

   +0x030 Value            : Uint8B
   +0x038 Address          : Uint8B
   +0x040 Register         : Uint4B
   +0x044 Scope            : Uint4B
   +0x048 Tag              : Uint4B
   +0x04c NameLen          : Uint4B
   +0x050 MaxNameLen       : Uint4B
   +0x054 Name             : [1] Char
0:000> dt -v Rtl!_DBG
struct _DBG, 169 elements, 0x548 bytes
   +0x000 EnumDirTree      : Ptr64 to     int 
   +0x008 EnumDirTreeW     : Ptr64 to     int 
   +0x010 EnumerateLoadedModules64 : Ptr64 to     int 
   +0x018 EnumerateLoadedModules : Ptr64 to     int 
   +0x020 EnumerateLoadedModulesEx : Ptr64 to     int 
   +0x028 EnumerateLoadedModulesExW : Ptr64 to     int 
   +0x030 EnumerateLoadedModulesW64 : Ptr64 to     int 
   +0x038 FindFileInPath   : Ptr64 to     int 
   +0x040 FindFileInSearchPath : Ptr64 to     int 
   +0x048 GetSymLoadError  : Ptr64 to     unsigned long 
   +0x050 GetTimestampForLoadedLibrary : Ptr64 to     unsigned long 
   +0x058 MakeSureDirectoryPathExists : Ptr64 to     int 
   +0x060 RangeMapAddPeImageSections : Ptr64 to     int 
   +0x068 RangeMapRead     : Ptr64 to     int 
   +0x070 RangeMapRemove   : Ptr64 to     int 
   +0x078 RangeMapWrite    : Ptr64 to     int 
   +0x080 ReportSymbolLoadSummary : Ptr64 to     int 
   +0x088 SearchTreeForFile : Ptr64 to     int 
   +0x090 SearchTreeForFileW : Ptr64 to     int 
   +0x098 StackWalk64      : Ptr64 to     int 
   +0x0a0 StackWalkEx      : Ptr64 to     int 
   +0x0a8 StackWalk        : Ptr64 to     int 
   +0x0b0 SymAddrIncludeInlineTrace : Ptr64 to     unsigned long 
   +0x0b8 SymAddSourceStreamA : Ptr64 to     int 
   +0x0c0 SymAddSourceStream : Ptr64 to     int 
   +0x0c8 SymAddSourceStreamW : Ptr64 to     int 
   +0x0d0 SymAddSymbol     : Ptr64 to     int 
   +0x0d8 SymAddSymbolW    : Ptr64 to     int 
   +0x0e0 SymCleanup       : Ptr64 to     int 
   +0x0e8 SymCompareInlineTrace : Ptr64 to     unsigned long 
   +0x0f0 SymDeleteSymbol  : Ptr64 to     int 
   +0x0f8 SymDeleteSymbolW : Ptr64 to     int 
   +0x100 SymEnumerateModules64 : Ptr64 to     int 
   +0x108 SymEnumerateModules : Ptr64 to     int 
   +0x110 SymEnumerateModulesW64 : Ptr64 to     int 
   +0x118 SymEnumerateSymbols64 : Ptr64 to     int 
   +0x120 SymEnumerateSymbols : Ptr64 to     int 
   +0x128 SymEnumerateSymbolsW64 : Ptr64 to     int 
   +0x130 SymEnumerateSymbolsW : Ptr64 to     int 
   +0x138 SymEnumLines     : Ptr64 to     int 
   +0x140 SymEnumLinesW    : Ptr64 to     int 
   +0x148 SymEnumProcesses : Ptr64 to     int 
   +0x150 SymEnumSourceFiles : Ptr64 to     int 
   +0x158 SymEnumSourceFilesW : Ptr64 to     int 
   +0x160 SymEnumSourceFileTokens : Ptr64 to     int 
   +0x168 SymEnumSourceLines : Ptr64 to     int 
   +0x170 SymEnumSourceLinesW : Ptr64 to     int 
   +0x178 SymEnumSymbolsEx : Ptr64 to     int 
   +0x180 SymEnumSymbolsExW : Ptr64 to     int 
   +0x188 SymEnumSymbolsForAddr : Ptr64 to     int 
   +0x190 SymEnumSymbolsForAddrW : Ptr64 to     int 
   +0x198 SymEnumSymbols   : Ptr64 to     int 
   +0x1a0 SymEnumSymbolsW  : Ptr64 to     int 
   +0x1a8 SymEnumSym       : Ptr64 to     int 
   +0x1b0 SymEnumTypesByName : Ptr64 to     int 
   +0x1b8 SymEnumTypesByNameW : Ptr64 to     int 
   +0x1c0 SymEnumTypes     : Ptr64 to     int 
   +0x1c8 SymEnumTypesW    : Ptr64 to     int 
   +0x1d0 SymFindFileInPath : Ptr64 to     int 
   +0x1d8 SymFindFileInPathW : Ptr64 to     int 
   +0x1e0 SymFromAddr      : Ptr64 to     int 
   +0x1e8 SymFromAddrW     : Ptr64 to     int 
   +0x1f0 SymFromIndex     : Ptr64 to     int 
   +0x1f8 SymFromIndexW    : Ptr64 to     int 
   +0x200 SymFromInlineContext : Ptr64 to     int 
   +0x208 SymFromInlineContextW : Ptr64 to     int 
   +0x210 SymFromName      : Ptr64 to     int 
   +0x218 SymFromNameW     : Ptr64 to     int 
   +0x220 SymFromToken     : Ptr64 to     int 
   +0x228 SymFromTokenW    : Ptr64 to     int 
   +0x230 SymGetFileLineOffsets64 : Ptr64 to     unsigned long 
   +0x238 SymGetLineFromAddr64 : Ptr64 to     int 
   +0x240 SymGetLineFromAddr : Ptr64 to     int 
   +0x248 SymGetLineFromAddrW64 : Ptr64 to     int 
   +0x250 SymGetLineFromInlineContext : Ptr64 to     int 
   +0x258 SymGetLineFromInlineContextW : Ptr64 to     int 
   +0x260 SymGetLineFromName64 : Ptr64 to     int 
   +0x268 SymGetLineFromName : Ptr64 to     int 
   +0x270 SymGetLineFromNameW64 : Ptr64 to     int 
   +0x278 SymGetLineNext64 : Ptr64 to     int 
   +0x280 SymGetLineNext   : Ptr64 to     int 
   +0x288 SymGetLineNextW64 : Ptr64 to     int 
   +0x290 SymGetLinePrev64 : Ptr64 to     int 
   +0x298 SymGetLinePrev   : Ptr64 to     int 
   +0x2a0 SymGetLinePrevW64 : Ptr64 to     int 
   +0x2a8 SymGetModuleBase : Ptr64 to     unsigned long 
   +0x2b0 SymGetModuleInfo64 : Ptr64 to     int 
   +0x2b8 SymGetModuleInfo : Ptr64 to     int 
   +0x2c0 SymGetModuleInfoW64 : Ptr64 to     int 
   +0x2c8 SymGetModuleInfoW : Ptr64 to     int 
   +0x2d0 SymGetOmaps      : Ptr64 to     int 
   +0x2d8 SymGetOptions    : Ptr64 to     unsigned long 
   +0x2e0 SymGetScope      : Ptr64 to     int 
   +0x2e8 SymGetScopeW     : Ptr64 to     int 
   +0x2f0 SymGetSearchPath : Ptr64 to     int 
   +0x2f8 SymGetSearchPathW : Ptr64 to     int 
   +0x300 SymGetSourceFileFromToken : Ptr64 to     int 
   +0x308 SymGetSourceFileFromTokenW : Ptr64 to     int 
   +0x310 SymGetSourceFile : Ptr64 to     int 
   +0x318 SymGetSourceFileToken : Ptr64 to     int 
   +0x320 SymGetSourceFileTokenW : Ptr64 to     int 
   +0x328 SymGetSourceFileW : Ptr64 to     int 
   +0x330 SymGetSourceVarFromToken : Ptr64 to     int 
   +0x338 SymGetSourceVarFromTokenW : Ptr64 to     int 
   +0x340 SymGetSymbolFile : Ptr64 to     int 
   +0x348 SymGetSymbolFileW : Ptr64 to     int 
   +0x350 SymGetSymFromAddr64 : Ptr64 to     int 
   +0x358 SymGetSymFromAddr : Ptr64 to     int 
   +0x360 SymGetSymFromName64 : Ptr64 to     int 
   +0x368 SymGetSymFromName : Ptr64 to     int 
   +0x370 SymGetSymNext64  : Ptr64 to     int 
   +0x378 SymGetSymNext    : Ptr64 to     int 
   +0x380 SymGetSymPrev64  : Ptr64 to     int 
   +0x388 SymGetSymPrev    : Ptr64 to     int 
   +0x390 SymGetTypeFromName : Ptr64 to     int 
   +0x398 SymGetTypeFromNameW : Ptr64 to     int 
   +0x3a0 SymGetTypeInfoEx : Ptr64 to     int 
   +0x3a8 SymGetTypeInfo   : Ptr64 to     int 
   +0x3b0 SymGetUnwindInfo : Ptr64 to     int 
   +0x3b8 SymInitialize    : Ptr64 to     int 
   +0x3c0 SymInitializeW   : Ptr64 to     int 
   +0x3c8 SymLoadModule    : Ptr64 to     unsigned long 
   +0x3d0 SymLoadModuleEx  : Ptr64 to     unsigned int64 
   +0x3d8 SymLoadModuleExW : Ptr64 to     unsigned int64 
   +0x3e0 SymMatchFileName : Ptr64 to     int 
   +0x3e8 SymMatchFileNameW : Ptr64 to     int 
   +0x3f0 SymMatchStringA  : Ptr64 to     int 
   +0x3f8 SymMatchString   : Ptr64 to     int 
   +0x400 SymMatchStringW  : Ptr64 to     int 
   +0x408 SymNext          : Ptr64 to     int 
   +0x410 SymNextW         : Ptr64 to     int 
   +0x418 SymPrev          : Ptr64 to     int 
   +0x420 SymPrevW         : Ptr64 to     int 
   +0x428 SymQueryInlineTrace : Ptr64 to     int 
   +0x430 SymRefreshModuleList : Ptr64 to     int 
   +0x438 SymRegisterCallback64 : Ptr64 to     int 
   +0x440 SymRegisterCallback : Ptr64 to     int 
   +0x448 SymRegisterCallbackW64 : Ptr64 to     int 
   +0x450 SymRegisterFunctionEntryCallback64 : Ptr64 to     int 
   +0x458 SymRegisterFunctionEntryCallback : Ptr64 to     int 
   +0x460 SymSearch        : Ptr64 to     int 
   +0x468 SymSearchW       : Ptr64 to     int 
   +0x470 SymSetContext    : Ptr64 to     int 
   +0x478 SymSetOptions    : Ptr64 to     unsigned long 
   +0x480 SymSetParentWindow : Ptr64 to     int 
   +0x488 SymSetScopeFromAddr : Ptr64 to     int 
   +0x490 SymSetScopeFromIndex : Ptr64 to     int 
   +0x498 SymSetScopeFromInlineContext : Ptr64 to     int 
   +0x4a0 SymSetSearchPath : Ptr64 to     int 
   +0x4a8 SymSetSearchPathW : Ptr64 to     int 
   +0x4b0 SymSrvGetFileIndexes : Ptr64 to     int 
   +0x4b8 SymSrvGetFileIndexesW : Ptr64 to     int 
   +0x4c0 SymSrvGetFileIndexInfo : Ptr64 to     int 
   +0x4c8 SymSrvGetFileIndexInfoW : Ptr64 to     int 
   +0x4d0 SymSrvGetFileIndexString : Ptr64 to     int 
   +0x4d8 SymSrvGetFileIndexStringW : Ptr64 to     int 
   +0x4e0 SymSrvIsStore    : Ptr64 to     int 
   +0x4e8 SymSrvIsStoreW   : Ptr64 to     int 
   +0x4f0 SymUnDName64     : Ptr64 to     int 
   +0x4f8 SymUnDName       : Ptr64 to     int 
   +0x500 SymUnloadModule64 : Ptr64 to     int 
   +0x508 SymUnloadModule  : Ptr64 to     int 
   +0x510 UnDecorateSymbolName : Ptr64 to     unsigned long 
   +0x518 UnDecorateSymbolNameW : Ptr64 to     unsigned long 
   +0x520 ImageNtHeader    : Ptr64 to     _IMAGE_NT_HEADERS64* 
   +0x528 ImageDirectoryEntryToData : Ptr64 to     void* 
   +0x530 ImageDirectoryEntryToDataEx : Ptr64 to     void* 
   +0x538 ImageRvaToSection : Ptr64 to     _IMAGE_SECTION_HEADER* 
   +0x540 ImageRvaToV      : Ptr64 to     void* 
0:000> dt -v Rtl!_DBGENG
struct _DBGENG, 1 elements, 0x8 bytes
   +0x000 DebugCreate      : Ptr64 to     HRESULT 
0:000> dt -v Rtl!_IUNKNOWN_VTBL
struct _IUNKNOWN_VTBL, 3 elements, 0x18 bytes
   +0x000 QueryInterface   : Ptr64 to     HRESULT 
   +0x008 AddRef           : Ptr64 to     unsigned long 
   +0x010 Release          : Ptr64 to     unsigned long 
0:000> dt -v Rtl!_IUNKNOWN
struct _IUNKNOWN, 1 elements, 0x8 bytes
   +0x000 lpVtbl           : Ptr64 to struct _IUNKNOWN_VTBL, 3 elements, 0x18 bytes
0:000> dt -v Rtl!_ICLASS_FACTORY_VTBL
struct _ICLASS_FACTORY_VTBL, 5 elements, 0x28 bytes
   +0x000 QueryInterface   : Ptr64 to     HRESULT 
   +0x008 AddRef           : Ptr64 to     unsigned long 
   +0x010 Release          : Ptr64 to     unsigned long 
   +0x018 CreateInstance   : Ptr64 to     HRESULT 
   +0x020 LockServer       : Ptr64 to     HRESULT 
0:000> dt -v Rtl!_RTL
struct _RTL, 483 elements, 0x1020 bytes
   +0x000 SizeOfStruct     : Uint4B
   +0x004 Flags            : union _RTL_FLAGS, 7 elements, 0x4 bytes
   +0x008 NtdllModule      : Ptr64 to struct HINSTANCE__, 1 elements, 0x4 bytes
   +0x010 Kernel32Module   : Ptr64 to struct HINSTANCE__, 1 elements, 0x4 bytes
   +0x018 KernelBaseModule : Ptr64 to struct HINSTANCE__, 1 elements, 0x4 bytes
   +0x020 NtosKrnlModule   : Ptr64 to struct HINSTANCE__, 1 elements, 0x4 bytes
   +0x028 ShlwapiModule    : Ptr64 to struct HINSTANCE__, 1 elements, 0x4 bytes
   +0x030 Ole32Module      : Ptr64 to struct HINSTANCE__, 1 elements, 0x4 bytes
   +0x038 DbgHelpModule    : Ptr64 to struct HINSTANCE__, 1 elements, 0x4 bytes
   +0x040 DbgEngModule     : Ptr64 to struct HINSTANCE__, 1 elements, 0x4 bytes
   +0x048 InjectionThunkModule : Ptr64 to struct HINSTANCE__, 1 elements, 0x4 bytes
   +0x050 NvcudaModule     : Ptr64 to struct HINSTANCE__, 1 elements, 0x4 bytes
   +0x058 Crypt32Module    : Ptr64 to struct HINSTANCE__, 1 elements, 0x4 bytes
   +0x060 InitializeCom    : Ptr64 to     int 
   +0x068 CoInitializeEx   : Ptr64 to     HRESULT 
   +0x070 GetCu            : Ptr64 to     int 
   +0x078 Cu               : Ptr64 to struct _CU, 58 elements, 0x1b8 bytes
   +0x080 LastError        : Uint4B
   +0x084 Padding          : Uint4B
   +0x088 LargePageMinimum : Uint8B
   +0x090 LargePageAllocator : Ptr64 to struct _ALLOCATOR, 28 elements, 0x90 bytes
   +0x098 TryLargePageVirtualAlloc : Ptr64 to     void* 
   +0x0a0 TryLargePageVirtualAllocEx : Ptr64 to     void* 
   +0x0a8 MapViewOfFileExNuma : Ptr64 to     void* 
   +0x0b0 MapViewOfFileNuma2 : Ptr64 to     void* 
   +0x0b8 TryMapViewOfFileNuma2 : Ptr64 to     void* 
   +0x0c0 atexit           : Ptr64 to     int 
   +0x0c8 AtExitEx         : Ptr64 to     int 
   +0x0d0 RundownGlobalAtExitFunctions : Ptr64 to     void 
   +0x0d8 CopyPages        : Ptr64 to     void 
   +0x0e0 FillPages        : Ptr64 to     void 
   +0x0e8 ProbeForRead     : Ptr64 to     int 
   +0x0f0 CreateNamedEvent : Ptr64 to     int 
   +0x0f8 __C_specific_handler : Ptr64 to     _EXCEPTION_DISPOSITION 
   +0x100 __security_init_cookie : Ptr64 to     void 
   +0x108 MaximumFileSectionSize : Ptr64 to Void
   +0x110 LoaderNotificationTable : Ptr64 to struct _RTL_LDR_NOTIFICATION_TABLE, 9 elements, 0x60 bytes
   +0x118 HeapHandle       : Ptr64 to Void
   +0x120 Frequency        : union _LARGE_INTEGER, 4 elements, 0x8 bytes
   +0x128 Multiplicand     : union _LARGE_INTEGER, 4 elements, 0x8 bytes
   +0x130 WindowsDirectory : struct _UNICODE_STRING, 5 elements, 0x10 bytes
   +0x140 WindowsSxSDirectory : struct _UNICODE_STRING, 5 elements, 0x10 bytes
   +0x150 WindowsSystemDirectory : struct _UNICODE_STRING, 5 elements, 0x10 bytes
   +0x160 CryptProv        : Uint8B
   +0x168 CryptGenRandom   : Ptr64 to     int 
   +0x170 CryptBinaryToStringA : Ptr64 to     int 
   +0x178 CryptBinaryToStringW : Ptr64 to     int 
   +0x180 OutputDebugStringA : Ptr64 to     void 
   +0x188 OutputDebugStringW : Ptr64 to     void 
   +0x190 CreateEventA     : Ptr64 to     void* 
   +0x198 CreateEventW     : Ptr64 to     void* 
   +0x1a0 RtlDllPath       : struct _UNICODE_STRING, 5 elements, 0x10 bytes
   +0x1b0 SetDllPath       : Ptr64 to     int 
   +0x1b8 InjectionThunkDllPath : struct _UNICODE_STRING, 5 elements, 0x10 bytes
   +0x1c8 SetInjectionThunkDllPath : Ptr64 to     int 
   +0x1d0 CopyFunction     : Ptr64 to     int 
   +0x1d8 CreateRandomObjectNames : Ptr64 to     int 
   +0x1e0 CreateSingleRandomObjectName : Ptr64 to     int 
   +0x1e8 InjectionThunkRoutine : Ptr64 to Void
   +0x1f0 Inject           : Ptr64 to     int 
   +0x1f8 InitializeInjection : Ptr64 to     int 
   +0x200 AdjustThunkPointers : Ptr64 to     int 
   +0x208 InjectionFunctions : struct _INJECTION_FUNCTIONS, 37 elements, 0x128 bytes
   +0x330 SystemTimerFunction : struct _SYSTEM_TIMER_FUNCTION, 2 elements, 0x10 bytes
   +0x330 GetSystemTimePreciseAsFileTime : Ptr64 to     void 
   +0x338 NtQuerySystemTime : Ptr64 to     long 
   +0x340 RtlFunctions     : struct _RTLFUNCTIONS, 178 elements, 0x590 bytes
   +0x340 RtlCharToInteger : Ptr64 to     long 
   +0x348 RtlInitializeGenericTable : Ptr64 to     void 
   +0x350 RtlInsertElementGenericTable : Ptr64 to     void* 
   +0x358 RtlInsertElementGenericTableFull : Ptr64 to     void* 
   +0x360 RtlDeleteElementGenericTable : Ptr64 to     unsigned char 
   +0x368 RtlLookupElementGenericTable : Ptr64 to     void* 
   +0x370 RtlLookupElementGenericTableFull : Ptr64 to     void* 
   +0x378 RtlEnumerateGenericTable : Ptr64 to     void* 
   +0x380 RtlEnumerateGenericTableWithoutSplaying : Ptr64 to     void* 
   +0x388 RtlGetElementGenericTable : Ptr64 to     void* 
   +0x390 RtlNumberGenericTableElements : Ptr64 to     void* 
   +0x398 RtlIsGenericTableEmpty : Ptr64 to     unsigned char 
   +0x3a0 RtlInitializeGenericTableAvl : Ptr64 to     void 
   +0x3a8 RtlInsertElementGenericTableAvl : Ptr64 to     void* 
   +0x3b0 RtlInsertElementGenericTableFullAvl : Ptr64 to     void* 
   +0x3b8 RtlDeleteElementGenericTableAvl : Ptr64 to     unsigned char 
   +0x3c0 RtlLookupElementGenericTableAvl : Ptr64 to     void* 
   +0x3c8 RtlLookupElementGenericTableFullAvl : Ptr64 to     void* 
   +0x3d0 RtlEnumerateGenericTableAvl : Ptr64 to     void* 
   +0x3d8 RtlEnumerateGenericTableWithoutSplayingAvl : Ptr64 to     void* 
   +0x3e0 RtlLookupFirstMatchingElementGenericTableAvl : Ptr64 to     void* 
   +0x3e8 RtlEnumerateGenericTableLikeADirectory : Ptr64 to     void* 
   +0x3f0 RtlGetElementGenericTableAvl : Ptr64 to     void* 
   +0x3f8 RtlNumberGenericTableElementsAvl : Ptr64 to     void* 
   +0x400 RtlIsGenericTableEmptyAvl : Ptr64 to     unsigned char 
   +0x408 PfxInitialize    : Ptr64 to     void 
   +0x410 PfxInsertPrefix  : Ptr64 to     unsigned char 
   +0x418 PfxRemovePrefix  : Ptr64 to     void 
   +0x420 PfxFindPrefix    : Ptr64 to     _PREFIX_TABLE_ENTRY* 
   +0x428 RtlPrefixString  : Ptr64 to     unsigned char 
   +0x430 RtlPrefixUnicodeString : Ptr64 to     unsigned char 
   +0x438 RtlCreateHashTable : Ptr64 to     unsigned char 
   +0x440 RtlDeleteHashTable : Ptr64 to     void 
   +0x448 RtlInsertEntryHashTable : Ptr64 to     unsigned char 
   +0x450 RtlRemoveEntryHashTable : Ptr64 to     unsigned char 
   +0x458 RtlLookupEntryHashTable : Ptr64 to     _RTL_DYNAMIC_HASH_TABLE_ENTRY* 
   +0x460 RtlGetNextEntryHashTable : Ptr64 to     _RTL_DYNAMIC_HASH_TABLE_ENTRY* 
   +0x468 RtlEnumerateEntryHashTable : Ptr64 to     _RTL_DYNAMIC_HASH_TABLE_ENTRY* 
   +0x470 RtlEndEnumerationHashTable : Ptr64 to     void 
   +0x478 RtlInitWeakEnumerationHashTable : Ptr64 to     unsigned char 
   +0x480 RtlWeaklyEnumerateEntryHashTable : Ptr64 to     _RTL_DYNAMIC_HASH_TABLE_ENTRY* 
   +0x488 RtlEndWeakEnumerationHashTable : Ptr64 to     void 
   +0x490 RtlExpandHashTable : Ptr64 to     unsigned char 
   +0x498 RtlContractHashTable : Ptr64 to     unsigned char 
   +0x4a0 RtlInitializeBitMap : Ptr64 to     void 
   +0x4a8 RtlClearBit      : Ptr64 to     void 
   +0x4b0 RtlSetBit        : Ptr64 to     void 
   +0x4b8 RtlTestBit       : Ptr64 to     unsigned char 
   +0x4c0 RtlClearAllBits  : Ptr64 to     void 
   +0x4c8 RtlSetAllBits    : Ptr64 to     void 
   +0x4d0 RtlFindClearBits : Ptr64 to     unsigned long 
   +0x4d8 RtlFindSetBits   : Ptr64 to     unsigned long 
   +0x4e0 RtlFindClearBitsAndSet : Ptr64 to     unsigned long 
   +0x4e8 RtlFindSetBitsAndClear : Ptr64 to     unsigned long 
   +0x4f0 RtlClearBits     : Ptr64 to     void 
   +0x4f8 RtlSetBits       : Ptr64 to     void 
   +0x500 RtlFindClearRuns : Ptr64 to     unsigned long 
   +0x508 RtlFindLongestRunClear : Ptr64 to     unsigned long 
   +0x510 RtlNumberOfClearBits : Ptr64 to     unsigned long 
   +0x518 RtlNumberOfSetBits : Ptr64 to     unsigned long 
   +0x520 RtlAreBitsClear  : Ptr64 to     unsigned char 
   +0x528 RtlAreBitsSet    : Ptr64 to     unsigned char 
   +0x530 RtlFindFirstRunClear : Ptr64 to     unsigned long 
   +0x538 RtlFindNextForwardRunClear : Ptr64 to     unsigned long 
   +0x540 RtlFindLastBackwardRunClear : Ptr64 to     unsigned long 
   +0x548 RtlInitializeUnicodePrefix : Ptr64 to     void 
   +0x550 RtlInsertUnicodePrefix : Ptr64 to     unsigned char 
   +0x558 RtlRemoveUnicodePrefix : Ptr64 to     void 
   +0x560 RtlFindUnicodePrefix : Ptr64 to     _UNICODE_PREFIX_TABLE_ENTRY* 
   +0x568 RtlNextUnicodePrefix : Ptr64 to     _UNICODE_PREFIX_TABLE_ENTRY* 
   +0x570 RtlCopyUnicodeString : Ptr64 to     void 
   +0x578 RtlInitString    : Ptr64 to     void 
   +0x580 RtlCopyString    : Ptr64 to     void 
   +0x588 RtlAppendUnicodeToString : Ptr64 to     long 
   +0x590 RtlAppendUnicodeStringToString : Ptr64 to     long 
   +0x598 RtlUnicodeStringToAnsiSize : Ptr64 to     unsigned long 
   +0x5a0 RtlUnicodeStringToAnsiString : Ptr64 to     long 
   +0x5a8 RtlEqualString   : Ptr64 to     unsigned char 
   +0x5b0 RtlEqualUnicodeString : Ptr64 to     unsigned char 
   +0x5b8 RtlCompareString : Ptr64 to     long 
   +0x5c0 RtlCompareMemory : Ptr64 to     unsigned int64 
   +0x5c8 RtlPrefetchMemoryNonTemporal : Ptr64 to     void 
   +0x5d0 RtlMoveMemory    : Ptr64 to     void 
   +0x5d8 RtlCopyMemory    : Ptr64 to     void* 
   +0x5e0 RtlCopyMappedMemory : Ptr64 to     long 
   +0x5e8 RtlFillMemory    : Ptr64 to     void* 
   +0x5f0 RtlLocalTimeToSystemTime : Ptr64 to     unsigned char 
   +0x5f8 RtlTimeToSecondsSince1970 : Ptr64 to     unsigned char 
   +0x600 bsearch          : Ptr64 to     void* 
   +0x608 qsort            : Ptr64 to     void 
   +0x610 memset           : Ptr64 to     void* 
   +0x618 MmGetMaximumFileSectionSize : Ptr64 to     void* 
   +0x620 K32GetProcessMemoryInfo : Ptr64 to     int 
   +0x628 K32GetPerformanceInfo : Ptr64 to     int 
   +0x630 GetProcessIoCounters : Ptr64 to     int 
   +0x638 GetProcessHandleCount : Ptr64 to     int 
   +0x640 K32InitializeProcessForWsWatch : Ptr64 to     int 
   +0x648 K32GetWsChanges  : Ptr64 to     int 
   +0x650 K32GetWsChangesEx : Ptr64 to     int 
   +0x658 K32QueryWorkingSet : Ptr64 to     int 
   +0x660 K32QueryWorkingSetEx : Ptr64 to     int 
   +0x668 ZwQueryInformationProcess : Ptr64 to     long 
   +0x670 LdrRegisterDllNotification : Ptr64 to     long 
   +0x678 LdrUnregisterDllNotification : Ptr64 to     long 
   +0x680 LdrLockLoaderLock : Ptr64 to     long 
   +0x688 LdrUnlockLoaderLock : Ptr64 to     long 
   +0x690 ZwAllocateVirtualMemory : Ptr64 to     long 
   +0x698 ZwFreeVirtualMemory : Ptr64 to     long 
   +0x6a0 AllocateUserPhysicalPages : Ptr64 to     int 
   +0x6a8 AllocateUserPhysicalPagesNuma : Ptr64 to     int 
   +0x6b0 MapUserPhysicalPages : Ptr64 to     int 
   +0x6b8 MapUserPhysicalPagesScatter : Ptr64 to     int 
   +0x6c0 FreeUserPhysicalPages : Ptr64 to     int 
   +0x6c8 RtlCreateHeap    : Ptr64 to     void* 
   +0x6d0 RtlDestroyHeap   : Ptr64 to     void* 
   +0x6d8 RtlAllocateHeap  : Ptr64 to     void* 
   +0x6e0 RtlFreeHeap      : Ptr64 to     unsigned char 
   +0x6e8 RtlCaptureStackBackTrace : Ptr64 to     unsigned short 
   +0x6f0 RtlPcToFileHeader : Ptr64 to     void* 
   +0x6f8 RtlLookupFunctionEntry : Ptr64 to     _IMAGE_RUNTIME_FUNCTION_ENTRY* 
   +0x700 RtlAddFunctionTable : Ptr64 to     unsigned char 
   +0x708 RtlDeleteFunctionTable : Ptr64 to     unsigned char 
   +0x710 RtlInstallFunctionTableCallback : Ptr64 to     unsigned char 
   +0x718 RtlAddGrowableFunctionTable : Ptr64 to     unsigned long 
   +0x720 RtlGrowFunctionTable : Ptr64 to     void 
   +0x728 RtlDeleteGrowableFunctionTable : Ptr64 to     void 
   +0x730 ZwCreateSection  : Ptr64 to     long 
   +0x738 ZwMapViewOfSection : Ptr64 to     long 
   +0x740 ZwUnmapViewOfSection : Ptr64 to     long 
   +0x748 ZwCreateProcess  : Ptr64 to     long 
   +0x750 ZwCreateProcessEx : Ptr64 to     long 
   +0x758 ZwCreateThread   : Ptr64 to     long 
   +0x760 ZwOpenThread     : Ptr64 to     long 
   +0x768 ZwTerminateThread : Ptr64 to     long 
   +0x770 NtQueueApcThread : Ptr64 to     long 
   +0x778 NtTestAlert      : Ptr64 to     long 
   +0x780 SearchPathW      : Ptr64 to     unsigned long 
   +0x788 CreateToolhelp32Snapshot : Ptr64 to     void* 
   +0x790 LoadLibraryA     : Ptr64 to     HINSTANCE__* 
   +0x798 LoadLibraryW     : Ptr64 to     HINSTANCE__* 
   +0x7a0 LoadLibraryExW   : Ptr64 to     HINSTANCE__* 
   +0x7a8 GetProcAddress   : Ptr64 to     <function>* 
   +0x7b0 CloseHandle      : Ptr64 to     int 
   +0x7b8 OpenEventA       : Ptr64 to     void* 
   +0x7c0 OpenEventW       : Ptr64 to     void* 
   +0x7c8 GetLastError     : Ptr64 to     unsigned long 
   +0x7d0 SetLastError     : Ptr64 to     void 
   +0x7d8 SetEvent         : Ptr64 to     int 
   +0x7e0 ResetEvent       : Ptr64 to     int 
   +0x7e8 SuspendThread    : Ptr64 to     unsigned long 
   +0x7f0 ResumeThread     : Ptr64 to     unsigned long 
   +0x7f8 GetThreadContext : Ptr64 to     int 
   +0x800 SetThreadContext : Ptr64 to     int 
   +0x808 WaitForSingleObject : Ptr64 to     unsigned long 
   +0x810 WaitForSingleObjectEx : Ptr64 to     unsigned long 
   +0x818 SignalObjectAndWait : Ptr64 to     unsigned long 
   +0x820 SleepEx          : Ptr64 to     unsigned long 
   +0x828 ExitThread       : Ptr64 to     void 
   +0x830 GetExitCodeThread : Ptr64 to     int 
   +0x838 TerminateThread  : Ptr64 to     int 
   +0x840 QueueUserAPC     : Ptr64 to     unsigned long 
   +0x848 DeviceIoControl  : Ptr64 to     int 
   +0x850 GetModuleHandleA : Ptr64 to     HINSTANCE__* 
   +0x858 GetModuleHandleW : Ptr64 to     HINSTANCE__* 
   +0x860 CreateFileW      : Ptr64 to     void* 
   +0x868 CreateFileMappingW : Ptr64 to     void* 
   +0x870 OpenFileMappingW : Ptr64 to     void* 
   +0x878 MapViewOfFileEx  : Ptr64 to     void* 
   +0x880 FlushViewOfFile  : Ptr64 to     int 
   +0x888 UnmapViewOfFileEx : Ptr64 to     int 
   +0x890 VirtualAllocEx   : Ptr64 to     void* 
   +0x898 VirtualFreeEx    : Ptr64 to     int 
   +0x8a0 VirtualProtectEx : Ptr64 to     int 
   +0x8a8 VirtualQueryEx   : Ptr64 to     unsigned int64 
   +0x8b0 DebugActiveProcessStop : Ptr64 to     int 
   +0x8b8 DebugSetProcessKillOnExit : Ptr64 to     int 
   +0x8c0 Thread32First    : Ptr64 to     int 
   +0x8c8 Thread32Next     : Ptr64 to     int 
   +0x8d0 RtlExFunctions   : struct _RTLEXFUNCTIONS, 61 elements, 0x1e8 bytes
   +0x8d0 DestroyRtl       : Ptr64 to     void 
   +0x8d8 ArgvWToArgvA     : Ptr64 to     int 
   +0x8e0 CopyPagesMovsq   : Ptr64 to     void 
   +0x8e8 CopyPagesAvx2    : Ptr64 to     void 
   +0x8f0 CopyPagesMovsq_C : Ptr64 to     void 
   +0x8f8 CopyPagesAvx2_C  : Ptr64 to     void 
   +0x900 CopyToMemoryMappedMemory : Ptr64 to     void* 
   +0x908 CreateBitmapIndexForString : Ptr64 to     int 
   +0x910 CreateBitmapIndexForUnicodeString : Ptr64 to     int 
   +0x918 CurrentDirectoryToRtlPath : Ptr64 to     _RTL_PATH* 
   +0x920 CurrentDirectoryToUnicodeString : Ptr64 to     _UNICODE_STRING* 
   +0x928 DestroyPathEnvironmentVariable : Ptr64 to     void 
   +0x930 DestroyRtlPath   : Ptr64 to     int 
   +0x938 DisableCreateSymbolicLinkPrivilege : Ptr64 to     int 
   +0x940 DisableDebugPrivilege : Ptr64 to     int 
   +0x948 DisableIncreaseWorkingSetPrivilege : Ptr64 to     int 
   +0x950 DisableLockMemoryPrivilege : Ptr64 to     int 
   +0x958 DisableManageVolumePrivilege : Ptr64 to     int 
   +0x960 DisablePrivilege : Ptr64 to     int 
   +0x968 DisableProfileSingleProcessPrivilege : Ptr64 to     int 
   +0x970 DisableSystemProfilePrivilege : Ptr64 to     int 
   +0x978 EnableCreateSymbolicLinkPrivilege : Ptr64 to     int 
   +0x980 EnableDebugPrivilege : Ptr64 to     int 
   +0x988 EnableIncreaseWorkingSetPrivilege : Ptr64 to     int 
   +0x990 EnableLockMemoryPrivilege : Ptr64 to     int 
   +0x998 EnableManageVolumePrivilege : Ptr64 to     int 
   +0x9a0 EnablePrivilege  : Ptr64 to     int 
   +0x9a8 EnableProfileSingleProcessPrivilege : Ptr64 to     int 
   +0x9b0 EnableSystemProfilePrivilege : Ptr64 to     int 
   +0x9b8 FilesExistA      : Ptr64 to     int 
   +0x9c0 FilesExistW      : Ptr64 to     int 
   +0x9c8 FindCharsInString : Ptr64 to     int 
   +0x9d0 FindCharsInUnicodeString : Ptr64 to     int 
   +0x9d8 GetModuleRtlPath : Ptr64 to     int 
   +0x9e0 InitializeRtlFile : Ptr64 to     int 
   +0x9e8 LoadFile         : Ptr64 to     int 
   +0x9f0 LoadDbgEng       : Ptr64 to     int 
   +0x9f8 LoadDbgHelp      : Ptr64 to     int 
   +0xa00 LoadPathEnvironmentVariable : Ptr64 to     _PATH_ENV_VAR* 
   +0xa08 LoadShlwapi      : Ptr64 to     int 
   +0xa10 PrefaultPages    : Ptr64 to     int 
   +0xa18 RegisterDllNotification : Ptr64 to     int 
   +0xa20 RtlCheckBit      : Ptr64 to     unsigned char 
   +0xa28 RtlInitializeSplayLinks : Ptr64 to     void 
   +0xa30 RtlInsertAsLeftChild : Ptr64 to     void 
   +0xa38 RtlInsertAsRightChild : Ptr64 to     void 
   +0xa40 RtlIsLeftChild   : Ptr64 to     unsigned char 
   +0xa48 RtlIsRightChild  : Ptr64 to     unsigned char 
   +0xa50 RtlIsRoot        : Ptr64 to     unsigned char 
   +0xa58 RtlLeftChild     : Ptr64 to     _RTL_SPLAY_LINKS* 
   +0xa60 RtlParent        : Ptr64 to     _RTL_SPLAY_LINKS* 
   +0xa68 RtlRightChild    : Ptr64 to     _RTL_SPLAY_LINKS* 
   +0xa70 SetPrivilege     : Ptr64 to     int 
   +0xa78 StringToExistingRtlPath : Ptr64 to     int 
   +0xa80 StringToRtlPath  : Ptr64 to     int 
   +0xa88 TestExceptionHandler : Ptr64 to     int 
   +0xa90 UnicodeStringToExistingRtlPath : Ptr64 to     int 
   +0xa98 UnicodeStringToRtlPath : Ptr64 to     int 
   +0xaa0 UnregisterDllNotification : Ptr64 to     int 
   +0xaa8 WriteEnvVarToRegistry : Ptr64 to     int 
   +0xab0 WriteRegistryString : Ptr64 to     int 
   +0xab8 ShlwapiFunctions : struct _SHLWAPI_FUNCTIONS, 1 elements, 0x8 bytes
   +0xab8 PathCanonicalizeA : Ptr64 to     int 
   +0xac0 Dbg              : struct _DBG, 169 elements, 0x548 bytes
   +0xac0 EnumDirTree      : Ptr64 to     int 
   +0xac8 EnumDirTreeW     : Ptr64 to     int 
   +0xad0 EnumerateLoadedModules64 : Ptr64 to     int 
   +0xad8 EnumerateLoadedModules : Ptr64 to     int 
   +0xae0 EnumerateLoadedModulesEx : Ptr64 to     int 
   +0xae8 EnumerateLoadedModulesExW : Ptr64 to     int 
   +0xaf0 EnumerateLoadedModulesW64 : Ptr64 to     int 
   +0xaf8 FindFileInPath   : Ptr64 to     int 
   +0xb00 FindFileInSearchPath : Ptr64 to     int 
   +0xb08 GetSymLoadError  : Ptr64 to     unsigned long 
   +0xb10 GetTimestampForLoadedLibrary : Ptr64 to     unsigned long 
   +0xb18 MakeSureDirectoryPathExists : Ptr64 to     int 
   +0xb20 RangeMapAddPeImageSections : Ptr64 to     int 
   +0xb28 RangeMapRead     : Ptr64 to     int 
   +0xb30 RangeMapRemove   : Ptr64 to     int 
   +0xb38 RangeMapWrite    : Ptr64 to     int 
   +0xb40 ReportSymbolLoadSummary : Ptr64 to     int 
   +0xb48 SearchTreeForFile : Ptr64 to     int 
   +0xb50 SearchTreeForFileW : Ptr64 to     int 
   +0xb58 StackWalk64      : Ptr64 to     int 
   +0xb60 StackWalkEx      : Ptr64 to     int 
   +0xb68 StackWalk        : Ptr64 to     int 
   +0xb70 SymAddrIncludeInlineTrace : Ptr64 to     unsigned long 
   +0xb78 SymAddSourceStreamA : Ptr64 to     int 
   +0xb80 SymAddSourceStream : Ptr64 to     int 
   +0xb88 SymAddSourceStreamW : Ptr64 to     int 
   +0xb90 SymAddSymbol     : Ptr64 to     int 
   +0xb98 SymAddSymbolW    : Ptr64 to     int 
   +0xba0 SymCleanup       : Ptr64 to     int 
   +0xba8 SymCompareInlineTrace : Ptr64 to     unsigned long 
   +0xbb0 SymDeleteSymbol  : Ptr64 to     int 
   +0xbb8 SymDeleteSymbolW : Ptr64 to     int 
   +0xbc0 SymEnumerateModules64 : Ptr64 to     int 
   +0xbc8 SymEnumerateModules : Ptr64 to     int 
   +0xbd0 SymEnumerateModulesW64 : Ptr64 to     int 
   +0xbd8 SymEnumerateSymbols64 : Ptr64 to     int 
   +0xbe0 SymEnumerateSymbols : Ptr64 to     int 
   +0xbe8 SymEnumerateSymbolsW64 : Ptr64 to     int 
   +0xbf0 SymEnumerateSymbolsW : Ptr64 to     int 
   +0xbf8 SymEnumLines     : Ptr64 to     int 
   +0xc00 SymEnumLinesW    : Ptr64 to     int 
   +0xc08 SymEnumProcesses : Ptr64 to     int 
   +0xc10 SymEnumSourceFiles : Ptr64 to     int 
   +0xc18 SymEnumSourceFilesW : Ptr64 to     int 
   +0xc20 SymEnumSourceFileTokens : Ptr64 to     int 
   +0xc28 SymEnumSourceLines : Ptr64 to     int 
   +0xc30 SymEnumSourceLinesW : Ptr64 to     int 
   +0xc38 SymEnumSymbolsEx : Ptr64 to     int 
   +0xc40 SymEnumSymbolsExW : Ptr64 to     int 
   +0xc48 SymEnumSymbolsForAddr : Ptr64 to     int 
   +0xc50 SymEnumSymbolsForAddrW : Ptr64 to     int 
   +0xc58 SymEnumSymbols   : Ptr64 to     int 
   +0xc60 SymEnumSymbolsW  : Ptr64 to     int 
   +0xc68 SymEnumSym       : Ptr64 to     int 
   +0xc70 SymEnumTypesByName : Ptr64 to     int 
   +0xc78 SymEnumTypesByNameW : Ptr64 to     int 
   +0xc80 SymEnumTypes     : Ptr64 to     int 
   +0xc88 SymEnumTypesW    : Ptr64 to     int 
   +0xc90 SymFindFileInPath : Ptr64 to     int 
   +0xc98 SymFindFileInPathW : Ptr64 to     int 
   +0xca0 SymFromAddr      : Ptr64 to     int 
   +0xca8 SymFromAddrW     : Ptr64 to     int 
   +0xcb0 SymFromIndex     : Ptr64 to     int 
   +0xcb8 SymFromIndexW    : Ptr64 to     int 
   +0xcc0 SymFromInlineContext : Ptr64 to     int 
   +0xcc8 SymFromInlineContextW : Ptr64 to     int 
   +0xcd0 SymFromName      : Ptr64 to     int 
   +0xcd8 SymFromNameW     : Ptr64 to     int 
   +0xce0 SymFromToken     : Ptr64 to     int 
   +0xce8 SymFromTokenW    : Ptr64 to     int 
   +0xcf0 SymGetFileLineOffsets64 : Ptr64 to     unsigned long 
   +0xcf8 SymGetLineFromAddr64 : Ptr64 to     int 
   +0xd00 SymGetLineFromAddr : Ptr64 to     int 
   +0xd08 SymGetLineFromAddrW64 : Ptr64 to     int 
   +0xd10 SymGetLineFromInlineContext : Ptr64 to     int 
   +0xd18 SymGetLineFromInlineContextW : Ptr64 to     int 
   +0xd20 SymGetLineFromName64 : Ptr64 to     int 
   +0xd28 SymGetLineFromName : Ptr64 to     int 
   +0xd30 SymGetLineFromNameW64 : Ptr64 to     int 
   +0xd38 SymGetLineNext64 : Ptr64 to     int 
   +0xd40 SymGetLineNext   : Ptr64 to     int 
   +0xd48 SymGetLineNextW64 : Ptr64 to     int 
   +0xd50 SymGetLinePrev64 : Ptr64 to     int 
   +0xd58 SymGetLinePrev   : Ptr64 to     int 
   +0xd60 SymGetLinePrevW64 : Ptr64 to     int 
   +0xd68 SymGetModuleBase : Ptr64 to     unsigned long 
   +0xd70 SymGetModuleInfo64 : Ptr64 to     int 
   +0xd78 SymGetModuleInfo : Ptr64 to     int 
   +0xd80 SymGetModuleInfoW64 : Ptr64 to     int 
   +0xd88 SymGetModuleInfoW : Ptr64 to     int 
   +0xd90 SymGetOmaps      : Ptr64 to     int 
   +0xd98 SymGetOptions    : Ptr64 to     unsigned long 
   +0xda0 SymGetScope      : Ptr64 to     int 
   +0xda8 SymGetScopeW     : Ptr64 to     int 
   +0xdb0 SymGetSearchPath : Ptr64 to     int 
   +0xdb8 SymGetSearchPathW : Ptr64 to     int 
   +0xdc0 SymGetSourceFileFromToken : Ptr64 to     int 
   +0xdc8 SymGetSourceFileFromTokenW : Ptr64 to     int 
   +0xdd0 SymGetSourceFile : Ptr64 to     int 
   +0xdd8 SymGetSourceFileToken : Ptr64 to     int 
   +0xde0 SymGetSourceFileTokenW : Ptr64 to     int 
   +0xde8 SymGetSourceFileW : Ptr64 to     int 
   +0xdf0 SymGetSourceVarFromToken : Ptr64 to     int 
   +0xdf8 SymGetSourceVarFromTokenW : Ptr64 to     int 
   +0xe00 SymGetSymbolFile : Ptr64 to     int 
   +0xe08 SymGetSymbolFileW : Ptr64 to     int 
   +0xe10 SymGetSymFromAddr64 : Ptr64 to     int 
   +0xe18 SymGetSymFromAddr : Ptr64 to     int 
   +0xe20 SymGetSymFromName64 : Ptr64 to     int 
   +0xe28 SymGetSymFromName : Ptr64 to     int 
   +0xe30 SymGetSymNext64  : Ptr64 to     int 
   +0xe38 SymGetSymNext    : Ptr64 to     int 
   +0xe40 SymGetSymPrev64  : Ptr64 to     int 
   +0xe48 SymGetSymPrev    : Ptr64 to     int 
   +0xe50 SymGetTypeFromName : Ptr64 to     int 
   +0xe58 SymGetTypeFromNameW : Ptr64 to     int 
   +0xe60 SymGetTypeInfoEx : Ptr64 to     int 
   +0xe68 SymGetTypeInfo   : Ptr64 to     int 
   +0xe70 SymGetUnwindInfo : Ptr64 to     int 
   +0xe78 SymInitialize    : Ptr64 to     int 
   +0xe80 SymInitializeW   : Ptr64 to     int 
   +0xe88 SymLoadModule    : Ptr64 to     unsigned long 
   +0xe90 SymLoadModuleEx  : Ptr64 to     unsigned int64 
   +0xe98 SymLoadModuleExW : Ptr64 to     unsigned int64 
   +0xea0 SymMatchFileName : Ptr64 to     int 
   +0xea8 SymMatchFileNameW : Ptr64 to     int 
   +0xeb0 SymMatchStringA  : Ptr64 to     int 
   +0xeb8 SymMatchString   : Ptr64 to     int 
   +0xec0 SymMatchStringW  : Ptr64 to     int 
   +0xec8 SymNext          : Ptr64 to     int 
   +0xed0 SymNextW         : Ptr64 to     int 
   +0xed8 SymPrev          : Ptr64 to     int 
   +0xee0 SymPrevW         : Ptr64 to     int 
   +0xee8 SymQueryInlineTrace : Ptr64 to     int 
   +0xef0 SymRefreshModuleList : Ptr64 to     int 
   +0xef8 SymRegisterCallback64 : Ptr64 to     int 
   +0xf00 SymRegisterCallback : Ptr64 to     int 
   +0xf08 SymRegisterCallbackW64 : Ptr64 to     int 
   +0xf10 SymRegisterFunctionEntryCallback64 : Ptr64 to     int 
   +0xf18 SymRegisterFunctionEntryCallback : Ptr64 to     int 
   +0xf20 SymSearch        : Ptr64 to     int 
   +0xf28 SymSearchW       : Ptr64 to     int 
   +0xf30 SymSetContext    : Ptr64 to     int 
   +0xf38 SymSetOptions    : Ptr64 to     unsigned long 
   +0xf40 SymSetParentWindow : Ptr64 to     int 
   +0xf48 SymSetScopeFromAddr : Ptr64 to     int 
   +0xf50 SymSetScopeFromIndex : Ptr64 to     int 
   +0xf58 SymSetScopeFromInlineContext : Ptr64 to     int 
   +0xf60 SymSetSearchPath : Ptr64 to     int 
   +0xf68 SymSetSearchPathW : Ptr64 to     int 
   +0xf70 SymSrvGetFileIndexes : Ptr64 to     int 
   +0xf78 SymSrvGetFileIndexesW : Ptr64 to     int 
   +0xf80 SymSrvGetFileIndexInfo : Ptr64 to     int 
   +0xf88 SymSrvGetFileIndexInfoW : Ptr64 to     int 
   +0xf90 SymSrvGetFileIndexString : Ptr64 to     int 
   +0xf98 SymSrvGetFileIndexStringW : Ptr64 to     int 
   +0xfa0 SymSrvIsStore    : Ptr64 to     int 
   +0xfa8 SymSrvIsStoreW   : Ptr64 to     int 
   +0xfb0 SymUnDName64     : Ptr64 to     int 
   +0xfb8 SymUnDName       : Ptr64 to     int 
   +0xfc0 SymUnloadModule64 : Ptr64 to     int 
   +0xfc8 SymUnloadModule  : Ptr64 to     int 
   +0xfd0 UnDecorateSymbolName : Ptr64 to     unsigned long 
   +0xfd8 UnDecorateSymbolNameW : Ptr64 to     unsigned long 
   +0xfe0 ImageNtHeader    : Ptr64 to     _IMAGE_NT_HEADERS64* 
   +0xfe8 ImageDirectoryEntryToData : Ptr64 to     void* 
   +0xff0 ImageDirectoryEntryToDataEx : Ptr64 to     void* 
   +0xff8 ImageRvaToSection : Ptr64 to     _IMAGE_SECTION_HEADER* 
   +0x1000 ImageRvaToV      : Ptr64 to     void* 
   +0x1008 DbgEng           : struct _DBGENG, 1 elements, 0x8 bytes
   +0x1008 DebugCreate      : Ptr64 to     HRESULT 
   +0x1010 TestLoadSymbols  : Ptr64 to     int 
   +0x1018 TestLoadSymbolsFromMultipleModules : Ptr64 to     int 
0:000> dt -v Rtl!_GUARDED_LIST
struct _GUARDED_LIST, 3 elements, 0x20 bytes
   +0x000 Lock             : struct _RTL_SRWLOCK, 1 elements, 0x8 bytes
   +0x008 NumberOfEntries  : Int8B
   +0x010 ListHead         : struct _LIST_ENTRY, 2 elements, 0x10 bytes
0:000> dt -v Rtl!_RTL_ATEXIT_RUNDOWN_FLAGS
struct _RTL_ATEXIT_RUNDOWN_FLAGS, 1 elements, 0x4 bytes
   +0x000 IsActive         : Bitfield Pos 0, 1 Bit
0:000> dt -v Rtl!_RTL_ATEXIT_ENTRY_FLAGS
struct _RTL_ATEXIT_ENTRY_FLAGS, 3 elements, 0x4 bytes
   +0x000 IsExtended       : Bitfield Pos 0, 1 Bit
   +0x000 HasContext       : Bitfield Pos 1, 1 Bit
   +0x000 SuppressExceptions : Bitfield Pos 2, 1 Bit
0:000> dt -v Rtl!_RTL_ATEXIT_ENTRY
struct _RTL_ATEXIT_ENTRY, 9 elements, 0x40 bytes
   +0x000 SizeOfStruct     : Uint2B
   +0x002 Padding1         : Uint2B
   +0x004 Flags            : struct _RTL_ATEXIT_ENTRY_FLAGS, 3 elements, 0x4 bytes
   +0x008 AtExitFunc       : Ptr64 to     void 
   +0x008 AtExitExCallback : Ptr64 to     void 
   +0x010 ListEntry        : struct _LIST_ENTRY, 2 elements, 0x10 bytes
   +0x020 Rundown          : Ptr64 to struct _RTL_ATEXIT_RUNDOWN, 6 elements, 0x48 bytes
   +0x028 Context          : Ptr64 to Void
   +0x030 Padding2         : [2] Uint8B
0:000> dt -v Rtl!_RTL_LDR_NOTIFICATION_TABLE_FLAGS
struct _RTL_LDR_NOTIFICATION_TABLE_FLAGS, 1 elements, 0x4 bytes
   +0x000 IsRegistered     : Bitfield Pos 0, 1 Bit
0:000> dt -v Rtl!_RTL_LDR_NOTIFICATION_TABLE
struct _RTL_LDR_NOTIFICATION_TABLE, 9 elements, 0x60 bytes
   +0x000 SizeOfStruct     : Uint2B
   +0x002 NumberOfEntries  : Uint2B
   +0x004 Flags            : struct _RTL_LDR_NOTIFICATION_TABLE_FLAGS, 1 elements, 0x4 bytes
   +0x008 CriticalSection  : struct _RTL_CRITICAL_SECTION, 6 elements, 0x28 bytes
   +0x030 ListHead         : struct _LIST_ENTRY, 2 elements, 0x10 bytes
   +0x040 HeapHandle       : Ptr64 to Void
   +0x048 Rtl              : Ptr64 to struct _RTL, 483 elements, 0x1020 bytes
   +0x050 NotificationFunction : Ptr64 to     void 
   +0x058 Cookie           : Ptr64 to Void
0:000> dt -v Rtl!_RTL_LDR_NOTIFICATION_ENTRY
struct _RTL_LDR_NOTIFICATION_ENTRY, 8 elements, 0x40 bytes
   +0x000 SizeOfStruct     : Uint2B
   +0x002 Padding1         : Uint2B
   +0x004 Flags            : struct _RTL_LDR_NOTIFICATION_ENTRY_FLAGS, 1 elements, 0x4 bytes
   +0x008 NotificationCallback : Ptr64 to     void 
   +0x010 ListEntry        : struct _LIST_ENTRY, 2 elements, 0x10 bytes
   +0x020 NotificationTable : Ptr64 to struct _RTL_LDR_NOTIFICATION_TABLE, 9 elements, 0x60 bytes
   +0x028 Context          : Ptr64 to Void
   +0x030 Padding2         : [2] Uint8B
0:000> dt -v Rtl!_SQLITE3_VTAB
Symbol Rtl!_SQLITE3_VTAB not found.
0:000> dt -v Rtl!_SQLITE3_VTAB_CURSOR
Symbol Rtl!_SQLITE3_VTAB_CURSOR not found.
0:000> dt -v Rtl!_SQLITE3_INDEX_CONSTRAINT
Symbol Rtl!_SQLITE3_INDEX_CONSTRAINT not found.
0:000> dt -v Rtl!_SQLITE3_INDEX_ORDER_BY
Symbol Rtl!_SQLITE3_INDEX_ORDER_BY not found.
0:000> dt -v Rtl!_SQLITE3_INDEX_CONSTRAINT_USAGE
Symbol Rtl!_SQLITE3_INDEX_CONSTRAINT_USAGE not found.
0:000> dt -v Rtl!_SQLITE3_INDEX_INFO
Symbol Rtl!_SQLITE3_INDEX_INFO not found.
0:000> dt -v Rtl!_SQLITE3_MODULE
Symbol Rtl!_SQLITE3_MODULE not found.
0:000> dt -v Rtl!_SQLITE3_API_ROUTINES
Symbol Rtl!_SQLITE3_API_ROUTINES not found.
0:000> dt -v StringTable!_STRING_TABLE
*** WARNING: Unable to verify checksum for S:\Source\tracer\x64\Debug\StringTable.dll
struct _STRING_TABLE, 16 elements, 0x200 bytes
   +0x000 OccupiedBitmap   : Uint2B
   +0x002 ContinuationBitmap : Uint2B
   +0x004 HorizontalDepth  : UChar
   +0x005 VerticalDepth    : UChar
   +0x006 NextHorizontalOffsetInQuadwords : UChar
   +0x007 NextVerticalOffsetInQuadwords : UChar
   +0x008 pStringArray     : Ptr64 to struct _STRING_ARRAY, 6 elements, 0x20 bytes
   +0x010 FirstChars       : union _STRING_SLOT, 5 elements, 0x10 bytes
   +0x020 Lengths          : union _SLOT_LENGTHS, 24 elements, 0x20 bytes
   +0x040 Slots            : [16] union _STRING_SLOT, 5 elements, 0x10 bytes
   +0x140 IsPrefixOfStringInTable : Ptr64 to     short 
   +0x148 DestroyStringTable : Ptr64 to     void 
   +0x150 Flags            : struct _STRING_TABLE_FLAGS, 2 elements, 0x4 bytes
   +0x154 Padding1         : [3] Uint4B
   +0x160 StringArray      : struct _STRING_ARRAY, 6 elements, 0x20 bytes
   +0x160 Padding          : [160] Char
0:000> dt -v StringTable!_STRING_MATCH
struct _STRING_MATCH, 4 elements, 0x10 bytes
   +0x000 Index            : Int4B
   +0x004 NumberOfMatchedCharacters : Uint2B
   +0x006 Padding1         : Uint2B
   +0x008 String           : Ptr64 to struct _STRING, 5 elements, 0x10 bytes
0:000> dt -v StringTable!_STRING_ARRAY2
Symbol StringTable!_STRING_ARRAY2 not found.
0:000> dt -v StringTable!_STRING_ARRAY3
Symbol StringTable!_STRING_ARRAY3 not found.
0:000> dt -v StringTable!_STRING_ARRAY4
Symbol StringTable!_STRING_ARRAY4 not found.
0:000> dt -v StringTable!_STRING_ARRAY5
Symbol StringTable!_STRING_ARRAY5 not found.
0:000> dt -v StringTable!_STRING_ARRAY6
Symbol StringTable!_STRING_ARRAY6 not found.
0:000> dt -v StringTable!_STRING_ARRAY7
Symbol StringTable!_STRING_ARRAY7 not found.
0:000> dt -v StringTable!_STRING_ARRAY8
Symbol StringTable!_STRING_ARRAY8 not found.
0:000> dt -v StringTable!_STRING_ARRAY9
Symbol StringTable!_STRING_ARRAY9 not found.
0:000> dt -v StringTable!_STRING_ARRAY10
Symbol StringTable!_STRING_ARRAY10 not found.
0:000> dt -v StringTable!_STRING_ARRAY11
Symbol StringTable!_STRING_ARRAY11 not found.
0:000> dt -v StringTable!_STRING_ARRAY12
Symbol StringTable!_STRING_ARRAY12 not found.
0:000> dt -v StringTable!_STRING_ARRAY13
Symbol StringTable!_STRING_ARRAY13 not found.
0:000> dt -v StringTable!_STRING_ARRAY14
Symbol StringTable!_STRING_ARRAY14 not found.
0:000> dt -v StringTable!_STRING_ARRAY15
Symbol StringTable!_STRING_ARRAY15 not found.
0:000> dt -v StringTable!_STRING_ARRAY16
Symbol StringTable!_STRING_ARRAY16 not found.
0:000> dt -v StringTable!_STRING_ARRAY17
Symbol StringTable!_STRING_ARRAY17 not found.
0:000> dt -v StringTable!_STRING_ARRAY18
Symbol StringTable!_STRING_ARRAY18 not found.
0:000> dt -v StringTable!_STRING_ARRAY19
Symbol StringTable!_STRING_ARRAY19 not found.
0:000> dt -v StringTable!_STRING_ARRAY20
Symbol StringTable!_STRING_ARRAY20 not found.
0:000> dt -v StringTable!_STRING_ARRAY21
Symbol StringTable!_STRING_ARRAY21 not found.
0:000> dt -v StringTable!_STRING_ARRAY22
Symbol StringTable!_STRING_ARRAY22 not found.
0:000> dt -v StringTable!_STRING_ARRAY23
Symbol StringTable!_STRING_ARRAY23 not found.
0:000> dt -v StringTable!_STRING_ARRAY24
Symbol StringTable!_STRING_ARRAY24 not found.
0:000> dt -v StringTable!_STRING_ARRAY25
Symbol StringTable!_STRING_ARRAY25 not found.
0:000> dt -v StringTable!_STRING_ARRAY26
Symbol StringTable!_STRING_ARRAY26 not found.
0:000> dt -v StringTable!_STRING_ARRAY27
Symbol StringTable!_STRING_ARRAY27 not found.
0:000> dt -v StringTable!_STRING_ARRAY28
Symbol StringTable!_STRING_ARRAY28 not found.
0:000> dt -v StringTable!_STRING_ARRAY29
Symbol StringTable!_STRING_ARRAY29 not found.
0:000> dt -v StringTable!_STRING_ARRAY30
Symbol StringTable!_STRING_ARRAY30 not found.
0:000> dt -v StringTable!_STRING_ARRAY31
Symbol StringTable!_STRING_ARRAY31 not found.
0:000> dt -v StringTable!_STRING_ARRAY32
Symbol StringTable!_STRING_ARRAY32 not found.
0:000> dt -v TracedPythonSession!_TRACED_PYTHON_SESSION
*** WARNING: Unable to verify checksum for S:\Source\tracer\x64\Debug\TracedPythonSession.dll
struct _TRACED_PYTHON_SESSION, 85 elements, 0x310 bytes
   +0x000 Size             : Uint2B
   +0x002 PythonMajorVersion : Char
   +0x003 PythonMinorVersion : Char
   +0x004 NumberOfPathEntries : Uint2B
   +0x006 Unused1          : Uint2B
   +0x008 SystemTime       : struct _SYSTEMTIME, 8 elements, 0x10 bytes
   +0x018 PathEntries      : Ptr64 to struct _UNICODE_STRING, 5 elements, 0x10 bytes
   +0x020 PathDirectoryCookies : Ptr64 to Ptr64 to Void
   +0x028 TracerConfig     : Ptr64 to struct _TRACER_CONFIG, 15 elements, 0x1c0 bytes
   +0x030 Allocator        : Ptr64 to struct _ALLOCATOR, 28 elements, 0x90 bytes
   +0x038 RundownListEntry : struct _LIST_ENTRY, 2 elements, 0x10 bytes
   +0x048 ListEntry        : struct _LIST_ENTRY, 2 elements, 0x10 bytes
   +0x058 OwningModule     : Ptr64 to struct HINSTANCE__, 1 elements, 0x4 bytes
   +0x060 OwningModulePath : Ptr64 to struct _RTL_PATH, 18 elements, 0xc0 bytes
   +0x068 Kernel32Module   : Ptr64 to struct HINSTANCE__, 1 elements, 0x4 bytes
   +0x070 Shell32Module    : Ptr64 to struct HINSTANCE__, 1 elements, 0x4 bytes
   +0x078 User32Module     : Ptr64 to struct HINSTANCE__, 1 elements, 0x4 bytes
   +0x080 Advapi32Module   : Ptr64 to struct HINSTANCE__, 1 elements, 0x4 bytes
   +0x088 Winsock2Module   : Ptr64 to struct HINSTANCE__, 1 elements, 0x4 bytes
   +0x090 Msvcr90Module    : Ptr64 to struct HINSTANCE__, 1 elements, 0x4 bytes
   +0x098 PythonDllModule  : Ptr64 to struct HINSTANCE__, 1 elements, 0x4 bytes
   +0x0a0 Python2Module    : Ptr64 to struct HINSTANCE__, 1 elements, 0x4 bytes
   +0x0a8 Python3Module    : Ptr64 to struct HINSTANCE__, 1 elements, 0x4 bytes
   +0x0b0 RtlModule        : Ptr64 to struct HINSTANCE__, 1 elements, 0x4 bytes
   +0x0b8 HookModule       : Ptr64 to struct HINSTANCE__, 1 elements, 0x4 bytes
   +0x0c0 TracerHeapModule : Ptr64 to struct HINSTANCE__, 1 elements, 0x4 bytes
   +0x0c8 TraceStoreModule : Ptr64 to struct HINSTANCE__, 1 elements, 0x4 bytes
   +0x0d0 StringTableModule : Ptr64 to struct HINSTANCE__, 1 elements, 0x4 bytes
   +0x0d8 PythonModule     : Ptr64 to struct HINSTANCE__, 1 elements, 0x4 bytes
   +0x0e0 PythonTracerModule : Ptr64 to struct HINSTANCE__, 1 elements, 0x4 bytes
   +0x0e8 TracedPythonSessionModule : Ptr64 to struct HINSTANCE__, 1 elements, 0x4 bytes
   +0x0f0 TracerControlDeviceName : Ptr64 to struct _UNICODE_STRING, 5 elements, 0x10 bytes
   +0x0f8 TracerControlDevice : Ptr64 to Void
   +0x100 CommandLineToArgvW : Ptr64 to     wchar_t** 
   +0x108 CommandLineA     : Ptr64 to Char
   +0x110 CommandLineW     : Ptr64 to Wchar
   +0x118 NumberOfArguments : Int4B
   +0x118 argc             : Int4B
   +0x120 ArgvA            : Ptr64 to Ptr64 to Char
   +0x120 argv             : Ptr64 to Ptr64 to Char
   +0x128 ArgvW            : Ptr64 to Ptr64 to Wchar
   +0x128 argvw            : Ptr64 to Ptr64 to Wchar
   +0x130 PythonNumberOfArguments : Int4B
   +0x138 PythonArgvA      : Ptr64 to Ptr64 to Char
   +0x140 PythonArgvW      : Ptr64 to Ptr64 to Wchar
   +0x148 InitializeRtl    : Ptr64 to     int 
   +0x150 Rtl              : Ptr64 to struct _RTL, 483 elements, 0x1020 bytes
   +0x158 CreateStringTable : Ptr64 to     _STRING_TABLE* 
   +0x160 DestroyStringTable : Ptr64 to     void 
   +0x168 CreateStringTableFromDelimitedString : Ptr64 to     _STRING_TABLE* 
   +0x170 CreateStringTableFromDelimitedEnvironmentVariable : Ptr64 to     _STRING_TABLE* 
   +0x178 StringTableAllocator : Ptr64 to struct _ALLOCATOR, 28 elements, 0x90 bytes
   +0x180 StringArrayAllocator : Ptr64 to struct _ALLOCATOR, 28 elements, 0x90 bytes
   +0x188 ModuleNamesStringTable : Ptr64 to struct _STRING_TABLE, 16 elements, 0x200 bytes
   +0x190 InitializeTraceStores : Ptr64 to     int 
   +0x198 InitializeTraceContext : Ptr64 to     int 
   +0x1a0 InitializeTraceSession : Ptr64 to     int 
   +0x1a8 CloseTraceStores : Ptr64 to     int 
   +0x1b0 CloseTraceContext : Ptr64 to     void 
   +0x1b8 InitializeAllocatorFromTraceStore : Ptr64 to     int 
   +0x1c0 TraceStores      : Ptr64 to struct _TRACE_STORES, 18 elements, 0x12e000 bytes
   +0x1c8 TraceSession     : Ptr64 to struct _TRACE_SESSION, 8 elements, 0x48 bytes
   +0x1d0 TraceContext     : Ptr64 to struct _TRACE_CONTEXT, 73 elements, 0x520 bytes
   +0x1d8 TraceSessionDirectory : Ptr64 to struct _UNICODE_STRING, 5 elements, 0x10 bytes
   +0x1e0 MaximumProcessorCount : Uint4B
   +0x1e8 Threadpool       : Ptr64 to struct _TP_POOL, 0 elements, 0x0 bytes
   +0x1f0 ThreadpoolCallbackEnviron : struct _TP_CALLBACK_ENVIRON_V3, 10 elements, 0x48 bytes
   +0x238 CancellationThreadpool : Ptr64 to struct _TP_POOL, 0 elements, 0x0 bytes
   +0x240 CancellationThreadpoolCallbackEnviron : struct _TP_CALLBACK_ENVIRON_V3, 10 elements, 0x48 bytes
   +0x288 FindPythonDllAndExe : Ptr64 to     int 
   +0x290 InitializePython : Ptr64 to     int 
   +0x298 InitializePythonTraceContext : Ptr64 to     int 
   +0x2a0 ClosePythonTraceContext : Ptr64 to     void 
   +0x2a8 DestroyTracedPythonSession : Ptr64 to     void 
   +0x2b0 PythonDllPath    : Ptr64 to struct _UNICODE_STRING, 5 elements, 0x10 bytes
   +0x2b8 PythonExePath    : Ptr64 to struct _UNICODE_STRING, 5 elements, 0x10 bytes
   +0x2c0 PythonHomePath   : Ptr64 to struct _UNICODE_STRING, 5 elements, 0x10 bytes
   +0x2c8 OriginalDirectory : Ptr64 to struct _UNICODE_STRING, 5 elements, 0x10 bytes
   +0x2d0 PythonExePathA   : Ptr64 to struct _STRING, 5 elements, 0x10 bytes
   +0x2d8 PythonHomePathA  : Ptr64 to struct _STRING, 5 elements, 0x10 bytes
   +0x2e0 Python           : Ptr64 to struct _PYTHON, 120 elements, 0xb20 bytes
   +0x2e8 PythonTraceContext : Ptr64 to struct _PYTHON_TRACE_CONTEXT, 63 elements, 0x320 bytes
   +0x2f0 PythonTracerTraceStoreRelocations : Ptr64 to struct _TRACE_STORE_FIELD_RELOCS, 2 elements, 0x10 bytes
   +0x2f8 NumberOfBuffers  : Uint8B
   +0x300 Buffers          : [2] Ptr64 to Void
0:000> dt -v TracedPythonSession!_PYTHON_HOME
struct _PYTHON_HOME, 9 elements, 0x30 bytes
   +0x000 Size             : Uint2B
   +0x002 PythonMajorVersion : Char
   +0x003 PythonMinorVersion : Char
   +0x004 NumberOfPathEntries : Uint2B
   +0x006 Unused1          : Uint2B
   +0x008 PathEntries      : Ptr64 to struct _UNICODE_STRING, 5 elements, 0x10 bytes
   +0x010 Directory        : struct _UNICODE_STRING, 5 elements, 0x10 bytes
   +0x020 DllPath          : Ptr64 to struct _UNICODE_STRING, 5 elements, 0x10 bytes
   +0x028 ExePath          : Ptr64 to struct _UNICODE_STRING, 5 elements, 0x10 bytes
0:000> dt -v TracerConfig!_TRACER_RUNTIME_PARAMETERS
Loading module TracerConfig.
Symbol TracerConfig!_TRACER_RUNTIME_PARAMETERS not found.
0:000> dt -v TracerConfig!_TRACE_SESSION_DIRECTORY
Loading module TracerConfig.
Symbol TracerConfig!_TRACE_SESSION_DIRECTORY not found.
0:000> dt -v TracerConfig!_TRACE_SESSION_DIRECTORIES
Loading module TracerConfig.
Symbol TracerConfig!_TRACE_SESSION_DIRECTORIES not found.
0:000> dt -v TracerConfig!_TRACER_INJECTION_MODULES
Loading module TracerConfig.
Symbol TracerConfig!_TRACER_INJECTION_MODULES not found.
0:000> dt -v TracerConfig!_TRACER_OFFSET_TO_PATH_ENTRY
Loading module TracerConfig.
Symbol TracerConfig!_TRACER_OFFSET_TO_PATH_ENTRY not found.
0:000> dt -v TracerConfig!_TRACER_PATH_OFFSETS
Loading module TracerConfig.
Symbol TracerConfig!_TRACER_PATH_OFFSETS not found.
0:000> dt -v TracerControlDriver!_TRACER_CONTROL_DEV_EXT
Loading module TracerControlDriver.
Symbol TracerControlDriver!_TRACER_CONTROL_DEV_EXT not found.
0:000> dt -v TracerCore!_TRACER_INJECTION_BREAKPOINT_SPEC
*** WARNING: Unable to verify checksum for S:\Source\tracer\x64\Debug\TracerCore.dll
struct _TRACER_INJECTION_BREAKPOINT_SPEC, 3 elements, 0x18 bytes
   +0x000 OffsetExpression : Ptr64 to Char
   +0x008 HandleBreakpoint : Ptr64 to     HRESULT 
   +0x010 HandleReturnBreakpoint : Ptr64 to     HRESULT 
0:000> dt -v TracerCore!_TRACER_INJECTION_BREAKPOINT
struct _TRACER_INJECTION_BREAKPOINT, 22 elements, 0x88 bytes
   +0x000 SizeOfStruct     : Uint4B
   +0x004 BreakpointId     : Uint4B
   +0x008 ReturnBreakpointId : Uint4B
   +0x00c CurrentProcessId : Uint4B
   +0x010 CurrentThreadId  : Uint4B
   +0x014 SuspendedThreadId : Uint4B
   +0x018 Flags            : union _TRACER_INJECTION_BREAKPOINT_FLAGS, 6 elements, 0x4 bytes
   +0x01c Error            : union _TRACER_INJECTION_BREAKPOINT_ERROR, 17 elements, 0x4 bytes
   +0x020 Breakpoint       : Ptr64 to struct IDebugBreakpoint2Vtbl, 28 elements, 0xe0 bytes
   +0x028 IBreakpoint      : Ptr64 to struct IDebugBreakpoint2, 1 elements, 0x8 bytes
   +0x030 ReturnBreakpoint : Ptr64 to struct IDebugBreakpoint2Vtbl, 28 elements, 0xe0 bytes
   +0x038 IReturnBreakpoint : Ptr64 to struct IDebugBreakpoint2, 1 elements, 0x8 bytes
   +0x040 StackOffset      : Uint8B
   +0x048 ReturnOffset     : Uint8B
   +0x050 CurrentProcessHandle : Ptr64 to Void
   +0x058 CurrentThreadHandle : Ptr64 to Void
   +0x060 SuspendedThreadHandle : Ptr64 to Void
   +0x068 DebugEngineThreadHandle : Ptr64 to Void
   +0x070 OffsetExpression : Ptr64 to Char
   +0x078 HandleBreakpoint : Ptr64 to     HRESULT 
   +0x080 HandleReturnBreakpoint : Ptr64 to     HRESULT 
   +0x070 Spec             : struct _TRACER_INJECTION_BREAKPOINT_SPEC, 3 elements, 0x18 bytes
0:000> dt -v TracerCore!_TRACER_INJECTION_CONTEXT
struct _TRACER_INJECTION_CONTEXT, 15 elements, 0x60 bytes
   +0x000 SizeOfStruct     : Uint4B
   +0x004 Error            : union _TRACER_INJECTION_CONTEXT_ERROR, 4 elements, 0x4 bytes
   +0x008 Flags            : union _TRACER_INJECTION_CONTEXT_FLAGS, 4 elements, 0x4 bytes
   +0x00c DebugEngineThreadId : Uint4B
   +0x010 DebugEngineThreadHandle : Ptr64 to Void
   +0x018 Rtl              : Ptr64 to struct _RTL, 483 elements, 0x1020 bytes
   +0x020 Allocator        : Ptr64 to struct _ALLOCATOR, 28 elements, 0x90 bytes
   +0x028 TracerConfig     : Ptr64 to struct _TRACER_CONFIG, 15 elements, 0x1c0 bytes
   +0x030 ParentDebugEngineSession : Ptr64 to struct _DEBUG_ENGINE_SESSION, 67 elements, 0x2f0 bytes
   +0x038 DebugEngineSession : Ptr64 to struct _DEBUG_ENGINE_SESSION, 67 elements, 0x2f0 bytes
   +0x040 NumberOfBreakpoints : Uint4B
   +0x044 Padding          : Uint4B
   +0x048 InjectionBreakpoints : Ptr64 to struct _TRACER_INJECTION_BREAKPOINT, 22 elements, 0x88 bytes
   +0x050 ResumeEvent      : Ptr64 to Void
   +0x058 CurrentInjectionBreakpoint : Ptr64 to struct _TRACER_INJECTION_BREAKPOINT, 22 elements, 0x88 bytes
0:000> dt -v TraceStore!_TRACE_STORE_ALLOCATION
*** WARNING: Unable to verify checksum for S:\Source\tracer\x64\Debug\TraceStore.dll
struct _TRACE_STORE_ALLOCATION, 2 elements, 0x10 bytes
   +0x000 NumberOfRecords  : union <unnamed-tag>, 6 elements, 0x8 bytes
   +0x008 RecordSize       : union _LARGE_INTEGER, 4 elements, 0x8 bytes
0:000> dt -v TraceStore!_TRACE_STORE_ALLOCATION_TIMESTAMP
struct _TRACE_STORE_ALLOCATION_TIMESTAMP, 1 elements, 0x8 bytes
   +0x000 Timestamp        : union _LARGE_INTEGER, 4 elements, 0x8 bytes
0:000> dt -v TraceStore!_TRACE_STORE_ALLOCATION_TIMESTAMP_DELTA
struct _TRACE_STORE_ALLOCATION_TIMESTAMP_DELTA, 1 elements, 0x4 bytes
   +0x000 Delta            : Int4B
0:000> dt -v TraceStore!_TRACE_STORE_ADDRESS
struct _TRACE_STORE_ADDRESS, 20 elements, 0x80 bytes
   +0x000 PreferredBaseAddress : Ptr64 to Void
   +0x008 BaseAddress      : Ptr64 to Void
   +0x010 FileOffset       : union _LARGE_INTEGER, 4 elements, 0x8 bytes
   +0x018 MappedSize       : union _LARGE_INTEGER, 4 elements, 0x8 bytes
   +0x020 ProcessId        : Uint4B
   +0x024 RequestingThreadId : Uint4B
   +0x028 Timestamp        : struct <unnamed-tag>, 5 elements, 0x28 bytes
   +0x050 Elapsed          : struct <unnamed-tag>, 4 elements, 0x20 bytes
   +0x070 MappedSequenceId : Int4B
   +0x074 RequestingProcessor : struct _PROCESSOR_NUMBER, 3 elements, 0x4 bytes
   +0x074 RequestingProcGroup : Uint2B
   +0x076 RequestingProcNumber : UChar
   +0x077 RequestingProcReserved : UChar
   +0x077 RequestingNumaNode : UChar
   +0x078 FulfillingProcessor : struct _PROCESSOR_NUMBER, 3 elements, 0x4 bytes
   +0x078 FulfillingProcGroup : Uint2B
   +0x07a FulfillingProcNumber : UChar
   +0x07b FulfillingProcReserved : UChar
   +0x07b FulfillingNumaNode : UChar
   +0x07c FulfillingThreadId : Uint4B
0:000> dt -v TraceStore!_TRACE_STORE_ADDRESS_RANGE
struct _TRACE_STORE_ADDRESS_RANGE, 7 elements, 0x40 bytes
   +0x000 PreferredBaseAddress : Ptr64 to Void
   +0x008 ActualBaseAddress : Ptr64 to Void
   +0x010 EndAddress       : Ptr64 to Void
   +0x018 BitCounts        : struct <unnamed-tag>, 2 elements, 0x10 bytes
   +0x028 MappedSize       : union _ULARGE_INTEGER, 4 elements, 0x8 bytes
   +0x030 OriginalAddressRange : Ptr64 to struct _TRACE_STORE_ADDRESS_RANGE, 7 elements, 0x40 bytes
   +0x030 Timestamp        : struct <unnamed-tag>, 2 elements, 0x10 bytes
0:000> dt -v TraceStore!_TRACE_STORE_EOF
struct _TRACE_STORE_EOF, 1 elements, 0x8 bytes
   +0x000 EndOfFile        : union _LARGE_INTEGER, 4 elements, 0x8 bytes
0:000> dt -v TraceStore!_TRACE_STORE_START_TIME
struct _TRACE_STORE_START_TIME, 7 elements, 0x48 bytes
   +0x000 FileTimeUtc      : struct _FILETIME, 2 elements, 0x8 bytes
   +0x008 FileTimeLocal    : struct _FILETIME, 2 elements, 0x8 bytes
   +0x010 SystemTimeUtc    : struct _SYSTEMTIME, 8 elements, 0x10 bytes
   +0x020 SystemTimeLocal  : struct _SYSTEMTIME, 8 elements, 0x10 bytes
   +0x030 SecondsSince1970 : union _ULARGE_INTEGER, 4 elements, 0x8 bytes
   +0x038 MicrosecondsSince1970 : union _ULARGE_INTEGER, 4 elements, 0x8 bytes
   +0x040 PerformanceCounter : union _LARGE_INTEGER, 4 elements, 0x8 bytes
0:000> dt -v TraceStore!_TRACE_STORE_TIME
struct _TRACE_STORE_TIME, 3 elements, 0x58 bytes
   +0x000 Frequency        : union _LARGE_INTEGER, 4 elements, 0x8 bytes
   +0x008 Multiplicand     : union _LARGE_INTEGER, 4 elements, 0x8 bytes
   +0x010 StartTime        : struct _TRACE_STORE_START_TIME, 7 elements, 0x48 bytes
0:000> dt -v TraceStore!_TRACE_STORE_STATS
struct _TRACE_STORE_STATS, 11 elements, 0x40 bytes
   +0x000 DroppedRecords   : Uint4B
   +0x004 ExhaustedFreeMemoryMaps : Uint4B
   +0x008 AllocationsOutpacingNextMemoryMapPreparation : Uint4B
   +0x00c PreferredAddressUnavailable : Uint4B
   +0x010 AccessViolationsEncounteredDuringAsyncPrefault : Uint4B
   +0x014 BlockedAllocations : Uint4B
   +0x018 SuspendedAllocations : Uint4B
   +0x01c ElapsedSuspensionTimeInMicroseconds : Uint4B
   +0x020 WastedBytes      : Uint8B
   +0x028 PaddedAllocations : Uint4B
   +0x02c Reserved         : [5] Uint4B
0:000> dt -v TraceStore!_TRACE_STORE_TOTALS
struct _TRACE_STORE_TOTALS, 4 elements, 0x20 bytes
   +0x000 NumberOfAllocations : union _ULARGE_INTEGER, 4 elements, 0x8 bytes
   +0x008 AllocationSize   : union _ULARGE_INTEGER, 4 elements, 0x8 bytes
   +0x010 NumberOfRecords  : union _ULARGE_INTEGER, 4 elements, 0x8 bytes
   +0x018 RecordSize       : union _ULARGE_INTEGER, 4 elements, 0x8 bytes
0:000> dt -v TraceStore!_TRACE_STORE_TRAITS
struct _TRACE_STORE_TRAITS, 17 elements, 0x4 bytes
   +0x000 VaryingRecordSize : Bitfield Pos 0, 1 Bit
   +0x000 RecordSizeIsAlwaysPowerOf2 : Bitfield Pos 1, 1 Bit
   +0x000 MultipleRecords  : Bitfield Pos 2, 1 Bit
   +0x000 StreamingWrite   : Bitfield Pos 3, 1 Bit
   +0x000 StreamingRead    : Bitfield Pos 4, 1 Bit
   +0x000 FrequentAllocations : Bitfield Pos 5, 1 Bit
   +0x000 BlockingAllocations : Bitfield Pos 6, 1 Bit
   +0x000 LinkedStore      : Bitfield Pos 7, 1 Bit
   +0x000 CoalesceAllocations : Bitfield Pos 8, 1 Bit
   +0x000 ConcurrentAllocations : Bitfield Pos 9, 1 Bit
   +0x000 AllowPageSpill   : Bitfield Pos 10, 1 Bit
   +0x000 PageAligned      : Bitfield Pos 11, 1 Bit
   +0x000 Periodic         : Bitfield Pos 12, 1 Bit
   +0x000 ConcurrentDataStructure : Bitfield Pos 13, 1 Bit
   +0x000 NoAllocationAlignment : Bitfield Pos 14, 1 Bit
   +0x000 Compress         : Bitfield Pos 15, 1 Bit
   +0x000 Unused           : Bitfield Pos 16, 16 Bits
0:000> dt -v TraceStore!_TRACE_STORE_METADATA_INFO
struct _TRACE_STORE_METADATA_INFO, 10 elements, 0x1000 bytes
   +0x000 MetadataInfo     : struct _TRACE_STORE_INFO, 6 elements, 0x100 bytes
   +0x100 Allocation       : struct _TRACE_STORE_INFO, 6 elements, 0x100 bytes
   +0x200 Relocation       : struct _TRACE_STORE_INFO, 6 elements, 0x100 bytes
   +0x300 Address          : struct _TRACE_STORE_INFO, 6 elements, 0x100 bytes
   +0x400 AddressRange     : struct _TRACE_STORE_INFO, 6 elements, 0x100 bytes
   +0x500 AllocationTimestamp : struct _TRACE_STORE_INFO, 6 elements, 0x100 bytes
   +0x600 AllocationTimestampDelta : struct _TRACE_STORE_INFO, 6 elements, 0x100 bytes
   +0x700 Synchronization  : struct _TRACE_STORE_INFO, 6 elements, 0x100 bytes
   +0x800 Info             : struct _TRACE_STORE_INFO, 6 elements, 0x100 bytes
   +0x900 Reserved         : [7] struct _TRACE_STORE_INFO, 6 elements, 0x100 bytes
0:000> dt -v TraceStore!_TRACE_STORE_SYNC_FLAGS
struct _TRACE_STORE_SYNC_FLAGS, 3 elements, 0x4 bytes
   +0x000 Initialized      : Bitfield Pos 0, 1 Bit
   +0x000 AllocationCriticalSection : Bitfield Pos 1, 1 Bit
   +0x000 CallbackCriticalSection : Bitfield Pos 2, 1 Bit
0:000> dt -v TraceStore!_TRACE_STORE_SYNC
struct _TRACE_STORE_SYNC, 6 elements, 0x100 bytes
   +0x000 SizeOfStruct     : Uint4B
   +0x004 Flags            : struct _TRACE_STORE_SYNC_FLAGS, 3 elements, 0x4 bytes
   +0x008 SRWLock          : struct _RTL_SRWLOCK, 1 elements, 0x8 bytes
   +0x010 AllocationCriticalSection : struct _RTL_CRITICAL_SECTION, 6 elements, 0x28 bytes
   +0x040 CallbackCriticalSection : struct _RTL_CRITICAL_SECTION, 6 elements, 0x28 bytes
   +0x080 Padding3         : [128] UChar
0:000> dt -v TraceStore!_TRACE_STORE_FIELD_RELOC
struct _TRACE_STORE_FIELD_RELOC, 2 elements, 0x8 bytes
   +0x000 Offset           : Uint4B
   +0x004 TraceStoreId     : Enum _TRACE_STORE_ID,  62 total enums

0:000> dt -v TraceStore!_TRACE_STORE_FIELD_RELOCS
struct _TRACE_STORE_FIELD_RELOCS, 2 elements, 0x10 bytes
   +0x000 TraceStoreId     : Enum _TRACE_STORE_ID,  62 total enums

   +0x008 Relocations      : Ptr64 to struct _TRACE_STORE_FIELD_RELOC, 2 elements, 0x8 bytes
0:000> dt -v TraceStore!_TRACE_STORE_BITMAP
struct _TRACE_STORE_BITMAP, 4 elements, 0x10 bytes
   +0x000 SizeOfBitMap     : Uint4B
   +0x004 Granularity      : Uint2B
   +0x006 Shift            : Uint2B
   +0x008 Buffer           : Ptr64 to Uint4B
0:000> dt -v TraceStore!_TRACE_SESSION
struct _TRACE_SESSION, 8 elements, 0x48 bytes
   +0x000 Rtl              : Ptr64 to struct _RTL, 483 elements, 0x1020 bytes
   +0x008 SessionId        : union _LARGE_INTEGER, 4 elements, 0x8 bytes
   +0x010 MachineGuid      : struct _GUID, 4 elements, 0x10 bytes
   +0x020 Sid              : Ptr64 to struct _SID, 4 elements, 0xc bytes
   +0x028 UserName         : Ptr64 to Wchar
   +0x030 ComputerName     : Ptr64 to Wchar
   +0x038 DomainName       : Ptr64 to Wchar
   +0x040 SystemTime       : struct _FILETIME, 2 elements, 0x8 bytes
0:000> dt -v TraceStore!_TIMER_FUNCTION
struct _TIMER_FUNCTION, 2 elements, 0x10 bytes
   +0x000 GetSystemTimePreciseAsFileTime : Ptr64 to     void 
   +0x008 NtQuerySystemTime : Ptr64 to     long 
0:000> dt -v TraceStore!_TRACE_FLAGS
struct _TRACE_FLAGS, 20 elements, 0x4 bytes
   +0x000 Readonly         : Bitfield Pos 0, 1 Bit
   +0x000 Compress         : Bitfield Pos 1, 1 Bit
   +0x000 DisablePrefaultPages : Bitfield Pos 2, 1 Bit
   +0x000 DisableFileFlagOverlapped : Bitfield Pos 3, 1 Bit
   +0x000 DisableFileFlagSequentialScan : Bitfield Pos 4, 1 Bit
   +0x000 EnableFileFlagRandomAccess : Bitfield Pos 5, 1 Bit
   +0x000 EnableFileFlagWriteThrough : Bitfield Pos 6, 1 Bit
   +0x000 NoGlobalRundown  : Bitfield Pos 7, 1 Bit
   +0x000 NoTruncate       : Bitfield Pos 8, 1 Bit
   +0x000 EnableWorkingSetTracing : Bitfield Pos 9, 1 Bit
   +0x000 EnablePerformanceTracing : Bitfield Pos 10, 1 Bit
   +0x000 EnableLoaderTracing : Bitfield Pos 11, 1 Bit
   +0x000 EnableSymbolTracing : Bitfield Pos 12, 1 Bit
   +0x000 EnableTypeInfoTracing : Bitfield Pos 13, 1 Bit
   +0x000 EnableAssemblyTracing : Bitfield Pos 14, 1 Bit
   +0x000 IgnoreModulesInWindowsSystemDirectory : Bitfield Pos 15, 1 Bit
   +0x000 IgnoreModulesInWindowsSxSDirectory : Bitfield Pos 16, 1 Bit
   +0x000 Unused           : Bitfield Pos 17, 15 Bits
   +0x000 AsLong           : Int4B
   +0x000 AsULong          : Uint4B
0:000> dt -v TraceStore!_TRACE_WS_WATCH_INFORMATION
struct _TRACE_WS_WATCH_INFORMATION, 5 elements, 0x10 bytes
   +0x000 FaultingPc       : Ptr64 to Void
   +0x008 FaultingVa       : Ptr64 to Void
   +0x000 FaultingProgramCounter : union _ULARGE_INTEGER, 4 elements, 0x8 bytes
   +0x008 FaultingVirtualAddress : union _ULARGE_INTEGER, 4 elements, 0x8 bytes
   +0x000 AsWsWatchInformation : struct _PSAPI_WS_WATCH_INFORMATION, 2 elements, 0x10 bytes
0:000> dt -v TraceStore!_TRACE_WS_WATCH_INFORMATION_EX
struct _TRACE_WS_WATCH_INFORMATION_EX, 7 elements, 0x20 bytes
   +0x000 AsWsWatchInformation : struct _TRACE_WS_WATCH_INFORMATION, 5 elements, 0x10 bytes
   +0x000 FaultingPc       : Ptr64 to Void
   +0x008 FaultingVa       : Ptr64 to Void
   +0x000 FaultingProgramCounter : union _ULARGE_INTEGER, 4 elements, 0x8 bytes
   +0x008 FaultingVirtualAddress : union _ULARGE_INTEGER, 4 elements, 0x8 bytes
   +0x010 FaultingThreadId : Uint8B
   +0x018 Flags            : Uint8B
0:000> dt -v TraceStore!_TRACE_PAGE_FAULT
struct _TRACE_PAGE_FAULT, 8 elements, 0x40 bytes
   +0x000 FaultingPcFlags  : union _TRACE_PAGE_FAULT_PC_FLAGS, 9 elements, 0x4 bytes
   +0x004 FaultingVaFlags  : union _TRACE_PAGE_FAULT_VA_FLAGS, 6 elements, 0x4 bytes
   +0x008 FaultingThreadFlags : union _TRACE_PAGE_FAULT_THREAD_FLAGS, 5 elements, 0x4 bytes
   +0x00c Padding          : Uint4B
   +0x010 FaultingPcModule : Ptr64 to struct _TRACE_MODULE_TABLE_ENTRY, 25 elements, 0x3e0 bytes
   +0x018 FaultingVaTraceStore : Ptr64 to struct _TRACE_STORE, 149 elements, 0x800 bytes
   +0x020 Disassembly      : Ptr64 to struct _LINKED_STRING, 8 elements, 0x20 bytes
   +0x028 Reserved         : [3] Uint8B
0:000> dt -v TraceStore!_TRACE_MODULE_TABLE_FLAGS
struct _TRACE_MODULE_TABLE_FLAGS, 1 elements, 0x4 bytes
   +0x000 Initialized      : Bitfield Pos 0, 1 Bit
0:000> dt -v TraceStore!_TRACE_MODULE_TABLE
struct _TRACE_MODULE_TABLE, 7 elements, 0x1000 bytes
   +0x000 SizeOfStruct     : Uint4B
   +0x004 Flags            : struct _TRACE_MODULE_TABLE_FLAGS, 1 elements, 0x4 bytes
   +0x008 Padding1         : Uint8B
   +0x010 BaseAddressTable : struct _RTL_AVL_TABLE, 13 elements, 0x68 bytes
   +0x078 ModuleNamePrefixTable : struct _UNICODE_PREFIX_TABLE, 5 elements, 0x18 bytes
   +0x090 UnicodePrefixTableLookupsRequiringRestart : Uint8B
   +0x098 Reserved         : [3944] UChar
0:000> dt -v TraceStore!_TRACE_MODULE_TABLE_ENTRY
struct _TRACE_MODULE_TABLE_ENTRY, 25 elements, 0x3e0 bytes
   +0x000 BaseAddress      : Ptr64 to Void
   +0x008 SizeOfStruct     : Uint4B
   +0x00c Flags            : struct _TRACE_MODULE_TABLE_ENTRY_FLAGS, 2 elements, 0x4 bytes
   +0x010 ModuleNamePrefixTableEntry : struct _UNICODE_PREFIX_TABLE_ENTRY, 7 elements, 0x38 bytes
   +0x050 File             : struct _RTL_FILE, 32 elements, 0x200 bytes
   +0x250 LoadEventsListHead : struct _LIST_ENTRY, 2 elements, 0x10 bytes
   +0x260 DuplicateEntriesListHead : struct _LIST_ENTRY, 2 elements, 0x10 bytes
   +0x260 DuplicateEntriesListEntry : struct _LIST_ENTRY, 2 elements, 0x10 bytes
   +0x270 LoadEventsLock   : struct _RTL_SRWLOCK, 1 elements, 0x8 bytes
   +0x278 DuplicateEntriesLock : struct _RTL_SRWLOCK, 1 elements, 0x8 bytes
   +0x280 SymbolTable      : Ptr64 to struct _TRACE_SYMBOL_TABLE, 7 elements, 0x200 bytes
   +0x288 TypeInfoTable    : Ptr64 to struct _TRACE_TYPE_INFO_TABLE, 7 elements, 0x200 bytes
   +0x290 FunctionTable    : Ptr64 to struct _TRACE_FUNCTION_TABLE, 7 elements, 0x200 bytes
   +0x298 SymbolTableAvailableWork : Ptr64 to struct _TP_WORK, 0 elements, 0x0 bytes
   +0x2a0 TypeInfoTableAvailableWork : Ptr64 to struct _TP_WORK, 0 elements, 0x0 bytes
   +0x2a8 FunctionTableAvailableWork : Ptr64 to struct _TP_WORK, 0 elements, 0x0 bytes
   +0x2b0 SymbolContextListEntry : struct _LIST_ENTRY, 2 elements, 0x10 bytes
   +0x2b0 SymbolContextSListEntry : struct _SLIST_ENTRY, 1 elements, 0x10 bytes
   +0x2b0 SymbolContextNext : Ptr64 to struct _SLIST_ENTRY, 1 elements, 0x10 bytes
   +0x2b8 Unused1          : Ptr64 to Void
   +0x2c0 DebugContextListEntry : struct _LIST_ENTRY, 2 elements, 0x10 bytes
   +0x2c0 DebugContextSListEntry : struct _SLIST_ENTRY, 1 elements, 0x10 bytes
   +0x2c0 DebugContextNext : Ptr64 to struct _SLIST_ENTRY, 1 elements, 0x10 bytes
   +0x2c8 Unused2          : Ptr64 to Void
   +0x2d0 Reserved         : [272] UChar
0:000> dt -v TraceStore!_TRACE_MODULE_LOAD_EVENT
struct _TRACE_MODULE_LOAD_EVENT, 15 elements, 0x200 bytes
   +0x000 SizeOfStruct     : Uint4B
   +0x004 Flags            : Uint4B
   +0x004 Reason           : union _DLL_NOTIFICATION_REASON, 4 elements, 0x4 bytes
   +0x008 Timestamp        : struct <unnamed-tag>, 2 elements, 0x10 bytes
   +0x018 ListEntry        : struct _LIST_ENTRY, 2 elements, 0x10 bytes
   +0x028 ModuleTableEntry : Ptr64 to struct _TRACE_MODULE_TABLE_ENTRY, 25 elements, 0x3e0 bytes
   +0x030 PreferredBaseAddress : Ptr64 to Void
   +0x038 BaseAddress      : Ptr64 to Void
   +0x040 EntryPoint       : Ptr64 to Void
   +0x048 Content          : Ptr64 to Void
   +0x050 SizeOfImage      : Uint4B
   +0x054 FramesCaptured   : Uint4B
   +0x058 BackTraceHash    : Uint4B
   +0x05c Reserved         : [4] UChar
   +0x060 BackTrace        : [52] Uint8B
0:000> dt -v TraceStore!_TRACE_CONTEXT
struct _TRACE_CONTEXT, 73 elements, 0x520 bytes
   +0x000 SizeOfStruct     : Uint4B
   +0x004 Flags            : union _TRACE_CONTEXT_FLAGS, 6 elements, 0x4 bytes
   +0x008 FailedCount      : Uint4B
   +0x00c LastError        : Uint4B
   +0x010 Rtl              : Ptr64 to struct _RTL, 483 elements, 0x1020 bytes
   +0x018 Allocator        : Ptr64 to struct _ALLOCATOR, 28 elements, 0x90 bytes
   +0x020 TracerConfig     : Ptr64 to struct _TRACER_CONFIG, 15 elements, 0x1c0 bytes
   +0x028 TraceSession     : Ptr64 to struct _TRACE_SESSION, 8 elements, 0x48 bytes
   +0x030 TraceStores      : Ptr64 to struct _TRACE_STORES, 18 elements, 0x12e000 bytes
   +0x038 TimerFunction    : Ptr64 to struct _TIMER_FUNCTION, 2 elements, 0x10 bytes
   +0x040 UserData         : Ptr64 to Void
   +0x048 InitializeAllocatorFromTraceStore : Ptr64 to     int 
   +0x050 ThreadpoolCallbackEnvironment : Ptr64 to struct _TP_CALLBACK_ENVIRON_V3, 10 elements, 0x48 bytes
   +0x058 CancellationThreadpoolCallbackEnvironment : Ptr64 to struct _TP_CALLBACK_ENVIRON_V3, 10 elements, 0x48 bytes
   +0x060 LoadingCompleteEvent : Ptr64 to Void
   +0x068 Padding1         : Uint8B
   +0x070 BindMetadataInfoStoreWork : struct _TRACE_STORE_WORK, 9 elements, 0x40 bytes
   +0x0b0 BindRemainingMetadataStoresWork : struct _TRACE_STORE_WORK, 9 elements, 0x40 bytes
   +0x0f0 BindTraceStoreWork : struct _TRACE_STORE_WORK, 9 elements, 0x40 bytes
   +0x130 ReadonlyNonStreamingBindCompleteWork : struct _TRACE_STORE_WORK, 9 elements, 0x40 bytes
   +0x170 NewModuleEntryWork : struct _TRACE_STORE_WORK, 9 elements, 0x40 bytes
   +0x1b0 BindFlatMemoryMapWork : struct _TRACE_STORE_WORK, 9 elements, 0x40 bytes
   +0x1f0 PrepareIntervalsWork : struct _TRACE_STORE_WORK, 9 elements, 0x40 bytes
   +0x230 FailedListHead   : union _SLIST_HEADER, 3 elements, 0x10 bytes
   +0x240 ThreadpoolCleanupGroup : Ptr64 to struct _TP_CLEANUP_GROUP, 0 elements, 0x0 bytes
   +0x248 CleanupThreadpoolMembersWork : Ptr64 to struct _TP_WORK, 0 elements, 0x0 bytes
   +0x250 WorkingSetChangesLock : struct _RTL_SRWLOCK, 1 elements, 0x8 bytes
   +0x258 GetWorkingSetChangesTimer : Ptr64 to struct _TP_TIMER, 0 elements, 0x0 bytes
   +0x260 WorkingSetTimerContention : Uint4B
   +0x264 WsWatchInfoExInitialBufferNumberOfElements : Uint4B
   +0x268 WsWatchInfoExCurrentBufferNumberOfElements : Uint4B
   +0x26c GetWorkingSetChangesIntervalInMilliseconds : Uint4B
   +0x270 GetWorkingSetChangesWindowLengthInMilliseconds : Uint4B
   +0x278 WsWatchInfoExBuffer : Ptr64 to struct _PSAPI_WS_WATCH_INFORMATION_EX, 3 elements, 0x20 bytes
   +0x280 WsWorkingSetExInfoBuffer : Ptr64 to struct _PSAPI_WORKING_SET_EX_INFORMATION, 2 elements, 0x10 bytes
   +0x288 CapturePerformanceMetricsLock : struct _RTL_SRWLOCK, 1 elements, 0x8 bytes
   +0x290 CapturePerformanceMetricsTimer : Ptr64 to struct _TP_TIMER, 0 elements, 0x0 bytes
   +0x298 CapturePerformanceMetricsTimerContention : Uint4B
   +0x29c CapturePerformanceMetricsIntervalInMilliseconds : Uint4B
   +0x2a0 CapturePerformanceMetricsWindowLengthInMilliseconds : Uint4B
   +0x2a4 ActiveWorkItems  : Uint4B
   +0x2a8 BindsInProgress  : Uint4B
   +0x2ac PrepareReadonlyNonStreamingTraceStoresInProgress : Uint4B
   +0x2b0 ReadonlyNonStreamingBindCompletesInProgress : Uint4B
   +0x2b4 NumberOfStoresWithMultipleRelocationDependencies : Uint4B
   +0x2b8 NumberOfFlatMemoryMaps : Uint4B
   +0x2bc NumberOfPreparedIntervals : Uint4B
   +0x2c0 Time             : struct _TRACE_STORE_TIME, 3 elements, 0x58 bytes
   +0x318 RunHistoryRegistryKey : Ptr64 to struct HKEY__, 1 elements, 0x4 bytes
   +0x320 ModuleNamePrefixTableLock : struct _RTL_SRWLOCK, 1 elements, 0x8 bytes
   +0x328 BitmapAllocator  : struct _ALLOCATOR, 28 elements, 0x90 bytes
   +0x3b8 UnicodeStringBufferAllocator : struct _ALLOCATOR, 28 elements, 0x90 bytes
   +0x448 ImageFileAllocator : struct _ALLOCATOR, 28 elements, 0x90 bytes
   +0x4d8 AtExitExEntry    : Ptr64 to struct _RTL_ATEXIT_ENTRY, 0 elements, 0x0 bytes
   +0x4e0 SymbolContext    : Ptr64 to struct _TRACE_SYMBOL_CONTEXT, 21 elements, 0x100 bytes
   +0x4e8 DebugContext     : Ptr64 to struct _TRACE_DEBUG_CONTEXT, 24 elements, 0x1c0 bytes
   +0x4f0 DllNotificationCookie : Ptr64 to Void
   +0x4f8 BitmapBufferSizeInQuadwords : Uint4B
   +0x500 IgnorePreferredAddressesBitmap : struct _RTL_BITMAP, 2 elements, 0x10 bytes
   +0x510 BitmapBuffer     : [1] Uint8B
   +0x510 TraceStoreNullId : Bitfield Pos 0, 1 Bit
   +0x510 TraceStoreEventId : Bitfield Pos 1, 1 Bit
   +0x510 TraceStoreStringBufferId : Bitfield Pos 2, 1 Bit
   +0x510 TraceStoreFunctionTableId : Bitfield Pos 3, 1 Bit
   +0x510 TraceStoreFunctionTableEntryId : Bitfield Pos 4, 1 Bit
   +0x510 TraceStorePathTableId : Bitfield Pos 5, 1 Bit
   +0x510 TraceStorePathTableEntryId : Bitfield Pos 6, 1 Bit
   +0x510 TraceStoreSessionId : Bitfield Pos 7, 1 Bit
   +0x510 TraceStoreStringArrayId : Bitfield Pos 8, 1 Bit
   +0x510 TraceStoreStringTableId : Bitfield Pos 9, 1 Bit
   +0x510 TraceStoreEventTraitsExId : Bitfield Pos 10, 1 Bit
   +0x510 TraceStoreWsWatchInfoExId : Bitfield Pos 11, 1 Bit
   +0x510 TraceStoreWorkingSetExId : Bitfield Pos 12, 1 Bit
0:000> dt -v TraceStore!_TRACE_SYMBOL_CONTEXT
struct _TRACE_SYMBOL_CONTEXT, 21 elements, 0x100 bytes
   +0x000 SizeOfStruct     : Uint4B
   +0x004 Flags            : union _TRACE_SYMBOL_CONTEXT_FLAGS, 2 elements, 0x4 bytes
   +0x008 State            : Enum _TRACE_SYMBOL_CONTEXT_STATE,  7 total enums

   +0x00c ThreadId         : Uint4B
   +0x010 ThreadHandle     : Ptr64 to Void
   +0x018 CriticalSection  : struct _RTL_CRITICAL_SECTION, 6 elements, 0x28 bytes
   +0x040 WorkList         : struct _GUARDED_LIST, 3 elements, 0x20 bytes
   +0x060 TraceContext     : Ptr64 to struct _TRACE_CONTEXT, 73 elements, 0x520 bytes
   +0x068 ThreadEntry      : Ptr64 to     unsigned long 
   +0x070 ShutdownEvent    : Ptr64 to Void
   +0x078 WorkAvailableEvent : Ptr64 to Void
   +0x080 AtExitExEntry    : Ptr64 to struct _RTL_ATEXIT_ENTRY, 0 elements, 0x0 bytes
   +0x088 LastError        : Uint4B
   +0x08c NumberOfWorkItemsProcessed : Uint4B
   +0x090 NumberOfWorkItemsSucceeded : Uint4B
   +0x094 NumberOfWorkItemsFailed : Uint4B
   +0x098 CurrentModuleTableEntry : Ptr64 to struct _TRACE_MODULE_TABLE_ENTRY, 25 elements, 0x3e0 bytes
   +0x0a0 CurrentTimestamp : union _LARGE_INTEGER, 4 elements, 0x8 bytes
   +0x0a8 DebugEngineSession : Ptr64 to struct _DEBUG_ENGINE_SESSION, 67 elements, 0x2f0 bytes
   +0x0b0 DestroyDebugEngineSession : Ptr64 to     void 
   +0x0b8 Reserved         : [72] UChar
0:000> dt -v TraceStore!_TRACE_SYMBOL_TABLE_FLAGS
struct _TRACE_SYMBOL_TABLE_FLAGS, 1 elements, 0x4 bytes
   +0x000 Initialized      : Bitfield Pos 0, 1 Bit
0:000> dt -v TraceStore!_TRACE_SYMBOL_TABLE
struct _TRACE_SYMBOL_TABLE, 7 elements, 0x200 bytes
   +0x000 SizeOfStruct     : Uint4B
   +0x004 Flags            : struct _TRACE_SYMBOL_TABLE_FLAGS, 1 elements, 0x4 bytes
   +0x008 Padding1         : Uint8B
   +0x010 SymbolHashAvlTable : struct _RTL_AVL_TABLE, 13 elements, 0x68 bytes
   +0x078 SymbolPrefixTable : struct _PREFIX_TABLE, 4 elements, 0x10 bytes
   +0x088 ModuleTableEntry : Ptr64 to struct _TRACE_MODULE_TABLE_ENTRY, 25 elements, 0x3e0 bytes
   +0x090 Reserved         : [368] UChar
0:000> dt -v TraceStore!_TRACE_SYMBOL_TABLE_ENTRY
struct _TRACE_SYMBOL_TABLE_ENTRY, 5 elements, 0x40 bytes
   +0x000 SymbolNameHash   : Uint4B
   +0x004 FullSymbolNameHash : Uint4B
   +0x008 SizeOfStruct     : Uint4B
   +0x00c Flags            : struct _TRACE_SYMBOL_TABLE_ENTRY_FLAGS, 1 elements, 0x4 bytes
   +0x010 PrefixTableEntry : struct _PREFIX_TABLE_ENTRY, 5 elements, 0x30 bytes
0:000> dt -v TraceStore!_TRACE_DEBUG_CONTEXT
struct _TRACE_DEBUG_CONTEXT, 24 elements, 0x1c0 bytes
   +0x000 SizeOfStruct     : Uint4B
   +0x004 Flags            : union _TRACE_DEBUG_CONTEXT_FLAGS, 2 elements, 0x4 bytes
   +0x008 State            : Enum _TRACE_DEBUG_CONTEXT_STATE,  7 total enums

   +0x00c ThreadId         : Uint4B
   +0x010 ThreadHandle     : Ptr64 to Void
   +0x018 CriticalSection  : struct _RTL_CRITICAL_SECTION, 6 elements, 0x28 bytes
   +0x040 WorkList         : struct _GUARDED_LIST, 3 elements, 0x20 bytes
   +0x060 TraceContext     : Ptr64 to struct _TRACE_CONTEXT, 73 elements, 0x520 bytes
   +0x068 ThreadEntry      : Ptr64 to     unsigned long 
   +0x070 ShutdownEvent    : Ptr64 to Void
   +0x078 WorkAvailableEvent : Ptr64 to Void
   +0x080 AtExitExEntry    : Ptr64 to struct _RTL_ATEXIT_ENTRY, 0 elements, 0x0 bytes
   +0x088 LastError        : Uint4B
   +0x08c NumberOfWorkItemsProcessed : Uint4B
   +0x090 NumberOfWorkItemsSucceeded : Uint4B
   +0x094 NumberOfWorkItemsFailed : Uint4B
   +0x098 NumberOfWorkItemsIgnored : Uint4B
   +0x09c Padding          : Uint4B
   +0x0a0 CurrentModuleTableEntry : Ptr64 to struct _TRACE_MODULE_TABLE_ENTRY, 25 elements, 0x3e0 bytes
   +0x0a8 CurrentTimestamp : union _LARGE_INTEGER, 4 elements, 0x8 bytes
   +0x0b0 DebugEngineSession : Ptr64 to struct _DEBUG_ENGINE_SESSION, 67 elements, 0x2f0 bytes
   +0x0b8 DestroyDebugEngineSession : Ptr64 to     void 
   +0x0c0 Allocator        : struct _ALLOCATOR, 28 elements, 0x90 bytes
   +0x150 Reserved         : [112] UChar
0:000> dt -v TraceStore!_TRACE_TYPE_INFO_TABLE_FLAGS
struct _TRACE_TYPE_INFO_TABLE_FLAGS, 1 elements, 0x4 bytes
   +0x000 Initialized      : Bitfield Pos 0, 1 Bit
0:000> dt -v TraceStore!_TRACE_TYPE_INFO_TABLE
struct _TRACE_TYPE_INFO_TABLE, 7 elements, 0x200 bytes
   +0x000 SizeOfStruct     : Uint4B
   +0x004 Flags            : struct _TRACE_TYPE_INFO_TABLE_FLAGS, 1 elements, 0x4 bytes
   +0x008 Padding1         : Uint8B
   +0x010 TypeInfoTable    : struct _RTL_AVL_TABLE, 13 elements, 0x68 bytes
   +0x078 TypeInfoPrefixTable : struct _PREFIX_TABLE, 4 elements, 0x10 bytes
   +0x088 ModuleTableEntry : Ptr64 to struct _TRACE_MODULE_TABLE_ENTRY, 25 elements, 0x3e0 bytes
   +0x090 Reserved         : [368] UChar
0:000> dt -v TraceStore!_TRACE_TYPE_INFO_TABLE_ENTRY
struct _TRACE_TYPE_INFO_TABLE_ENTRY, 5 elements, 0x40 bytes
   +0x000 TypeNameHash     : Uint4B
   +0x004 FullSymbolNameHash : Uint4B
   +0x008 SizeOfStruct     : Uint4B
   +0x00c Flags            : struct _TRACE_TYPE_INFO_TABLE_ENTRY_FLAGS, 1 elements, 0x4 bytes
   +0x010 PrefixTableEntry : struct _PREFIX_TABLE_ENTRY, 5 elements, 0x30 bytes
0:000> dt -v TraceStore!_TRACE_FUNCTION_TABLE_FLAGS
struct _TRACE_FUNCTION_TABLE_FLAGS, 1 elements, 0x4 bytes
   +0x000 Initialized      : Bitfield Pos 0, 1 Bit
0:000> dt -v TraceStore!_TRACE_FUNCTION_TABLE
struct _TRACE_FUNCTION_TABLE, 7 elements, 0x200 bytes
   +0x000 SizeOfStruct     : Uint4B
   +0x004 Flags            : struct _TRACE_FUNCTION_TABLE_FLAGS, 1 elements, 0x4 bytes
   +0x008 Padding1         : Uint8B
   +0x010 FunctionTable    : struct _RTL_AVL_TABLE, 13 elements, 0x68 bytes
   +0x078 FunctionPrefixTable : struct _PREFIX_TABLE, 4 elements, 0x10 bytes
   +0x088 ModuleTableEntry : Ptr64 to struct _TRACE_MODULE_TABLE_ENTRY, 25 elements, 0x3e0 bytes
   +0x090 Reserved         : [368] UChar
0:000> dt -v TraceStore!_TRACE_FUNCTION_TABLE_ENTRY
struct _TRACE_FUNCTION_TABLE_ENTRY, 5 elements, 0x40 bytes
   +0x000 SymbolNameHash   : Uint4B
   +0x004 FullSymbolNameHash : Uint4B
   +0x008 SizeOfStruct     : Uint4B
   +0x00c Flags            : struct _TRACE_FUNCTION_TABLE_ENTRY_FLAGS, 1 elements, 0x4 bytes
   +0x010 PrefixTableEntry : struct _PREFIX_TABLE_ENTRY, 5 elements, 0x30 bytes
0:000> dt -v TraceStore!_TRACE_STORE_STRUCTURE_SIZES
struct _TRACE_STORE_STRUCTURE_SIZES, 10 elements, 0x28 bytes
   +0x000 TraceStore       : Uint4B
   +0x004 TraceStores      : Uint4B
   +0x008 TraceContext     : Uint4B
   +0x00c TraceStoreStartTime : Uint4B
   +0x010 TraceStoreInfo   : Uint4B
   +0x014 TraceStoreMetadataInfo : Uint4B
   +0x018 TraceStoreReloc  : Uint4B
   +0x01c TraceStoreAddress : Uint4B
   +0x020 TraceStoreAddressRange : Uint4B
   +0x024 AddressBitCounts : Uint4B
0:000> dt -v TraceStore!_TRACE_STORE_INTERVAL
struct _TRACE_STORE_INTERVAL, 4 elements, 0x20 bytes
   +0x000 IntervalIndex    : Uint8B
   +0x008 RecordIndex      : Uint8B
   +0x010 AllocationTimestamp : Uint8B
   +0x018 Address          : Uint8B
0:000> dt -v TraceStore!_TRACE_STORE_INTERVALS
struct _TRACE_STORE_INTERVALS, 16 elements, 0x80 bytes
   +0x000 FramesPerSecond  : Float
   +0x008 TicksPerIntervalAsDouble : Float
   +0x010 TicksPerInterval : Uint8B
   +0x018 Frequency        : Uint8B
   +0x020 NumberOfIntervals : Uint8B
   +0x028 IntervalExtractionTimeInMicroseconds : Uint8B
   +0x030 NumberOfRecords  : Uint8B
   +0x038 RecordSizeInBytes : Uint8B
   +0x040 FirstAllocationTimestamp : Ptr64 to Uint8B
   +0x048 LastAllocationTimestamp : Ptr64 to Uint8B
   +0x050 FirstRecordAddress : Uint8B
   +0x058 LastRecordAddress : Uint8B
   +0x060 FirstInterval    : Ptr64 to struct _TRACE_STORE_INTERVAL, 4 elements, 0x20 bytes
   +0x068 LastInterval     : Ptr64 to struct _TRACE_STORE_INTERVAL, 4 elements, 0x20 bytes
   +0x070 LoadingCompleteEvent : Ptr64 to Void
   +0x078 Padding          : Ptr64 to Void
0:000> dt -v TraceStore!_TRACE_STORE_SQLITE3_VTAB
struct _TRACE_STORE_SQLITE3_VTAB, 6 elements, 0x18 bytes
   +0x000 Sqlite3Module    : Ptr64 to struct _SQLITE3_MODULE, 24 elements, 0xb8 bytes
   +0x000 Module           : Ptr64 to struct _TRACE_STORE_SQLITE3_MODULE, 0 elements, 0x0 bytes
   +0x008 NumberOfOpenCursors : Int4B
   +0x00c Padding          : Int4B
   +0x010 ErrorMessage     : Ptr64 to Char
   +0x000 AsSqlite3Vtab    : struct _SQLITE3_VTAB, 4 elements, 0x18 bytes
0:000> dt -v TraceStore!_TRACE_STORE_FLAGS
struct _TRACE_STORE_FLAGS, 20 elements, 0x4 bytes
   +0x000 NoRetire         : Bitfield Pos 0, 1 Bit
   +0x000 NoPrefaulting    : Bitfield Pos 1, 1 Bit
   +0x000 IgnorePreferredAddresses : Bitfield Pos 2, 1 Bit
   +0x000 IsReadonly       : Bitfield Pos 3, 1 Bit
   +0x000 SetEndOfFileOnClose : Bitfield Pos 4, 1 Bit
   +0x000 IsMetadata       : Bitfield Pos 5, 1 Bit
   +0x000 HasRelocations   : Bitfield Pos 6, 1 Bit
   +0x000 NoTruncate       : Bitfield Pos 7, 1 Bit
   +0x000 IsRelocationTarget : Bitfield Pos 8, 1 Bit
   +0x000 HasSelfRelocations : Bitfield Pos 9, 1 Bit
   +0x000 OnlyRelocationIsToSelf : Bitfield Pos 10, 1 Bit
   +0x000 OnlyRelocationIsToNull : Bitfield Pos 11, 1 Bit
   +0x000 HasMultipleRelocationWaits : Bitfield Pos 12, 1 Bit
   +0x000 RequiresSelfRelocation : Bitfield Pos 13, 1 Bit
   +0x000 HasNullStoreRelocations : Bitfield Pos 14, 1 Bit
   +0x000 BeginningRundown : Bitfield Pos 15, 1 Bit
   +0x000 RundownComplete  : Bitfield Pos 16, 1 Bit
   +0x000 HasFlatMapping   : Bitfield Pos 17, 1 Bit
   +0x000 FlatMappingLoaded : Bitfield Pos 18, 1 Bit
   +0x000 Unused           : Bitfield Pos 19, 13 Bits
0:000> dt -v TraceStore!_TRACE_STORE
struct _TRACE_STORE, 149 elements, 0x800 bytes
   +0x000 TraceStoreId     : Enum _TRACE_STORE_ID,  62 total enums

   +0x004 TraceStoreMetadataId : Enum _TRACE_STORE_METADATA_ID,  11 total enums

   +0x008 TraceStoreIndex  : Enum _TRACE_STORE_INDEX,  601 total enums

   +0x00c NoRetire         : Bitfield Pos 0, 1 Bit
   +0x00c NoPrefaulting    : Bitfield Pos 1, 1 Bit
   +0x00c IgnorePreferredAddresses : Bitfield Pos 2, 1 Bit
   +0x00c IsReadonly       : Bitfield Pos 3, 1 Bit
   +0x00c SetEndOfFileOnClose : Bitfield Pos 4, 1 Bit
   +0x00c IsMetadata       : Bitfield Pos 5, 1 Bit
   +0x00c HasRelocations   : Bitfield Pos 6, 1 Bit
   +0x00c NoTruncate       : Bitfield Pos 7, 1 Bit
   +0x00c IsRelocationTarget : Bitfield Pos 8, 1 Bit
   +0x00c HasSelfRelocations : Bitfield Pos 9, 1 Bit
   +0x00c OnlyRelocationIsToSelf : Bitfield Pos 10, 1 Bit
   +0x00c OnlyRelocationIsToNull : Bitfield Pos 11, 1 Bit
   +0x00c HasMultipleRelocationWaits : Bitfield Pos 12, 1 Bit
   +0x00c RequiresSelfRelocation : Bitfield Pos 13, 1 Bit
   +0x00c HasNullStoreRelocations : Bitfield Pos 14, 1 Bit
   +0x00c BeginningRundown : Bitfield Pos 15, 1 Bit
   +0x00c RundownComplete  : Bitfield Pos 16, 1 Bit
   +0x00c HasFlatMapping   : Bitfield Pos 17, 1 Bit
   +0x00c FlatMappingLoaded : Bitfield Pos 18, 1 Bit
   +0x00c UnusedStoreFlagBits : Bitfield Pos 19, 13 Bits
   +0x00c StoreFlags       : struct _TRACE_STORE_FLAGS, 20 elements, 0x4 bytes
   +0x010 TraceFlags       : struct _TRACE_FLAGS, 20 elements, 0x4 bytes
   +0x014 InitialTraits    : struct _TRACE_STORE_TRAITS, 17 elements, 0x4 bytes
   +0x018 TracerConfig     : Ptr64 to struct _TRACER_CONFIG, 15 elements, 0x1c0 bytes
   +0x020 LastError        : Uint4B
   +0x024 TotalNumberOfMemoryMaps : Int4B
   +0x028 NumberOfActiveMemoryMaps : Int4B
   +0x02c NumberOfNonRetiredMemoryMaps : Int4B
   +0x030 CloseMemoryMaps  : union _SLIST_HEADER, 3 elements, 0x10 bytes
   +0x040 PrepareMemoryMaps : union _SLIST_HEADER, 3 elements, 0x10 bytes
   +0x050 PrepareReadonlyMemoryMaps : union _SLIST_HEADER, 3 elements, 0x10 bytes
   +0x060 NextMemoryMaps   : union _SLIST_HEADER, 3 elements, 0x10 bytes
   +0x070 FreeMemoryMaps   : union _SLIST_HEADER, 3 elements, 0x10 bytes
   +0x080 PrefaultMemoryMaps : union _SLIST_HEADER, 3 elements, 0x10 bytes
   +0x090 NonRetiredMemoryMaps : union _SLIST_HEADER, 3 elements, 0x10 bytes
   +0x0a0 SingleMemoryMap  : struct _TRACE_STORE_MEMORY_MAP, 10 elements, 0x40 bytes
   +0x0e0 StoresListEntry  : struct _LIST_ENTRY, 2 elements, 0x10 bytes
   +0x0f0 MetadataListHead : struct _LIST_ENTRY, 2 elements, 0x10 bytes
   +0x0f0 MetadataListEntry : struct _LIST_ENTRY, 2 elements, 0x10 bytes
   +0x100 ListEntry        : struct _SLIST_ENTRY, 1 elements, 0x10 bytes
   +0x100 Next             : Ptr64 to struct _SLIST_ENTRY, 1 elements, 0x10 bytes
   +0x108 Unused           : Ptr64 to Void
   +0x110 Rtl              : Ptr64 to struct _RTL, 483 elements, 0x1020 bytes
   +0x118 pAllocator       : Ptr64 to struct _ALLOCATOR, 28 elements, 0x90 bytes
   +0x120 TraceContext     : Ptr64 to struct _TRACE_CONTEXT, 73 elements, 0x520 bytes
   +0x128 InitialSize      : union _LARGE_INTEGER, 4 elements, 0x8 bytes
   +0x130 ExtensionSize    : union _LARGE_INTEGER, 4 elements, 0x8 bytes
   +0x138 MappingSize      : union _LARGE_INTEGER, 4 elements, 0x8 bytes
   +0x140 PrefaultFuturePageWork : Ptr64 to struct _TP_WORK, 0 elements, 0x0 bytes
   +0x148 PrepareNextMemoryMapWork : Ptr64 to struct _TP_WORK, 0 elements, 0x0 bytes
   +0x150 PrepareReadonlyNonStreamingMemoryMapWork : Ptr64 to struct _TP_WORK, 0 elements, 0x0 bytes
   +0x158 CloseMemoryMapWork : Ptr64 to struct _TP_WORK, 0 elements, 0x0 bytes
   +0x160 NextMemoryMapAvailableEvent : Ptr64 to Void
   +0x168 AllMemoryMapsAreFreeEvent : Ptr64 to Void
   +0x170 ReadonlyMappingCompleteEvent : Ptr64 to Void
   +0x178 BindCompleteEvent : Ptr64 to Void
   +0x180 ResumeAllocationsEvent : Ptr64 to Void
   +0x188 RelocationCompleteWaitEvent : Ptr64 to Void
   +0x190 RelocationCompleteWaitEvents : Ptr64 to Ptr64 to Void
   +0x198 PrevMemoryMap    : Ptr64 to struct _TRACE_STORE_MEMORY_MAP, 10 elements, 0x40 bytes
   +0x1a0 MemoryMap        : Ptr64 to struct _TRACE_STORE_MEMORY_MAP, 10 elements, 0x40 bytes
   +0x1a8 NumberOfRelocationBackReferences : Uint4B
   +0x1ac OutstandingRelocationBinds : Uint4B
   +0x1b0 MappedSequenceId : Int4B
   +0x1b4 MetadataBindsInProgress : Int4B
   +0x1b8 PrepareReadonlyNonStreamingMapsInProgress : Int4B
   +0x1bc ReadonlyNonStreamingBindCompletesInProgress : Int4B
   +0x1c0 ActiveAllocators : Int4B
   +0x1c4 NumberOfRelocationDependencies : Uint4B
   +0x1c8 NumberOfRelocationsRequired : Uint4B
   +0x1cc SequenceId       : Uint4B
   +0x1d0 NumaNode         : Uint4B
   +0x1d4 CreateFileDesiredAccess : Uint4B
   +0x1d8 CreateFileCreationDisposition : Uint4B
   +0x1dc CreateFileMappingProtectionFlags : Uint4B
   +0x1e0 CreateFileFlagsAndAttributes : Uint4B
   +0x1e4 MapViewOfFileDesiredAccess : Uint4B
   +0x1e8 MappingHandle    : Ptr64 to Void
   +0x1f0 FileHandle       : Ptr64 to Void
   +0x1f8 PrevAddress      : Ptr64 to Void
   +0x200 FlatMappingHandle : Ptr64 to Void
   +0x208 FlatAddress      : struct _TRACE_STORE_ADDRESS, 20 elements, 0x80 bytes
   +0x288 FlatAddressRange : struct _TRACE_STORE_ADDRESS_RANGE, 7 elements, 0x40 bytes
   +0x2c8 Padding4         : Uint8B
   +0x2d0 FlatMemoryMap    : struct _TRACE_STORE_MEMORY_MAP, 10 elements, 0x40 bytes
   +0x310 TraceStore       : Ptr64 to struct _TRACE_STORE, 149 elements, 0x800 bytes
   +0x318 MetadataInfoStore : Ptr64 to struct _TRACE_STORE, 149 elements, 0x800 bytes
   +0x320 AllocationStore  : Ptr64 to struct _TRACE_STORE, 149 elements, 0x800 bytes
   +0x328 RelocationStore  : Ptr64 to struct _TRACE_STORE, 149 elements, 0x800 bytes
   +0x330 AddressStore     : Ptr64 to struct _TRACE_STORE, 149 elements, 0x800 bytes
   +0x338 AddressRangeStore : Ptr64 to struct _TRACE_STORE, 149 elements, 0x800 bytes
   +0x340 AllocationTimestampStore : Ptr64 to struct _TRACE_STORE, 149 elements, 0x800 bytes
   +0x348 AllocationTimestampDeltaStore : Ptr64 to struct _TRACE_STORE, 149 elements, 0x800 bytes
   +0x350 SynchronizationStore : Ptr64 to struct _TRACE_STORE, 149 elements, 0x800 bytes
   +0x358 InfoStore        : Ptr64 to struct _TRACE_STORE, 149 elements, 0x800 bytes
   +0x360 RelocationDependencyStores : Ptr64 to Ptr64 to struct _TRACE_STORE, 149 elements, 0x800 bytes
   +0x360 RelocationDependencyStore : Ptr64 to struct _TRACE_STORE, 149 elements, 0x800 bytes
   +0x368 AllocateRecords  : Ptr64 to     void* 
   +0x370 AllocateRecordsWithTimestamp : Ptr64 to     void* 
   +0x378 TryAllocateRecords : Ptr64 to     void* 
   +0x380 TryAllocateRecordsWithTimestamp : Ptr64 to     void* 
   +0x388 SuspendedAllocateRecordsWithTimestamp : Ptr64 to     void* 
   +0x390 AllocateRecordsWithTimestampImpl1 : Ptr64 to     void* 
   +0x398 AllocateRecordsWithTimestampImpl2 : Ptr64 to     void* 
   +0x3a0 BindComplete     : Ptr64 to     int 
   +0x3a8 pReloc           : Ptr64 to struct _TRACE_STORE_RELOC, 9 elements, 0x48 bytes
   +0x3b0 pTraits          : Ptr64 to struct _TRACE_STORE_TRAITS, 17 elements, 0x4 bytes
   +0x3b8 Eof              : Ptr64 to struct _TRACE_STORE_EOF, 1 elements, 0x8 bytes
   +0x3c0 Time             : Ptr64 to struct _TRACE_STORE_TIME, 3 elements, 0x58 bytes
   +0x3c8 Stats            : Ptr64 to struct _TRACE_STORE_STATS, 11 elements, 0x40 bytes
   +0x3d0 Totals           : Ptr64 to struct _TRACE_STORE_TOTALS, 4 elements, 0x20 bytes
   +0x3d8 Traits           : Ptr64 to struct _TRACE_STORE_TRAITS, 17 elements, 0x4 bytes
   +0x3e0 Info             : Ptr64 to struct _TRACE_STORE_INFO, 6 elements, 0x100 bytes
   +0x3e8 Reloc            : Ptr64 to struct _TRACE_STORE_RELOC, 9 elements, 0x48 bytes
   +0x3f0 Allocation       : Ptr64 to struct _TRACE_STORE_ALLOCATION, 2 elements, 0x10 bytes
   +0x3f8 AllocationTimestamp : Ptr64 to struct _TRACE_STORE_ALLOCATION_TIMESTAMP, 1 elements, 0x8 bytes
   +0x400 AllocationTimestampDelta : Ptr64 to struct _TRACE_STORE_ALLOCATION_TIMESTAMP_DELTA, 1 elements, 0x4 bytes
   +0x408 Address          : Ptr64 to struct _TRACE_STORE_ADDRESS, 20 elements, 0x80 bytes
   +0x410 AddressRange     : Ptr64 to struct _TRACE_STORE_ADDRESS_RANGE, 7 elements, 0x40 bytes
   +0x418 Sync             : Ptr64 to struct _TRACE_STORE_SYNC, 6 elements, 0x100 bytes
   +0x420 NumberOfAllocations : union _ULARGE_INTEGER, 4 elements, 0x8 bytes
   +0x428 NumberOfAddresses : union _ULARGE_INTEGER, 4 elements, 0x8 bytes
   +0x430 NumberOfAddressRanges : union _ULARGE_INTEGER, 4 elements, 0x8 bytes
   +0x438 NumberOfReadonlyAddressRanges : union _ULARGE_INTEGER, 4 elements, 0x8 bytes
   +0x440 ReadonlyAddresses : Ptr64 to struct _TRACE_STORE_ADDRESS, 20 elements, 0x80 bytes
   +0x448 ReadonlyMemoryMaps : Ptr64 to struct _TRACE_STORE_MEMORY_MAP, 10 elements, 0x40 bytes
   +0x450 ReadonlyAddressRanges : Ptr64 to struct _TRACE_STORE_ADDRESS_RANGE, 7 elements, 0x40 bytes
   +0x458 ReadonlyMappingSizes : Ptr64 to union _ULARGE_INTEGER, 4 elements, 0x8 bytes
   +0x460 ReadonlyPreferredAddressUnavailable : Uint4B
   +0x464 Padding5         : Uint4B
   +0x468 DataType         : struct <unnamed-tag>, 2 elements, 0x10 bytes
   +0x478 Allocator        : struct _ALLOCATOR, 28 elements, 0x90 bytes
   +0x508 IntervalFramesPerSecond : Uint8B
   +0x510 Intervals        : struct _TRACE_STORE_INTERVALS, 16 elements, 0x80 bytes
   +0x590 Db               : Ptr64 to struct _TRACE_STORE_SQLITE3_DB, 40 elements, 0x4b0 bytes
   +0x598 Sqlite3Schema    : Ptr64 to Char
   +0x5a0 Sqlite3VirtualTableName : Ptr64 to Char
   +0x5a8 Sqlite3Column    : Ptr64 to     long 
   +0x5b0 Sqlite3Module    : struct _SQLITE3_MODULE, 24 elements, 0xb8 bytes
   +0x668 Sqlite3VirtualTable : struct _TRACE_STORE_SQLITE3_VTAB, 6 elements, 0x18 bytes
   +0x680 Sqlite3IntervalSchema : Ptr64 to Char
   +0x688 Sqlite3IntervalVirtualTableName : Ptr64 to Char
   +0x690 Sqlite3IntervalColumn : Ptr64 to     long 
   +0x698 Sqlite3IntervalModule : struct _SQLITE3_MODULE, 24 elements, 0xb8 bytes
   +0x750 Sqlite3IntervalVirtualTable : struct _TRACE_STORE_SQLITE3_VTAB, 6 elements, 0x18 bytes
   +0x768 Padding6         : [18] Uint8B
0:000> dt -v TraceStore!_TRACE_STORES
struct _TRACE_STORES, 18 elements, 0x12e000 bytes
   +0x000 SizeOfStruct     : Uint4B
   +0x004 SizeOfAllocation : Uint4B
   +0x008 NumberOfTraceStores : Uint2B
   +0x00a ElementsPerTraceStore : Uint2B
   +0x00c NumberOfFieldRelocationsElements : Uint2B
   +0x00e Padding1         : Uint2B
   +0x010 Padding2         : Uint4B
   +0x014 Flags            : struct _TRACE_FLAGS, 20 elements, 0x4 bytes
   +0x018 BaseDirectory    : struct _UNICODE_STRING, 5 elements, 0x10 bytes
   +0x028 Rtl              : Ptr64 to struct _RTL, 483 elements, 0x1020 bytes
   +0x030 Allocator        : Ptr64 to struct _ALLOCATOR, 28 elements, 0x90 bytes
   +0x038 TracerConfig     : Ptr64 to struct _TRACER_CONFIG, 15 elements, 0x1c0 bytes
   +0x040 RundownListEntry : struct _LIST_ENTRY, 2 elements, 0x10 bytes
   +0x050 Rundown          : Ptr64 to struct _TRACE_STORES_RUNDOWN, 5 elements, 0x40 bytes
   +0x058 StoresListHead   : struct _LIST_ENTRY, 2 elements, 0x10 bytes
   +0x080 RelocationCompleteEvents : [60] Ptr64 to Void
   +0x400 Relocations      : [60] struct _TRACE_STORE_RELOC, 9 elements, 0x48 bytes
   +0x2000 Stores           : [600] struct _TRACE_STORE, 149 elements, 0x800 bytes
0:000> dt -v TraceStore!_TRACE_STORE_METADATA_STORES
struct _TRACE_STORE_METADATA_STORES, 9 elements, 0x48 bytes
   +0x000 MetadataInfoStore : Ptr64 to struct _TRACE_STORE, 149 elements, 0x800 bytes
   +0x008 AllocationStore  : Ptr64 to struct _TRACE_STORE, 149 elements, 0x800 bytes
   +0x010 RelocationStore  : Ptr64 to struct _TRACE_STORE, 149 elements, 0x800 bytes
   +0x018 AddressStore     : Ptr64 to struct _TRACE_STORE, 149 elements, 0x800 bytes
   +0x020 AddressRangeStore : Ptr64 to struct _TRACE_STORE, 149 elements, 0x800 bytes
   +0x028 AllocationTimestampStore : Ptr64 to struct _TRACE_STORE, 149 elements, 0x800 bytes
   +0x030 AllocationTimestampDeltaStore : Ptr64 to struct _TRACE_STORE, 149 elements, 0x800 bytes
   +0x038 SynchronizationStore : Ptr64 to struct _TRACE_STORE, 149 elements, 0x800 bytes
   +0x040 InfoStore        : Ptr64 to struct _TRACE_STORE, 149 elements, 0x800 bytes
0:000> dt -v TraceStore!_TRACE_STORES_RUNDOWN_FLAGS
struct _TRACE_STORES_RUNDOWN_FLAGS, 1 elements, 0x4 bytes
   +0x000 IsActive         : Bitfield Pos 0, 1 Bit
0:000> dt -v TraceStore!_TRACE_STORE_SQLITE3_FUNCTION
struct _TRACE_STORE_SQLITE3_FUNCTION, 9 elements, 0x38 bytes
   +0x000 Id               : Enum _TRACE_STORE_SQLITE3_FUNCTION_ID,  5 total enums

   +0x004 Flags            : union _TRACE_STORE_SQLITE3_FUNCTION_FLAGS, 3 elements, 0x4 bytes
   +0x008 Name             : Ptr64 to Char
   +0x010 NumberOfArguments : Int4B
   +0x014 TextEncoding     : Int4B
   +0x018 ScalarFunction   : Ptr64 to     void 
   +0x020 AggregateStepFunction : Ptr64 to     void 
   +0x028 AggregateFinalFunction : Ptr64 to     void 
   +0x030 DestroyFunction  : Ptr64 to     void 
0:000> dt -v TraceStore!_TRACE_STORE_COLUMN
struct _TRACE_STORE_COLUMN, 6 elements, 0x28 bytes
   +0x000 Type             : union _TRACE_STORE_COLUMN_TYPE, 3 elements, 0x4 bytes
   +0x004 Flags            : union _TRACE_STORE_COLUMN_FLAGS, 3 elements, 0x4 bytes
   +0x008 Offset           : Int8B
   +0x010 SizeInBytes      : Uint8B
   +0x018 PointedToColumn  : Ptr64 to struct _TRACE_STORE_COLUMN, 6 elements, 0x28 bytes
   +0x020 Name             : Ptr64 to Char
0:000> dt -v TraceStore!_TRACE_STORE_SQLITE3_CURSOR
struct _TRACE_STORE_SQLITE3_CURSOR, 38 elements, 0x108 bytes
   +0x000 Traits           : struct _TRACE_STORE_TRAITS, 17 elements, 0x4 bytes
   +0x004 Flags            : union _TRACE_STORE_SQLITE3_CURSOR_FLAGS, 8 elements, 0x4 bytes
   +0x008 Rowid            : Uint8B
   +0x010 FirstRow         : union _TRACE_STORE_ROW, 29 elements, 0x8 bytes
   +0x010 FirstRowRaw      : Uint8B
   +0x018 FirstRowid       : Uint8B
   +0x020 LastRow          : union _TRACE_STORE_ROW, 29 elements, 0x8 bytes
   +0x020 LastRowRaw       : Uint8B
   +0x028 LastRowid        : Uint8B
   +0x030 MaxRowid         : Uint8B
   +0x038 CurrentRow       : union _TRACE_STORE_ROW, 29 elements, 0x8 bytes
   +0x038 CurrentRowRaw    : Uint8B
   +0x040 CurrentRecordCount : Int8B
   +0x048 CurrentAllocationCount : Int8B
   +0x050 TotalNumberOfRecords : Int8B
   +0x058 TotalNumberOfAllocations : Int8B
   +0x060 MetadataRecordSizeInBytes : Uint8B
   +0x068 TraceStoreRecordSizeInBytes : Uint8B
   +0x070 MemoryMap        : Ptr64 to struct _TRACE_STORE_MEMORY_MAP, 10 elements, 0x40 bytes
   +0x078 Address          : Ptr64 to struct _TRACE_STORE_ADDRESS, 20 elements, 0x80 bytes
   +0x080 AddressRange     : Ptr64 to struct _TRACE_STORE_ADDRESS_RANGE, 7 elements, 0x40 bytes
   +0x088 Allocation       : Ptr64 to struct _TRACE_STORE_ALLOCATION, 2 elements, 0x10 bytes
   +0x090 CurrentCoalescedAllocationNumber : Int8B
   +0x098 TotalCoalescedAllocations : Int8B
   +0x0a0 TraceStore       : Ptr64 to struct _TRACE_STORE, 149 elements, 0x800 bytes
   +0x0a8 Db               : Ptr64 to struct _TRACE_STORE_SQLITE3_DB, 40 elements, 0x4b0 bytes
   +0x0b0 Intervals        : Ptr64 to struct _TRACE_STORE_INTERVALS, 16 elements, 0x80 bytes
   +0x0b8 IntervalRecordSize : Uint8B
   +0x0c0 Sqlite3Column    : Ptr64 to     long 
   +0x0c8 Sqlite3          : Ptr64 to struct _SQLITE3_API_ROUTINES, 217 elements, 0x6c8 bytes
   +0x0d0 OpenedTimestamp  : union _LARGE_INTEGER, 4 elements, 0x8 bytes
   +0x0d8 FilterArguments  : Ptr64 to Ptr64 to struct Mem, 0 elements, 0x0 bytes
   +0x0e0 NumberOfArguments : Int4B
   +0x0e4 FilterIndexNumber : Int4B
   +0x0e8 FilterIndexStringBuffer : Ptr64 to Char
   +0x0f0 FilterIndexString : struct _STRING, 5 elements, 0x10 bytes
   +0x100 VirtualTable     : Ptr64 to struct _SQLITE3_VTAB, 4 elements, 0x18 bytes
   +0x100 AsSqlite3VtabCursor : struct _SQLITE3_VTAB_CURSOR, 1 elements, 0x8 bytes
0:000> dt -v TraceStore!_TRACE_STORE_SQLITE3_DB
struct _TRACE_STORE_SQLITE3_DB, 40 elements, 0x4b0 bytes
   +0x000 SizeOfStruct     : Uint4B
   +0x004 Flags            : union _TRACE_STORE_SQLITE3_DB_FLAGS, 4 elements, 0x4 bytes
   +0x008 State            : union _TRACE_STORE_SQLITE3_DB_STATE, 3 elements, 0x4 bytes
   +0x010 Sqlite3Allocator : Ptr64 to struct _ALLOCATOR, 28 elements, 0x90 bytes
   +0x018 Sqlite3Db        : Ptr64 to struct sqlite3, 0 elements, 0x0 bytes
   +0x020 Sqlite3          : Ptr64 to struct _SQLITE3_API_ROUTINES, 217 elements, 0x6c8 bytes
   +0x028 Rtl              : Ptr64 to struct _RTL, 483 elements, 0x1020 bytes
   +0x030 TracerConfig     : Ptr64 to struct _TRACER_CONFIG, 15 elements, 0x1c0 bytes
   +0x038 TraceSessionDirectory : Ptr64 to struct _UNICODE_STRING, 5 elements, 0x10 bytes
   +0x040 OwningModule     : Ptr64 to Void
   +0x048 OwningModulePath : Ptr64 to struct _RTL_PATH, 18 elements, 0xc0 bytes
   +0x050 Cu               : Ptr64 to struct _CU, 58 elements, 0x1b8 bytes
   +0x058 CuLoadingCompleteEvent : Ptr64 to Void
   +0x060 CuModule         : Ptr64 to struct CU_MODULE, 0 elements, 0x0 bytes
   +0x068 CuContext        : Ptr64 to struct CU_CONTEXT, 0 elements, 0x0 bytes
   +0x070 CuFunctions      : [2] Ptr64 to struct CU_FUNCTION, 0 elements, 0x0 bytes
   +0x080 CuDevice         : Int4B
   +0x084 CuDeviceAttributes : struct _CU_DEVICE_ATTRIBUTES, 91 elements, 0x16c bytes
   +0x1f0 TracerHeapModule : Ptr64 to struct HINSTANCE__, 1 elements, 0x4 bytes
   +0x1f8 StringTableModule : Ptr64 to struct HINSTANCE__, 1 elements, 0x4 bytes
   +0x200 InitializeHeapAllocatorEx : Ptr64 to     int 
   +0x208 InitializeStringTableAllocator : Ptr64 to     int 
   +0x210 CreateStringTable : Ptr64 to     _STRING_TABLE* 
   +0x218 DestroyStringTable : Ptr64 to     void 
   +0x220 CreateStringTableFromDelimitedString : Ptr64 to     _STRING_TABLE* 
   +0x228 CreateStringTableFromDelimitedEnvironmentVariable : Ptr64 to     _STRING_TABLE* 
   +0x230 StringTableAllocator : struct _ALLOCATOR, 28 elements, 0x90 bytes
   +0x2c0 StringArrayAllocator : struct _ALLOCATOR, 28 elements, 0x90 bytes
   +0x350 NumberOfFunctionStringTables : Uint2B
   +0x352 Padding          : [3] Uint2B
   +0x358 FunctionStringTable1 : Ptr64 to struct _STRING_TABLE, 16 elements, 0x200 bytes
   +0x360 MaximumProcessorCount : Uint4B
   +0x368 Threadpool       : Ptr64 to struct _TP_POOL, 0 elements, 0x0 bytes
   +0x370 ThreadpoolCallbackEnviron : struct _TP_CALLBACK_ENVIRON_V3, 10 elements, 0x48 bytes
   +0x3b8 CancellationThreadpool : Ptr64 to struct _TP_POOL, 0 elements, 0x0 bytes
   +0x3c0 CancellationThreadpoolCallbackEnviron : struct _TP_CALLBACK_ENVIRON_V3, 10 elements, 0x48 bytes
   +0x408 Allocator        : struct _ALLOCATOR, 28 elements, 0x90 bytes
   +0x498 TraceSession     : Ptr64 to struct _TRACE_SESSION, 8 elements, 0x48 bytes
   +0x4a0 TraceContext     : Ptr64 to struct _TRACE_CONTEXT, 73 elements, 0x520 bytes
   +0x4a8 TraceStores      : Ptr64 to struct _TRACE_STORES, 18 elements, 0x12e000 bytes
0:000> .logclose
Closing open log file cdb-output.txt
