/*++

Copyright (c) 2016 Trent Nelson <trent@trent.me>

Module Name:

    StringTable.h

Abstract:

    This is the main header file for the StringTable component.  It defines
    structures and functions related to the implementation of the component.

    The main structures are the STRING_ARRAY structure, which is used by
    callers of this component to indicate the set of strings they'd like to
    add to the string table, and the STRING_TABLE structure, which is the main
    data structure used by this component.

    Functions are provided for creating, destroying and searching for whether
    or not there is a prefix string for a given search string present within a
    table.

    The design is optimized for relatively short strings (less than or equal to
    16 chars), and relatively few of them (less than or equal to 16).  These
    restrictive size constraints facilitate aggressive SIMD optimizations when
    searching for the strings within the table, with the goal to minimize the
    maximum possible latency incurred by the lookup mechanism.  The trade-off
    is usability and flexibility -- two things which can be better served by
    prefix trees if the pointer-chasing behavior of said data structures can
    be tolerated.

--*/

#pragma once

#ifdef _STRING_TABLE_INTERNAL_BUILD

//
// This is an internal build of the StringTable component.
//

#include "stdafx.h"

#else

//
// We're being included by an external component.
//

#include "../Rtl/Rtl.h"

#endif

#ifdef __cplusplus
extern "C" {
#endif

#define MAX_STRING_TABLE_ENTRIES 16
#define STRING_TABLE_ALIGNMENT 512

////////////////////////////////////////////////////////////////////////////////
// Structures
////////////////////////////////////////////////////////////////////////////////

typedef struct _Struct_size_bytes_(SizeInQuadwords>>3) _STRING_ARRAY {

    //
    // Size of the structure, in quadwords.  Why quadwords?  It allows us to
    // keep this size field to a USHORT, which helps with the rest of the
    // alignment in this struct (we want the STRING Strings[] array to start
    // on an 8-byte boundary).
    //
    // N.B.: We can't express the exact field size in the SAL annotation
    //       below, because the array of buffer sizes are inexpressible;
    //       however, we know the maximum length, so we can use the implicit
    //       invariant that the total buffer size can't exceed whatever num
    //       elements * max size is.
    //

    _Field_range_(<=, (
        sizeof(struct _STRING_ARRAY) +
        ((NumberOfElements - 1) * sizeof(STRING)) +
        (MaximumLength * NumberOfElements)
    ) >> 3)
    USHORT SizeInQuadwords;

    //
    // Number of elements in the array.
    //

    USHORT NumberOfElements;

    //
    // Minimum and maximum lengths for the String->Length fields.  Optional.
    //

    USHORT MinimumLength;
    USHORT MaximumLength;

    //
    // A pointer to the STRING_TABLE structure that "owns" us.
    //

    struct _STRING_TABLE *StringTable;

    //
    // The string array.  Number of elements in the array is governed by the
    // NumberOfElements field above.
    //

    STRING Strings[ANYSIZE_ARRAY];

} STRING_ARRAY;
typedef STRING_ARRAY *PSTRING_ARRAY;
typedef STRING_ARRAY **PPSTRING_ARRAY;


//
// String tables are composed of a 16 element array of 16 byte string "slots",
// which represent a unique character (with respect to other strings in the
// table) for a string in a given slot index.  The STRING_SLOT structure
// provides a convenient wrapper around this construct.
//

typedef union DECLSPEC_ALIGN(16) _STRING_SLOT {
    XMMWORD CharsXmm;
    CHAR Char[16];
} STRING_SLOT, *PSTRING_SLOT, **PPSTRING_SLOT;
C_ASSERT(sizeof(STRING_SLOT) == 16);

//
// An array of 1 byte unsigned integers used to indicate the 0-based index of
// a given unique character in the corresponding string.
//

typedef union DECLSPEC_ALIGN(16) _SLOT_INDEX {
    XMMWORD IndexXmm;
    BYTE Index[16];
} SLOT_INDEX, *PSLOT_INDEX, **PPSLOT_INDEX;
C_ASSERT(sizeof(SLOT_INDEX) == 16);

//
// A 16 element array of 1 byte unsigned integers, used to capture the length
// of each string slot in a single XMM 128-bit register.
//

typedef union DECLSPEC_ALIGN(16) _SLOT_LENGTHS {
    XMMWORD SlotsXmm;
    BYTE Slots[16];
} SLOT_LENGTHS, *PSLOT_LENGTHS, **PPSLOT_LENGTHS;
C_ASSERT(sizeof(SLOT_LENGTHS) == 16);


//
// Our string table index is simply a char, with -1 indicating no match found.
//

typedef CHAR STRING_TABLE_INDEX;
#define NO_MATCH_FOUND -1

//
// Define the string table flags structure.
//

typedef struct _Struct_size_bytes_(sizeof(ULONG)) _STRING_TABLE_FLAGS {

    //
    // When set, indicates that the CopyArray flag was set to TRUE when the
    // STRING_TABLE was created with CreateStringTable().  This implies the
    // STRING_TABLE owns the STRING_ARRAY, and is responsible for its
    // destruction.
    //
    // If the table does own the array, the destruction routine should still
    // verify a separate allocation was performed for the string array by
    // checking StringTable->pStringArray against &StringTable->StringArray;
    // If the pointers point to the same location, the string array was able
    // to fit in the trailing space of the STRING_TABLE structure, and thus,
    // doesn't need to be deallocated separately (i.e. no separate call to
    // Allocator->Free() is required).
    //

    ULONG CopiedArray:1;

    //
    // Remaining space.
    //

    ULONG Unused:31;

} STRING_TABLE_FLAGS, *PSTRING_TABLE_FLAGS, **PPSTRING_TABLE_FLAGS;
C_ASSERT(sizeof(STRING_TABLE_FLAGS) == sizeof(ULONG));

//
// The STRING_TABLE struct is an optimized structure for testing whether a
// prefix entry for a string is in a table, with the expectation that the
// strings being compared will be relatively short (ideally <= 16 characters),
// and the table of string prefixes to compare to will be relatively small
// (ideally <= 16 strings).
//
// The overall goal is to be able to prefix match a string with the lowest
// possible (amortized) latency.  Fixed-size, memory-aligned character arrays,
// and SIMD instructions are used to try and achieve this.
//

typedef struct _STRING_TABLE {

    //
    // A slot where each individual element contains a uniquely-identifying
    // letter, with respect to the other strings in the table, of each string
    // in an occupied slot.
    //

    STRING_SLOT UniqueChars;

    //
    // (16 bytes consumed.)
    //

    //
    // For each unique character identified above, the following structure
    // captures the 0-based index of that character in the underlying string.
    // This is used as an input to vpshufb to rearrange the search string's
    // characters such that it can be vpcmpeqb'd against the unique characters
    // above.
    //

    SLOT_INDEX UniqueIndex;

    //
    // (32 bytes consumed.)
    //

    //
    // Length of the underlying string in each slot.
    //

    SLOT_LENGTHS Lengths;

    //
    // (48 bytes consumed, aligned at 16 bytes.)
    //

    //
    // Pointer to the STRING_ARRAY associated with this table, which we own
    // (we create it and copy the caller's contents at creation time and
    // deallocate it when we get destroyed).
    //
    // N.B.: we use pStringArray here instead of StringArray because the
    //       latter is a field name at the end of the struct.
    //
    //

    PSTRING_ARRAY pStringArray;

    //
    // (56 bytes consumed, aligned at 8 bytes.)
    //

    //
    // String table flags.
    //

    STRING_TABLE_FLAGS Flags;

    //
    // (60 bytes consumed, aligned at 4 bytes.)
    //

    //
    // A 16-bit bitmap indicating which slots are occupied.
    //

    USHORT OccupiedBitmap;

    //
    // A 16-bit bitmap indicating which slots have strings longer than 16 chars.
    //

    USHORT ContinuationBitmap;

    //
    // (64 bytes consumed, aligned at 64 bytes.)
    //

    //
    // The 16-element array of STRING_SLOT structs.  We want this to be aligned
    // on a 64-byte boundary, and it consumes 256-bytes of memory.
    //

    STRING_SLOT Slots[16];

    //
    // (320 bytes consumed, aligned at 64 bytes.)
    //

    //
    // We want the structure size to be a power of 2 such that an even number
    // can fit into a 4KB page (and reducing the likelihood of crossing page
    // boundaries, which complicates SIMD boundary handling), so we have an
    // extra 192-bytes to play with here.  The CopyStringArray() routine is
    // special-cased to allocate the backing STRING_ARRAY structure plus the
    // accommodating buffers in this space if it can fit.
    //
    // (You can test whether or not this occurred by checking the invariant
    //  `StringTable->pStringArray == &StringTable->StringArray`, if this
    //  is true, the array was allocated within this remaining padding space.)
    //

    union {
        STRING_ARRAY StringArray;
        CHAR Padding[192];
    };

} STRING_TABLE, *PSTRING_TABLE, **PPSTRING_TABLE;

//
// Assert critical size and alignment invariants at compile time.
//

C_ASSERT(FIELD_OFFSET(STRING_TABLE, UniqueIndex) == 16);
C_ASSERT(FIELD_OFFSET(STRING_TABLE, Lengths) == 32);
C_ASSERT(FIELD_OFFSET(STRING_TABLE, pStringArray) == 48);
C_ASSERT(FIELD_OFFSET(STRING_TABLE, Slots)   == 64);
C_ASSERT(FIELD_OFFSET(STRING_TABLE, Padding) == 320);
C_ASSERT(sizeof(STRING_TABLE) == 512);

//
// This structure is used to communicate matches back to the caller.
//

typedef struct _STRING_MATCH {

    //
    // Index of the match.
    //

    BYTE Index;

    //
    // Number of characters matched.
    //

    BYTE NumberOfMatchedCharacters;

    //
    // Pad out to 8-bytes.
    //

    USHORT Padding[3];

    //
    // Pointer to the string that was matched.  The underlying buffer will
    // stay valid for as long as the STRING_TABLE struct persists.
    //

    PSTRING String;

} STRING_MATCH, *PSTRING_MATCH, **PPSTRING_MATCH;
C_ASSERT(sizeof(STRING_MATCH) == 16);

////////////////////////////////////////////////////////////////////////////////
// Function Type Definitions
////////////////////////////////////////////////////////////////////////////////

typedef
_Check_return_
_Success_(return != 0)
PSTRING_ARRAY
(COPY_STRING_ARRAY)(
    _In_ PALLOCATOR StringTableAllocator,
    _In_ PALLOCATOR StringArrayAllocator,
    _In_ PSTRING_ARRAY StringArray,
    _In_ USHORT StringTablePaddingOffset,
    _In_ USHORT StringTableStructSize,
    _Outptr_opt_result_maybenull_ PPSTRING_TABLE StringTablePointer
    );
typedef COPY_STRING_ARRAY *PCOPY_STRING_ARRAY;

typedef
_Check_return_
_Success_(return != 0)
PSTRING_ARRAY
(CREATE_STRING_ARRAY_FROM_DELIMITED_STRING)(
    _In_ PRTL Rtl,
    _In_ PALLOCATOR StringTableAllocator,
    _In_ PALLOCATOR StringArrayAllocator,
    _In_ PCSTRING String,
    _In_ CHAR Delimiter,
    _In_ USHORT StringTablePaddingOffset,
    _In_ USHORT StringTableStructSize,
    _Outptr_opt_result_maybenull_ PPSTRING_TABLE StringTablePointer
    );
typedef CREATE_STRING_ARRAY_FROM_DELIMITED_STRING  \
      *PCREATE_STRING_ARRAY_FROM_DELIMITED_STRING, \
    **PPCREATE_STRING_ARRAY_FROM_DELIMITED_STRING;

typedef
_Check_return_
_Success_(return != 0)
PSTRING_TABLE
(CREATE_STRING_TABLE)(
    _In_ PRTL Rtl,
    _In_ PALLOCATOR StringTableAllocator,
    _In_ PALLOCATOR StringArrayAllocator,
    _In_ PSTRING_ARRAY StringArray,
    _In_ BOOL CopyArray
    );
typedef CREATE_STRING_TABLE *PCREATE_STRING_TABLE;

typedef
_Check_return_
_Success_(return != 0)
PSTRING_TABLE
(CREATE_STRING_TABLE_FROM_DELIMITED_STRING)(
    _In_ PRTL Rtl,
    _In_ PALLOCATOR StringTableAllocator,
    _In_ PALLOCATOR StringArrayAllocator,
    _In_ PCSTRING String,
    _In_ CHAR Delimiter
    );
typedef CREATE_STRING_TABLE_FROM_DELIMITED_STRING  \
      *PCREATE_STRING_TABLE_FROM_DELIMITED_STRING, \
    **PPCREATE_STRING_TABLE_FROM_DELIMITED_STRING;

typedef
_Check_return_
_Success_(return != 0)
PSTRING_TABLE
(CREATE_STRING_TABLE_FROM_DELIMITED_ENVIRONMENT_VARIABLE)(
    _In_ PRTL Rtl,
    _In_ PALLOCATOR Allocator,
    _In_ PALLOCATOR StringTableAllocator,
    _In_ PALLOCATOR StringArrayAllocator,
    _In_ PCSTR EnvironmentVariableName,
    _In_ CHAR Delimiter
    );
typedef CREATE_STRING_TABLE_FROM_DELIMITED_ENVIRONMENT_VARIABLE  \
      *PCREATE_STRING_TABLE_FROM_DELIMITED_ENVIRONMENT_VARIABLE, \
    **PPCREATE_STRING_TABLE_FROM_DELIMITED_ENVIRONMENT_VARIABLE;

typedef
STRING_TABLE_INDEX
(SEARCH_STRING_TABLE_SLOTS_FOR_FIRST_PREFIX_MATCH)(
    _In_ PSTRING_TABLE StringTable,
    _In_ PCSTRING String,
    _In_ USHORT Index,
    _In_opt_ PSTRING_MATCH StringMatch
    );
typedef   SEARCH_STRING_TABLE_SLOTS_FOR_FIRST_PREFIX_MATCH \
        *PSEARCH_STRING_TABLE_SLOTS_FOR_FIRST_PREFIX_MATCH;

typedef
STRING_TABLE_INDEX
(IS_PREFIX_OF_STRING_IN_TABLE)(
    _In_ struct _STRING_TABLE *StringTable,
    _In_ PSTRING String,
    _In_opt_ struct _STRING_MATCH *StringMatch
    );
typedef IS_PREFIX_OF_STRING_IN_TABLE *PIS_PREFIX_OF_STRING_IN_TABLE;

typedef
STRING_TABLE_INDEX
(IS_PREFIX_OF_CSTR_IN_ARRAY)(
    _In_ PCSZ *StringArray,
    _In_ PCSZ String,
    _Out_opt_ PSTRING_MATCH Match
    );
typedef IS_PREFIX_OF_CSTR_IN_ARRAY *PIS_PREFIX_OF_CSTR_IN_ARRAY;

typedef
VOID
(DESTROY_STRING_TABLE)(
    _In_ PALLOCATOR StringTableAllocator,
    _In_ PALLOCATOR StringArrayAllocator,
    _In_opt_ struct _STRING_TABLE *StringTable
    );
typedef DESTROY_STRING_TABLE *PDESTROY_STRING_TABLE;

typedef
_Success_(return != 0)
STRING_TABLE_INDEX
(IS_STRING_IN_TABLE)(
    _In_ struct _STRING_TABLE *StringTable,
    _In_ PSTRING String,
    _In_opt_ struct _STRING_MATCH *StringMatch
    );
typedef IS_STRING_IN_TABLE *PIS_STRING_IN_TABLE;

////////////////////////////////////////////////////////////////////////////////
// Test-related Structures and Function Pointer Typedefs.
////////////////////////////////////////////////////////////////////////////////

typedef struct _STRING_TABLE_TEST_INPUT {
    STRING_TABLE_INDEX Expected;
    PSTRING String;
} STRING_TABLE_TEST_INPUT;
typedef STRING_TABLE_TEST_INPUT *PSTRING_TABLE_TEST_INPUT;
typedef const STRING_TABLE_TEST_INPUT *PCSTRING_TABLE_TEST_INPUT;

typedef DECLSPEC_ALIGN(32) union _ALIGNED_BUFFER {
    CHAR Chars[32];
    WCHAR WideChars[16];
} ALIGNED_BUFFER;
typedef ALIGNED_BUFFER *PALIGNED_BUFFER;
C_ASSERT(sizeof(ALIGNED_BUFFER) == 32);

#define COPY_TEST_INPUT(Inputs, Ix)                                      \
    __movsq((PDWORD64)&InputBuffer,                                      \
            (PDWORD64)Inputs[Ix].String->Buffer,                         \
            sizeof(InputBuffer) >> 3);                                   \
    AlignedInput.Length = Inputs[Ix].String->Length;                     \
    AlignedInput.MaximumLength = Inputs[Ix].String->MaximumLength;       \
    AlignedInput.Buffer = (PCHAR)&InputBuffer.Chars;

#define COPY_STRING_MATCH(Inputs, Ix)                                    \
    StringMatch.Index = Ix;                                              \
    StringMatch.NumberOfMatchedCharacters = Inputs[Ix].String->Length;   \
    StringMatch.String = &StringTable->pStringArray->Strings[Ix];

typedef struct _STRING_TABLE_FUNCTION_OFFSET {
        STRING Name;
        USHORT Offset;
        USHORT Verify;
} STRING_TABLE_FUNCTION_OFFSET;
